"What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards. What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards."