"Who are we looking for? We are looking for a Project Manager in the Finance Strategy & Development team within Group Finance for a 12-Month Fixed Term Contract (full time) based in Milton Keynes, with the potential to go permanent. The team delivers people and Learning & Development (L&D) related initiatives for the finance community. We are recruiting for the L&D Project Manager and Finance new entrants Project Manager. The new entrant management team is responsible for the development and management of the finance new entrant schemes. As Project manager, you will lead the development and delivery of the finance new entrants programme (graduates, apprentices, YII and summer placements) to agreed scope time, cost and quality requirements. You will have line management responsibilities for learners across multiple programmes. You will also work with other line managers to create and maintain project plans to support apprentice and graduate development. The L&D Project Manager delivers exciting Finance L&D initiatives such as the Annual Finance Conference, Talent development programmes, L&D webinars, mentoring programmes, Diversity & Inclusion initiatives as well as manage the sponsorship process for the finance community. Some of these initiatives span across the rail industry and involve finance colleagues from TOCs/FOCs and other rail organisations. You will be working with key stakeholders across the finance community including functional directors, executive sponsors, and their representatives. Central to these roles is the delivery of people related initiatives on behalf of the finance community (e.g. new entrants programme, diversity and inclusion initiatives; L&D initiatives; planning and delivering a yearly induction and training programme for the new entrants). You will work effectively with the wider finance community to empower colleagues (incl. apprentices and graduates) to help them enhance their personal development journeys and participate in industry wide collaborative initiatives for finance."