"North Portfolio offers a unique opportunity to be involved in of all aspects of Rail project delivery on the Eastern Region comprising of the East Coast Mainline, North & East, East Midlands and Anglia routes. Whether delivering renewals with our route colleagues, minor enhancements with our sponsorship colleagues, or 3rd party funded interventions, we deliver projects across a range of disciplines including Signalling, Civil Engineering, Power & Distribution and Telecoms. Delivering projects across all project lifecycle stages, Portfolio North gives a unique development opportunity no matter your current level of experience.The Portfolio North team is made up 130 dedicated professionals delivering a portfolio of projects worth c£1.0bn. Within this the Building & Civils team has a turnover of c£450m over CP7.In Portfolio North we understand the value of developing our people, and our track record for development speaks for itself with almost 50% of our people having been promoted internally. Whatever level you join our team at, there will always be the opportunity to grow and develop in Portfolio North.As well as trusting and developing our people, in Portfolio North our values include supporting the wellbeing of our people, creating an inclusive and respectful environment whilst encouraging creativity, engaging openly and honestly with ourselves and our partners, all whilst driving a positive and safe culture at all times. At the very soul of Portfolio North is enjoying what we do, celebrating our successes, and continual learning.We are looking for a Senior Project Engineer to provide client-side engineering leadership to projects from early development (PACE Phase 1) to delivery and handback (PACE Phase 3/4) within the North and East and East Coast Routes as part of a small team of other client-side engineers. Working within the client team of Portfolio Managers, Commercial Managers and Construction Assurance Specialists and many engineering and operational specialists, the role is required to provide technical leadership and assurance. The role will manage a team of Buildings/Civils Engineers to deliver the Project Engineering roles across a portfolio of works as well as individually deliver the Project Engineer role for specific projects. Projects are delivered collaboratively with our funders and suppliers and a key part of the role will involve the early definition of the technical requirements and alignment to programme and budget."