"The Wales & Western Capital Delivery team believe in the ‘One Team’ ethos. You will be working in a team that is passionate about delivering safely, efficiently and providing value for money for our passengers, train and freight operators and the taxpayer. We are embarking on an exciting delivery model for Control Period 7. Our portfolio is diverse spanning from Buildings & Civils, Enhancements, Track, Signalling, Power and Communications. The projects delivered can range from major enhancements e.g., HS2 Old Oak Common Station on the Great Western Mainline to medium sized enhancements, third party funded projects, renewals and minor works. All of these are key to keeping our railway safe and running. Our focus is on recruiting and retaining people who are key to the running of our railway. We are committed to supporting learning and development and enabling individuals to bring their whole selves to work. We are passionate about diversity and inclusion and have evidenced that a diverse team has enabled better delivery. The location can be Cardiff or Bristol. Please see document attached to this vacancy for more information on what it’s like to work in the Commercial Function of Wales & Western region! Mae Tîm Cyflenwi Cyfalaf Cymru a’r Gorllewin yn credu yn yr ethos ‘un tîm’. Byddwch yn gweithio mewn tîm sy'n angerddol am gyflawni'n ddiogel, yn effeithlon a darparu gwerth am arian i'n teithwyr, gweithredwyr trên a chludo nwyddau a'r trethdalwr. Rydym yn cychwyn ar fodel dosbarthu cyffrous ar gyfer cyfnod rheoli 7. Mae ein portffolio yn rhychwantu amrywiol o adeiladau a sifiliaid, gwelliannau, trac, signalau, pŵer a chyfathrebu. Gall y prosiectau a ddarperir amrywio o welliannau mawr e.e., HS2 Old Oak Common Station on the Great Western Mainline i welliannau maint canolig, prosiectau a ariennir gan drydydd parti, adnewyddiadau a mân weithiau. Mae'r rhain i gyd yn allweddol i gadw ein rheilffordd yn ddiogel ac yn rhedeg. Mae ein ffocws ar recriwtio a chadw pobl sy'n allweddol i redeg ein rheilffordd. Rydym wedi ymrwymo i gefnogi dysgu a datblygu a galluogi unigolion i ddod â'u hunain i weithio. Rydym yn angerddol am amrywiaeth a chynhwysiant ac wedi tystio bod tîm amrywiol wedi galluogi danfon yn well. Gall y lleoliad fod yn Gaerdydd neu Fryste. Gweler y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn swyddogaeth fasnachol Rhanbarth Cymru a Gorllewin!"