"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Finance Business Partner to join our team to work with the supported business leadership team, under the direction of the Financial Controller/Senior Finance Business Partner, to deliver professional finance and accounting advise. Providing proactive, value add finance support to the business leaders across the function/route. Role and Responsibilities may include but are not limited to: 1. Lead and provide financial advice and guidance to senior budget holders in understanding the impact of the period results and forecasts against budges so they can understand their business better. 2. Be the expert in the function on accounting practices and advise on financial results and forecasts for budget holders, including preparing period accruals, transfers and adjustments to validate accounts are reflective, relevant. 3. Manage corporate governance throughout the cost centres they manage, conducting deep dives and reviewing compliance with financial regulations to protect the business from legal or negative consequences. 4. Deliver expert and accurate business review information and reporting, and highlight any significant issues with financial and other business results to enable informed decision making by the business area. 5. Engage and influence senior members of the team to help them understand their financial position and use professional expertise to guide in initiatives to improve business performance 6. Build bottom up, detailed plans to manage and develop the production of business plans and budgets to enable good corporate governance and value add analysis for senior leaders 7. Identify and proactively manage commercial risks, including the financial suitability of new customers or suppliers reducing the potential risk impact on the business area and influencing decision makers. 8. Manage the performance of central accounting functions to deliver for the cost centre area to enable an efficiently and effective accounting service. 9. Collate, investigate and make recommendation for investment appraisals and business case analysis to aid business decisions. 10. Model and analyse cost base and identify and drive opportunities and efficiencies to achieve area targets. **Please note that this is a 12 month secondment opportunity**"