"North Portfolio offers a unique opportunity to be involved in of all aspects of Rail project delivery on the Eastern Region comprising of the East Coast Mainline, North & East, East Midlands and Anglia routes. Whether delivering renewals with our route colleagues, minor enhancements with our sponsorship colleagues, or 3rd party funded interventions, we deliver projects across a range of disciplines including Signalling, Civil Engineering, Power & Distribution and Telecoms. Delivering projects across all project lifecycle stages, Portfolio North gives a unique development opportunity no matter your current level of experience. The Portfolio North team is made up 130 dedicated professionals delivering a portfolio of projects worth c£1.0bn. Within this the Building & Civils team has a turnover of c£450m over CP7. In Portfolio North we understand the value of developing our people, and our track record for development speaks for itself with almost 50% of our people having been promoted internally. Whatever level you join our team at, there will always be the opportunity to grow and develop in Portfolio North. As well as trusting and developing our people, in Portfolio North our values include supporting the wellbeing of our people, creating an inclusive and respectful environment whilst encouraging creativity, engaging openly and honestly with ourselves and our partners, all whilst driving a positive and safe culture at all times. At the very soul of Portfolio North is enjoying what we do, celebrating our successes, and continual learning. We are looking for a Project Engineer to provide client-side engineering leadership to projects from early development (PACE Phase 1) to delivery and handback (PACE Phase 3/4) within the North and East and East Coast Routes as part of a small team of other client-side engineers. Working within the client team of Portfolio Managers, Commercial Managers and Construction Assurance Specialists and many engineering and operational specialists, the role is required to provide technical leadership and assurance. Projects are delivered collaboratively with our funders and suppliers and a key part of the role will involve the early definition of the technical requirements and alignment to programme and budget. For this role we are looking for Civils, Structures, Buildings, Geotech experience from any relevant sectors that can be transferable to the railway environment. Typical schemes in the portfolio cover bridges, stations and earthworks and scope ranges from refurbishment to renewal and minor enhancements. The team also support the Signalling and Power teams with the civils aspects of these projects. We are looking for someone who can lead the building/civils aspects and can bring together all the technical specialists within the railway environment to provide high value, minimum cost solutions which meet the essential needs of stakeholders. The role of the railway is changing and the needs of stakeholders, clients and taxpayers is changing. As a client-side engineering leader, you have a unique opportunity to make these changes happen. This may include reducing embedded carbon, improving weather resilience, moving to a digital railway, embracing new technologies, attracting more leisure travellers, providing for aging customers, reducing the timescales needed to deliver railway projects as part of Project SPEED or demonstrating cost efficiency through the Minimum Viable Product initiatives."