"Network Rail’s Southern region works with train operators to serve passengers and freight customers from Devon in the west, to Kent in the east, and the huge commuter markets of South London. Our railway links major towns and cities and serves channel routes to Europe, as well as Gatwick and Southampton airports. The region is also responsible for some of the busiest stations in the country including Waterloo, London Bridge, Victoria, as well as Cannon Street, Clapham Junction, Charing Cross and Guildford.We operate the busiest and most congested rail lines in the country and are dedicated to putting passengers first. Key to this is effective communications and showing people that we care, highlighting the work we do to enable safe and unincumbered travel. At the heart of our work is the communities we serve and if you join us, you will support the delivery of this important mission.About the roleWe are looking for a Project Communications Manager to join our team in Wessex route, part of the Southern region at Network Rail. We’re investing heavily to renew older parts of our railway, so that passengers can travel without delays. To complete our upgrades, we need to close sections of the railway from time to time, and it’s essential we communicate this clearly, concisely and in good time.Our ideal candidate will have a proven track record in delivering campaigns and be able to manage and deliver consistent and effective communications strategies for our key projects. You will be great at building relationships. Internally you will work closely with our project managers to untangle and explain the complex work they’re delivering, so that everyone understands the benefits of our projects. Externally you will work across the industry with train operating companies to deliver a clear and consistent message, with advice on alternative travel options. We are looking for someone comfortable dealing with agencies, you will know instinctively what messaging will work as we try to modify the travel plans of our passengers and will enjoy promoting our work via traditional and social media. Securing the support of the communities we serve is critical to enabling us to close the railway and managing the resulting disruption, without tarnishing our reputation. You will need to be able to identify opportunities to win the hearts and minds of influential stakeholders so that our project teams can deliver their work. Based in Blackfriars, London, you will report to the Senior Communications Manager as part of the External Affairs team delivering project communications services to the Communications Directorate."