"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Project Engineer [E&P] to join our team to manage design and construction activities for allocated projects. Role and Responsibilities may include but are not limited to: 1. Implement Network Rail systems and procedures to maintain a cost effective, high quality, safe and environmentally responsible approach to design, construction, commissioning and other technical activities on relevant projects, compliant with all relevant legislation. Liaise with regulators and others as appropriate. 2. Engineer Projects to the standards and specification of Network Rail, allocated design and construction contracts include reference to and are compliant with appropriate Railway Group and Network Rail Company standards, formal specifications and procedures. 3. Manage all engineering activities so that they result in schemes that are affordable and meet programme requirements in a safe and environmentally responsible manner for time, cost and quality. 4. Maintain the use of relevant techniques and procedures of quantified and qualitative risk assessment and HAZOP analysis to allocated projects and manage the environmental aspects of allocated projects in accordance with Network Rail’s environmental policy. 5. Monitor design and specialist consultants and contractors. 6. Provide project management advice in respect of all construction activities, including testing and commissioning and site supervision. Manage the design and/or construction elements of relevant projects meet the requirements of current legislation, including construction design management (CDM) regulations. 7. Internal and contractor’s design/construction/specialists personnel are competent. 8. Undertake reviews of design and/or construction activities. Arrange audits of contractors monitoring safety, environment and quality of design, construction, testing and commissioning and management systems is adequate. 9. Carry out the duties of designated project engineer (DPE) for specific projects. 10. Identify and share best practice across the various project teams."