"The East Coast Route is pioneering new methods to better deliver for our customers. We want to introduce you to an exciting opportunity to be part of the leadership of our pioneering Service Delivery Centre (SDC) in York ROC. The Service Delivery Centre is the hub of digital rollout of new signalling technologies as part of the East Coast Digital Programme. To compliment the use of new signalling tools, new ways of working will benefit from signallers, controllers and other supporting roles working side-by-side to deliver a high-performing railway for all our rail users. We are seeking a new link of Service Delivery Supervisors for the York area of the SDC to provide to join us in a role that is vital to our success. Working closely with Industry stakeholders, you will be the key liaison and decision-maker to ensure the capacity of York Station platforms are maximised for the benefit of all passengers. You’ll have a keen customer focus to balance the needs of passengers in Station operations together with protecting performance to deliver on-time services in and out of York. You’ll be enthusiastic and keen to grasp new technologies. This role will be supported by new, proactive railway traffic management tools to enable you to deliver results, day in, day out. If required, you’ll be trained as a competent signaller and given additional training to be able to support and lead your York signalling team in safely running the daily timetable to time. Role and Responsibilities may include but are not limited to: 1. Provide strong leadership and accountability for York Station operations delivery. 2. Lead all Industry stakeholders at York Station to ensure trains are platformed efficiently to maximise performance and passenger satisfaction. 3. Provide instruction and guidance to signalling team in liaison with the Train Running Controller (TRC) so that trains over the route infrastructure are run safely and efficiently and a safe and punctual train service is provided. 4. Implement pro-active train regulating decisions, communicating with Signallers and Control as necessary, using service information and Traffic Management systems, interpreting incoming information to identify potential disruption and initiate early action to minimise train delays. 5. During disruptive events, utilise Traffic Management systems to evaluate the train plan and develop service recovery plans with Control to mitigate safety risk and maximise performance. 6. Identify possible solutions to timetable irregularities and proactively work with Train Planning and Siemens to improve the robustness of the train plan. 7. Operate and assist on signalling workstations as required and where competent to do so to provide operational support during times of high workload and/or in times of exceptional circumstances. Liaise with Electrical Control Room Operators and Signallers to assist in implementing block(s) to electric traction and emergency switch offs as required and as directed, to maintain a safe environment for workforce, customers and passengers."