{"line-1":"Examiner Inspector (ERE) - Homebased","line-2":"Location","line-3":", GB","line-4":"Department Name","line-5":"DG WDM (B&C) EREC (821092) G1","line-6":"About Network Rail","line-7":"Network Rail operates and maintains the railway infrastructure 24/7, 365 days a year. This is an exciting time to join Network Rail. We’re passionate about great service and commit to our service equation vision by “putting passengers first”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves - what can we do to put our passengers and freight users at the centre of everything we do?","line-8":"Brief Description","line-9":"Network Rail’s East Midlands route is seeking an Examiner Inspector (STE4) to perform all Visual work, maximising efficiency and effectiveness, maintaining compliance to company processes at all times. There may be a requirement to undertake a variety of different examination types, although the main workstream is Visual Examinations. BSE (Bridge Strike Examiner) competency will be required to undertake on-call duties, if not held already, full training and mentorship will be provided.Please note this role is home based but will undertake examinations on the Eastern Region in some the following areas, Lincolnshire, Nottinghamshire, Derbyshire, Staffordshire, Leicestershire, Northamptonshire, Bedfordshire, Hertfordshire, Buckinghamshire & London. There may be opportunity to conduct examinations in the Anglia Region, but the role is for the specified locations. We are looking for the candidate to be based in the Lincolnshire area, most preferably in Sleaford, Lincoln, Grantham, Newark-on-Trent or Boston.","line-10":"About the role (External)","line-11":"About this role: · Investigate incidents related to structures examination and provide technical support and advice as needed. · Address and understand technical issues identified by the engineering team through report rejections and briefings. · Ensure the production of technically compliant reports consistently with minimal rejections, managing examiner competence through effective briefing, training, and assessment. · Work to satisfy the requirements of Contract KPIs. · Establish and maintain collaborative relationships within the project to fully understand and implement technical requirements. · Maintain regular liaison with key stakeholders, conducting reviews with the team and participating in site audits, inspections, and trials. · Improve systems, tools, and processes to drive efficiency and bring benefits to the organization. · Compile and submit condition reports for reviewing by the Examining Engineers team. · Undertake on-call duties to support rapid response, including bridge strike situations. · Assist in providing safety-critical site support duties, undertake reconnaissance visits, and make decisions on-site regarding immediate safety issues, imminent structural failure, and operational capabilities following bridge strikes, sometimes under pressure. In order to be successful in this role, we would like you to have/to be: · Have strong communication and inter-personal skills at all levels · Able to take responsibility and work with minimum supervision, at times under pressure · Ability to identify and share engineering best practice within the business · Have excellent organisational skills; be able to multitask and re-prioritise to meet changing needs and deadlines · Thorough knowledge of the technical specification and standards for the CEFA contract and structural examination · Proven railway industry experience in structures examination, maintenance or assessment · Computer literate with a full solid understanding of the Microsoft Office suite, particularly MS excel · Undertake the process of engineering STE2 review and submission of examination reports within your region, including risk scoring and recommendations. · Work alone with minimum supervision · Full driving license We would also like but it isn’t crucial to have/to be: · Bridge Strike Examiner (BSE) with STE 4/SCMI competency. · Holds an ONC/HNC level qualification or Technician Engineer (ICE). · Previous experience in the rail industry with knowledge of railway practices. · Controller of Site Safety/IWA certified. · Proficient in working at heights and has confined space awareness/training. · Holds a Chartered or Incorporated Civil or Structural Engineer status, with a degree or HNC/HND in civil or structures engineering. Also, qualified as an A1 assessor or trainer.","line-12":"How to apply (External)","line-13":"Network Rail encourages applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other relevant factor. We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working recognising that employees may wish to balance work and family/home life.Keeping people safe on the railway is the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail! Applicants should demonstrate their personal dedication to safety in their application.Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). We adhere to a structured pay framework with the following salary progression:· Starting Salary: £28,000 - £32,000 (depending on skills and experience).· Stage 1 Salary: Subject to manager review, starting at £33,500, requiring PTS, Mandatory Training, and successful completion of the Masonry Concrete & Timber training course.· Stage 2 Salary: Subject to manager review, starting at £35,500. This includes Stage 1 criteria plus being assessed to STE4 standard in Masonry, Concrete & Timber, successful completion of the Metallic Training Course, and assessed to full STE4 and COSS/IWA competence.· Stage 3 Salary: Subject to manager review, starting at £36,000. This includes all Stage 2 criteria plus BSE competence. Closing date: 10th December 2023. Late applications won’t be accepted. Network Rail retain the right to close the advert early based on application volumes.#LI-MO1"}