{"line-1":"Asset Protection Scheme Interface Manager","line-2":"Location","line-3":"Swindon, GB","line-4":"Department Name","line-5":"Wales and Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, and enhanced family friendly support. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here.We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"To safely and seamlessly integrate externally funded projects into the railway environment, whilst minimising impacts on railway operations and operational infrastructure. Leverage knowledge and understanding of rail related risks and constraints to facilitate solutions that align with the external client objectives whilst meeting all stakeholder requirements. To provide guidance to the external client team to support adherence to relevant Network Rail and rail industry standards and processes. Ideally have a good understanding of risk assessment in relation to construction methods and a good understanding and appreciation of construction programmes for estimating durations and forecasts in appreciation of customer proposals. Ability to appreciate construction drawings and be a good communicator to facilitate and aid the customer for the delivery of their work proposals.","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:1. Develop and deliver solutions for externally funded, high value, politically sensitive and multi-disciplinary projects (Levels of Control 2, 3 & 4) and where mandated, assure delivery in accordance with the GRIP lifecycle. Manage the seamless integration of all project risks affecting the operational railway.2. Engage with and manage the interface with internal stakeholders to enable compliance with Network Rail governance and assurance processes. Facilitate compliance against the Railways Act and Network Licence and oversee the completion of deliverables.3. Interrogate the Client remit and programme and provide clarity of operational railway interface requirements, devising solutions to enable early and accurate decision making by the Client.4. Liaise with Construction Design Management (CDM) Client and other duty holders to establish principles for project compliance with the CDM Regulations.5. Support the Network Rail interface with projects to secure and allocate resource and assure that delivery of projects is in compliance with Network Rail processes and procedures. Assist in communicating progress against defined milestones and expectations, supporting implementation of contingency measures where necessary.6. Assist in facilitating agreement between all parties to identify which organisation acts as proposer for infrastructure changes in accordance with the Common Safety Method - Risk Assessment Regulations. Monitor and analyse all aspects of risk and performance over the project lifecycle.7. Review lessons learned and develop mitigation strategies with stakeholders to refine project proposals to facilitate successful delivery.8. Build effective relationships with all stakeholders, manage expectations, champion project interests.9. Identify and progress opportunities to reduce Network Rail asset and maintenance liabilities, resolving conflicting works and driving efficiencies.10. Assist in facilitating full recovery of Network Rail costs in accordance with the Legal Agreement between the external party and Network Rail.11. Provide support to accident, incident & close call events, sharing outputs with client teams.You will ideally have · Educated to degree level in a relevant discipline or equivalent experience· Membership (or working towards membership) Association for Project Management· Achieved PRINCE2 Foundation or equivalent.· Knowledge of the operational railway and railway infrastructure· Demonstrable experience of delivery of projects in the rail environment· Excellent stakeholder management and communication skills· Team player able to quickly build relationships and share knowledge acquired· Demonstrable ability to constructively challenge the ideas of others with good evaluation and decision-making skills.· Understanding of project commercial requirements & programme controls· Knowledge of health, safety & environmental requirements and legislation including CDM Regulations and CSM-RA· Knowledge and experience of project budget management.· Knowledge of GRIPCould set you apart· Knowledge of investment, commercial and procurement practices.· Previous experience working within Asset Protection· Understanding of rail infrastructure maintenance techniques· Knowledge of rail possessions/ isolationsNot sure if you meet all the requirements? Let us decide. #LI-EH1#LI-EH1","line-12":"#LI-EH1","line-13":"How to apply (External)","line-14":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £49,037 per annum. Closing date: 12th December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}