{"line-1":"Commercial Manager","line-2":"Location","line-3":", GB","line-4":"Department Name","line-5":"Strategic Sourcing","line-6":"About Network Rail","line-7":"Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions and we do it in millions of different ways. This is an exciting time to join Network Rail, we are passionate about great service and commit to our service equation vision by “Putting Passengers First”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves; what can we do to put our passengers and freight users at the centre of everything we do? We are also proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here. With both our Passengers and Employees in mind, we pull together as one industry because we care about people and teamwork is key. You will be part of the NW&C Region which consist of three routes: North West Central West Coast South In addition to the three routes, there is a Regional team supporting Regional Major Programmes and Professional services. To find out more about NW&C/us, visit - Who We Are. For us, ‘Diversity' means recognising differences between people while valuing the contribution they make. ‘Inclusion’ means creating safe and welcoming workplaces with fair cultures that encourages innovative and fresh ways of thinking. We value the commitments you may have outside of work and will consider flexible working applications. If we can make it work – we will! Please click here for more information. We offer hybrid working - with the requirement to be in the office two/three days a week.","line-8":"Brief Description","line-9":"We have a fantastic opportunity for someone looking to develop their Commercial career path. As a Commercial Manager, you will provide pre and post-contract commercial management for the Maintenance Delivery Units in the Routes. The Maintenance Delivery Units carry out critical maintenance work to keep the railway running, simply put without it, the railway couldn’t operate safely. The Maintenance Delivery Units rely on their supply chain to maintain the railway, it is important they are supported and that the supplier contracts they engage with are operated and administered properly to ensure continual service. Its busy, its reactive, its challenging, no two days are the same, but we operate in a hard-working but friendly and approachable culture. For an insight into a typical day as a Commercial Manager, please click the link to read our article: A Day in the Life of a Commercial ManagerWe have two permanent opportunities and one 12-month secondment/FTC opportunity (with the potential to be made permanent). These roles can be based across our North West & Central Region (at our Milton Keynes, Birmingham, or Manchester offices).","line-10":"About the role (External)","line-11":"Some key responsibilities of the roleThe role is varied across pre contract procurement, post contract administration, financial review, the following is some of the key activities that the Commercial Manager would engage in.1. Manage assessment and valuation of contractor’s applications and processing of payment certification in accordance with Network Rail processes, contractual terms and conditions and commensurate with contractual entitlement. 2. Day to day and reactive commercial management to ad hoc issues such as unexpected variations, claims, negotiation of disputed items, supplier queries and managing corporate governance. 3. Implementing contract extensions where appropriate, identifying variations, ensuring they are valued in accordance with the contract, notifying any effect to budget holders and ensuring all relevant governance is complied with. 4. Regularly meeting key suppliers to ensure performance is up to standard and agree any outstanding contractual matters (such as inflationary issues) 5. Liaising with the Maintenance teams to understanding the overall workabnk to identify where appropriate any annual commitments we might have with our suppliers. In order to be successful in this role, we would like you to have/to be:(Essential)· Extensive experience in commercial management.· Demonstrable relevant experience· Good understanding of NR Suite and construction industry forms of contract· Good understanding of the construction/railway industry· Good negotiation skills We would also like but it isn’t crucial to have/to be:Desirable· Educated to degree standard in related subject· Membership of a relevant professional institute, chartered status· Awareness of industry issues","line-12":"How to apply (External)","line-13":"Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel Database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. A career with Network Rail is a journey and we will do everything we can to make it a great one. We adhere to a structured pay framework, any salary offered will be within the following pay range: Band 4C Starting salary of £43,588 and raising to £49,037. That means plenty of support for personal and professional development. It also means a great range of benefits. Working with us, you’ll enjoy 28 days holiday, access to a range of contributory pension schemes, and the potential to top up your competitive salary with a bonus. We can offer you a season ticket loan, annual season tickets are discounted. What’s more, you can take advantage of childcare vouchers, discounted cycle hire and more. Discover more at www.networkrailcareers.com/benefits. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. You can visit Evenbreak's Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application."}