{"line-1":"Business Solutions Manager - 2 roles","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Finance","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Are you a motivated, self-starter who is keen to collaborate and help the business improve? We are now looking for 2 Business Solutions Managers with experience and ambition in a combination of the following: Business management, coaching, facilitation, change management, improvement planning, project management, assurance, risk management and/or process management - who are motivated to work with business units to help advise and seek solutions to business problems. About the role… Our team provides improved confidence and understanding in the way we manage our business, through pro-active business support, consistent business insights and improved capabilities in governance, assurance, risk, improvement and change management.","line-10":"About the role (External)","line-11":"What will my day look like? As a valued team member, your role will involve: • Working with our core process areas, routes and regions, and linking in with our business units, to further improve the business and embed our ‘the way we manage our business’ framework. • Facilitating and shaping solutions, developing strong business cases for change and improvement, and coaching our leaders in the delivery of benefits that enable better business outcomes. • Advocating for and improving the core process for the way we manage our business including the 'Managing Change and Improvement' framework (process and policy) • Facilitating business opportunity development (solutions) to enable stronger processes and controls, better understanding of emerging risks, driving the way we manage our business to be more predictive, preventative and less reactive. What Essential criteria is needed for this role? • Demonstrates strong business/commercial approach and understanding of business management process and capability. • Strong ability to manage a variety of stakeholders at all levels of the business • Clear understanding of coaching ability and/or demonstrable experience • Strong communication skills including workshop facilitation • Proven ability to review and edit requirements, specifications, and processes, and recommend solutions • Good knowledge of project management, risk management, assurance review, change and improvement process, tools, and techniques. • Proven track record of defining and delivering business processes at an enterprise level • Ability to tailor presentation styles to suit audience levels. • An ability to work autonomously under pressure in a rapidly evolving environment. • Proficient use Microsoft Office, including Word, Excel and PowerPoint. • Comfortable to challenge with evidence as appropriate, Additional criteria that would be beneficial or can be developed for this role? • Experience in delivering strategic change projects/programmes in matrix organisations • Advising senior business leadership • Ability to review and edit requirements, specifications, and processes, and recommend solutions • Clear understanding of coaching and/or demonstrable experience • Excellence in facilitation of small or medium size workshops • Defining and delivering business processes at an enterprise level • Comfortable to challenge with evidence as appropriate Desirable: • Formal qualification in Coaching (ILM, ECA) • Formal qualifications in Agile, ISEB, Business Improvement, and/or Project Management would be of interest • Professional qualifications such as ACMA, CQI desirable • Detailed understanding of the railway industry, its key business processes and interfacesFor a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent - 2 roles available Location: The Quadrant:MK. For roles based at the Quadrant:MK you must live within 75/90 minutes. Closing date: 30th Nov 2023. Late applications may be considered. Interviews will be held in Dec 2023 Band & Salary: Band 3B: £46,701 - £52,538 What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact RecruitmentSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}