{"line-1":"Installer","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Route Services","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards. What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards.","line-10":"What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards.","line-11":"About the role (External)","line-12":"Key Accountabilities, in addition to the above... You will install signalling infrastructure to the specified standards and instructions Undertake all work as directed within the limits of competencies attained You ensure all work is undertaken safely in line with the appropriate standards Performing and recording results of the safety tests on critical equipment and systems. You can assist with Testing where required in accordance with the Signal Maintenance Testing Handbook Undertake additional skills training as necessary. You will be required to undertake COSS and Lookout duties as required. Training and guiding others on safety & technical matters. Job Skills, Experience & Qualifications Do you meet the criteria for this role? Essential IRSE Signal Installer Licence or Equivalent Competence Assessment (a must have and in date or has evidence of working towards) Recognised Apprenticeship, City and Guilds (Parts 1 & 2), BTEC or Network Rail Trainee Programme or equivalent S&T experience Competencies: PTS Site Warden COSS EAW Emergency 1st Aid Fire Training Wire Degradation IRSE Signal Installer Licence or Equivalent Competence Assessment (is a requirement) Full Driving Licence. (Must have) Other Basic level of skills in: IT literacy Statutory Procedures Electronic Test Equipment Key Accountabilities, in addition to the above... You will install signalling infrastructure to the specified standards and instructions Undertake all work as directed within the limits of competencies attained You ensure all work is undertaken safely in line with the appropriate standards Performing and recording results of the safety tests on critical equipment and systems. You can assist with Testing where required in accordance with the Signal Maintenance Testing Handbook Undertake additional skills training as necessary. You will be required to undertake COSS and Lookout duties as required. Training and guiding others on safety & technical matters. Job Skills, Experience & Qualifications Do you meet the criteria for this role? Essential IRSE Signal Installer Licence or Equivalent Competence Assessment (a must have and in date or has evidence of working towards) Recognised Apprenticeship, City and Guilds (Parts 1 & 2), BTEC or Network Rail Trainee Programme or equivalent S&T experience Competencies: PTS Site Warden COSS EAW Emergency 1st Aid Fire Training Wire Degradation IRSE Signal Installer Licence or Equivalent Competence Assessment (is a requirement) Full Driving Licence. (Must have) Other Basic level of skills in: IT literacy Statutory Procedures Electronic Test Equipment","line-13":"Key Accountabilities, in addition to the above... You will install signalling infrastructure to the specified standards and instructions Undertake all work as directed within the limits of competencies attained You ensure all work is undertaken safely in line with the appropriate standards Performing and recording results of the safety tests on critical equipment and systems. You can assist with Testing where required in accordance with the Signal Maintenance Testing Handbook Undertake additional skills training as necessary. You will be required to undertake COSS and Lookout duties as required. Training and guiding others on safety & technical matters. Job Skills, Experience & Qualifications Do you meet the criteria for this role? Essential IRSE Signal Installer Licence or Equivalent Competence Assessment (a must have and in date or has evidence of working towards) Recognised Apprenticeship, City and Guilds (Parts 1 & 2), BTEC or Network Rail Trainee Programme or equivalent S&T experience Competencies: PTS Site Warden COSS EAW Emergency 1st Aid Fire Training Wire Degradation IRSE Signal Installer Licence or Equivalent Competence Assessment (is a requirement) Full Driving Licence. (Must have) Other Basic level of skills in: IT literacy Statutory Procedures Electronic Test Equipment","line-14":"How to apply (External)","line-15":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working recognising that employees may wish to balance work and family/home life. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). We adhere to a structured pay framework, any salary offered will be within the following pay range: £33,274 to £38,090 Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. Closing date: 1st December 2023 Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes. (External and Contractors) Drugs and Alcohol Standard: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working recognising that employees may wish to balance work and family/home life. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). We adhere to a structured pay framework, any salary offered will be within the following pay range: £33,274 to £38,090 Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. Closing date: 1st December 2023 Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes.","line-16":"Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working recognising that employees may wish to balance work and family/home life. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). We adhere to a structured pay framework, any salary offered will be within the following pay range: £33,274 to £38,090 Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. Closing date: 1st December 2023 Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}