{"line-1":"Project Engineer - Buildings & Civils","line-2":"Location","line-3":"Manchester, GB","line-4":"Department Name","line-5":"IC NWC CD Eng - Buildings Renewals (453325) G2","line-6":"About Network Rail","line-7":"Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You will be part of the North West & Central Region (NW&C) which consist of three routes – North West, Central and West Coast South – and a regional team supporting Regional Major Programmes & Professional services.","line-8":"Brief Description","line-9":"*This is a Talent Pool for any future positions that may open, so if you are interested in being considered for these roles in the future, please submit your CV* The Building, Civil and Lineside (BCL) team are a regional team (NW&C) of diverse engineering capabilities that provide technical and engineering support services to the Building, Civil and Lineside programmes as well as central operational functions. As a Project Engineer, you will work as part of a multi discipline engineering team to deliver projects across the Building, Civil and Lineside portfolio. The Project Engineer role will involve managing design and/or construction activities for allocated projects. You will ensure compliance to the requirements of the guide to the relevant legislation, group and company standards, and Network Rail procedures on allocated projects within the BCL programme. You will also be responsible for collaborating closely with CREs’ and projects managers along with other internal and external stakeholders. This role can be based out of the Manchester/Birmingham office, but the role will involve flexible working from other offices as and when necessary. The applicant will be required to work across a number of projects in the portfolio and should have knowledge of relevant standards, particularly including NR/L2/INI/02009 We have two disciplines streams available. 1. Buildings Portfolio 2. Civils/Lineside","line-10":"About the role (External)","line-11":"What will your role include? § Engineering Projects to the standards and specification of Network Rail, allocated design and construction contracts include reference to and are aligned with appropriate Railway Group and Network Rail Company standards, formal specifications, and procedures. § You will lead all engineering activities so that they result in schemes that are affordable and meet programme requirements in a safe and environmentally responsible manner for time, cost and quality. § You will be maintaining the use of relevant techniques and procedures of quantified and qualitative risk assessment and HAZOP analysis to allocated projects and lead the environmental aspects of allocated projects in accordance with Network Rail’s environmental policy. § You will monitor design and specialist consultants and contractors. § You are providing project management advice in respect of all construction activities, including testing and commissioning and site supervision. Manage the design and/or construction elements of relevant projects meet the requirements of current legislation, including CDM regulations. § You ensure that internal and contractor’s design/construction/specialist’s personnel are competent. § Undertaking reviews of design and/or construction activities. Arrange an audit of contractors monitoring safety, environment and quality of design ensuring that construction, testing, commissioning and management systems are adequate. § You carry out the duties of designated project engineer (DPE) for specific projects. § You identify and share company practices across the various project teams. In order to be successful in this role, we would like you to have/to be: · Successful relevant experience in Buildings, Civils, Structural and / or Building Services engineering, ideally with involvement in construction and design projects across multi discipline areas · Technical qualifications to either HNC/HND or equivalent GNVQ level. · Knowledge of Quality Assurance in a Buildings/Civil Engineering capacity. · You have a deep understanding of the arrangements required for the independent assessment of work. · Construction Design Management, risk assessment, engineering management competency. We would also like but it isn’t crucial to have/to be: · Membership of a relevant professional body with either Incorporated or chartered status and/or educated to degree level. · Knowledge of structuring safety cases in support of projects. · An appreciation of environmental issues in engineering works. · Six Sigma Yellow Belt. · Project safety management experience · Yellow book course. · You have a Personal Track Safety Competency","line-12":"How to apply (External)","line-13":"Salary: £43,588 - £49,037. Closing date: 31 December 2023. - Late applications will not be accepted. Click apply now to apply. Remote working opportunity! this role requires working in the office 2/3 days a week. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. If successful at interview you will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Salary: £43,588 - £49,037. Closing date: 31 December 2023. - Late applications will not be accepted. Click apply now to apply. Remote working opportunity! this role requires working in the office 2/3 days a week. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. If successful at interview you will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information","line-14":"Salary: £43,588 - £49,037. Closing date: 31 December 2023. - Late applications will not be accepted. Click apply now to apply. Remote working opportunity! this role requires working in the office 2/3 days a week. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. If successful at interview you will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}