{"line-1":"Project Manager","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Finance","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Who are we looking for? We are looking for a Project Manager in the Finance Strategy & Development team within Group Finance for a 12-Month Fixed Term Contract (full time) based in Milton Keynes, with the potential to go permanent. The team delivers people and Learning & Development (L&D) related initiatives for the finance community. We are recruiting for the L&D Project Manager and Finance new entrants Project Manager. The new entrant management team is responsible for the development and management of the finance new entrant schemes. As Project manager, you will lead the development and delivery of the finance new entrants programme (graduates, apprentices, YII and summer placements) to agreed scope time, cost and quality requirements. You will have line management responsibilities for learners across multiple programmes. You will also work with other line managers to create and maintain project plans to support apprentice and graduate development. The L&D Project Manager delivers exciting Finance L&D initiatives such as the Annual Finance Conference, Talent development programmes, L&D webinars, mentoring programmes, Diversity & Inclusion initiatives as well as manage the sponsorship process for the finance community. Some of these initiatives span across the rail industry and involve finance colleagues from TOCs/FOCs and other rail organisations. You will be working with key stakeholders across the finance community including functional directors, executive sponsors, and their representatives. Central to these roles is the delivery of people related initiatives on behalf of the finance community (e.g. new entrants programme, diversity and inclusion initiatives; L&D initiatives; planning and delivering a yearly induction and training programme for the new entrants). You will work effectively with the wider finance community to empower colleagues (incl. apprentices and graduates) to help them enhance their personal development journeys and participate in industry wide collaborative initiatives for finance.","line-10":"About the role (External)","line-11":"What does the average day look like? Are you ready to take on a challenging and rewarding role in project management (people initiatives). Join us and be part of something big! Here's what you'll be doing: · Project Delivery: Your main job is to make sure our people related projects are completed safely, on time, within budget, and meet the quality standards. You'll follow the rules set out in the Network Rail company standards, finance regulations and legal requirements. · Top-Notch Service: We need you to provide top-quality project management services to our clients. This means keeping a close eye on projects, monitoring progress, and reporting regularly. You'll follow Railway Group and Network Rail company standards and guidelines. · Supply Strategies: You'll be involved in creating strategies for getting the supplies we need and managing framework contracts. As a New Entrants Project Manager, you will also manage the finance apprenticeship process and maintain learning & development contracts for apprenticeships. · Planning Expert: Your input will be crucial in making our business plan and project plans. Your attention to detail matters. · Risk Control: You'll be responsible for managing changes, risks, and contingencies during the project. You'll also provide cost, contingency, and program details so our Sponsor can get the green light for portfolios, programs, and projects. · Safety First: Safety is paramount. You'll ensure a safe working environment for your team, including creating project safety plans and other necessary documents. · Training Support: Identify the training needs of your team members, the new entrants and the wider finance community, and help them grow in their careers and support the pipeline of future talent in Finance. · Competence Matters: Follow the Finance Competence Framework to ensure you're up to the task. · Teamwork: You'll build and lead collaborative cross-functional virtual teams to bring about change projects when necessary. · Expertise Matter: You will be the Subject Matter Expert in L&D and will engage with internal and external stakeholders to define, develop and deliver a high quality L&D programme for our clients. If you're up for the challenge and ready to make a difference, apply today! Your skills will help us shape the future of our people related projects in finance, and your career will thrive with us. Join our team and be part of the exciting world of project management. What essential skills and experiences are required? Ready for an exciting opportunity? Here's what we're looking for; Education Matters: You should have a degree or something similar that shows your qualifications. Project Pro: We want someone with a track record of successful experience in project management for delivering people related initiatives. People Person: Great communication and interpersonal skills are a must. We value teamwork and collaboration. For the New Entrants Project Manager, experience of working with new entrants makes a difference! Safety Savvy: You should know your way around safety regulations and have knowledge of safeguarding principles). Team Captain: As a leader, you'll need to motivate your team and bring out the best in them. Numbers and Sense: A good grasp of commercial and financial matters is important. Professional Touch: Being a qualified accountant or a member of the Association for Project Management or another professional body is a plus. If you've got these qualifications and skills, we want to hear from you! Join us and be part of our dynamic team. Your expertise will help us achieve our goals, and your career will thrive with us. Apply today and become a key player in the world of project management. Apply now and help us create a brighter future together! 🚄🌟 For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: 12-Month Fixed term Contract, full-time opportunity, with the potential to go permanent Location: Milton Keynes: The Quadrant. If you are applying for a role at the Quadrant you must live no more than 90 minutes Closing date: 5th December 2023. Late applications will not be accepted. Interviews: Interviews will be held W/c 11th December 2023 (The date is dependent on business requirements) Band & Salary: Band 3B: £46,701 - £52,538 per annum, (dependent upon experience) plus benefits. What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. What does our recruitment process look like? 1. Once you have applied, our Recruitment Specialist will look at your CV. 2. If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment. 3. If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}