{"line-1":"Senior Technical Officer [Track] - Morpeth Coopies Lane","line-2":"Location","line-3":"Morpeth, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Provide technical support to the Maintenance Engineering team.","line-10":"About the role (External)","line-11":"Key Accountabilities1. Carry out work safely and in accordance with the safe systems of work procedures, method statements, plans and other instructions.2. Adhere to company policies and procedures3. Manage and check the quality of work delivered and confirm assets are compliant to standards.4. Manage the preparation of work and resource specifications, method statements and plans.5. Provide technical support and guidance.6. Design, install, test and commission equipment.7. Undertake and supervise technical tasks, survey and design work.8. Undertake technical inspections, tests, investigations and analysis of technical data.9. Manage and supervise the delivery and output of On Track Machine operations.10. Prioritise work arising and agree work plans for the group.11. Prepare specifications and requisition for materials.12. Manage processes and systems for the calibration and certification of tools and equipment.13. Manage information to update systems, databases and records.14. Contribute to your own development and that of others.Experience, skills, knowledge and competencies.1. Knowledge of technical support activities and techniques.2. Knowledge and experience of permanent way maintenance and construction management process, systems and standards.3. Knowledge of design requirements, processes and techniques.4. Able to demonstrate, promote and embed safe working behaviours within the team.5. Able to communicate effectively verbally and in writing.6. Able to coach, influence and develop others.7. Hold and retain the competencies relevant to this post and required by business need.8. Ideally hold or be working towards and NVQ level 2 or 3 (or equivalent) in an engineering/leadership subject.9. Able and willing to drive vehicles as required by business need.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: TBCClosing date: 21st December 2023. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}