{"line-1":"Asset Engineer","line-2":"Location","line-3":"Glasgow, GB","line-4":"Department Name","line-5":"AM RAM Geotechnics, Drainage & Off Track","line-6":"About Network Rail","line-7":"At Network Rail, our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. Watch our video to find out more! Scotland's Railway is part of this large family, and it covers a large geographical area from the Borders to Thurso at the far tip of the North East of Scotland, accounting for almost 20 per cent of the UK rail network. We provide rapid access along busy commuter routes to our seven cities, servicing the varied needs of our business and leisure commuter services, including cross border services and rural services. We have up to 50 freight services operating every day and we are steadily building capacity for this to grow. Our ambition to be responsive to passengers and freight users, drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues and protecting safety and wellbeing. Our colleagues are encouraged to work flexibly as we know that busy lives don’t always fit around a traditional working pattern, if you need flexibility to complete your role just let us know and we will do our upmost to help you to invest in your career with us while balancing other aspects of your life. We're also a Disability Confident Leader employer and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"Scotland’s Railway Geotechnical Asset Management Team have two openings for Geotechnical Asset Engineers to join their team. The role involves managing the risks associated with geotechnical and drainage assets, carrying out evaluations and risk assessments, producing remits for intervention works and monitoring systems, and evaluating the effectiveness of delivered works. The role will involve a good mixture of site-based and desk-based activities and you will be working on multiple portfolios of small scale and major projects covering the West of Scotland.","line-10":"About the role (External)","line-11":"Here are some of the duties your role will include: -· Lead the requirements for examination and undertake evaluation, assessment and risk management of geotechnics assets. Manage compliance of examination and evaluation of geotechnics assets against requirements of standards.· Provide engineering input to the standards and specifications for geotechnics examinations and assessments.· Maintain comprehensive and accurate asset records.· Direct the implementation of monitoring systems and undertake the review of monitoring results and other control measures.· Support the development of route specific plans including all maintenance and renewal activities and asset strategies, providing the prioritised investment work bank. Support the inclusion of all investment items into appropriate programmes and track through to completion including approval of programme changes.· Provide support to the production and prioritisation of the route business plan. Support the production of remits for investment schemes.· Monitor trends arising from examinations and evaluations, assessments, asset capability and failure precursors and confirm that action is specified and taken and participate in investigations of incidents.· Liaise with community relations to support the resolution of geotechnics issues impacting on neighbours and third parties.· Provide engineering input to the specification and management of geotechnics examination contracts. Investigate and resolve technical and quality issues with suppliers.What you will bring to the role: -· HNC/HND or equivalent qualification in relevant subject.· Substantial experience of geotechnics asset examination and assessment· An understanding of safety management systems and risk assessment techniques· Awareness of Construction Design and Management Regulations· Working towards membership of a relevant professional institutionIt’s desirable if you have it to help give you context to the role: -· Degree in a relevant subject· Incorporated Engineer or Chartered Engineer· Member of a relevant professional institution","line-12":"How to apply (External)","line-13":"Salary: Starting at £43,588 and rising to £49,037 per annum. Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 17/12/2023 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. Click ‘apply now’ to apply. We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}