{"line-1":"Environment Specialist","line-2":"Location","line-3":"Bristol, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"Do you have a keen interest in environmental challenges and/or a good understanding of the railway? Do you want to help contribute to climate change mitigation? The railway is an enabler for Net Zero and a clean way of travelling and you could be working in an industry that is part of the solution! Assurance plays a big part in our pledge to achieve Net Zero by 2050. This role will support colleagues on environmental management and carry out assurance activities.","line-10":"About the role (External)","line-11":"We are looking for a diligent, process driven person, with excellent negotiating skills and a passion for driving environmental protection.Do you have:· Good understanding of environmental management, mitigation and legislation or has fundamental knowledge to build on?· Relevant experience and skills to assess environmental risk, using likelihood and severity as the basis?· Confidence to communicate environmental principles and facilitate engagement on environmental topics?· Good interpersonal, communication and organisational skills?· Experience of undertaking assurance aligned to internal standards? Are you:· Diligent and process driven?· Able to develop strong working relationships with internal and external stakeholders?· Able to build close relationships with internal delivery teams?· Self-motivated with the ability to influence at all levels?· Motivated by working towards a railway infrastructure that is contributing to a greener future?Not sure if you meet all the requirements? Let us decide. Benefits· Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members.· A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR Ticket Alliance - £8 all-day pass on the GWR network for yourself and 6 others (up to 20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of pension schemes· Effectively manage work-life balance with a 35hrs per week contract, with hybrid working, flexible working, flexible leave, and family friendly support.· 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.To find out more about the benefits at Network Rail, click here. OpportunitiesYou will have the opportunity to open doors and forge a career in Environmental Sustainability, Health, Safety & Environment, Project Management or in our Supply Chain, whilst having the chance to make a difference and contribute to our pledge to making the railway a greener way to travel.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582 - £40,029 per annum. Hybrid working available – 2/3 days in the office/on site (35 hours a week). Closing date: 2nd January 2024. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}