{"line-1":"Network Technical Head Track","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"ST T&SC (571107) G1","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. Our passengers and freight customers are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. #LI-MH1","line-8":"Brief Description","line-9":"Join Our Team as Network Technical Head Track! At Network Rail, we're more than just a railway infrastructure operator - we're a passionate team dedicated to crafting safe, reliable, and efficient transportation for people and goods. We take pride in supporting our country's economic prosperity and sustainable future. Now, we're looking for a Network Technical Head on a permanent basis, to lead our track engineering asset in Milton Keynes. If you're ready to make a significant impact and be a part of our inclusive and dynamic organisation, keep reading!","line-10":"About the role (External)","line-11":"What Will You Be Doing? As our Network Technical Head Track, your role will be diverse and engaging. You'll have the opportunity to: Shape and maintain company policy and technical strategies for track engineering, collaborating with other teams to achieve our strategic objectives. Be the technical authority for track engineering, ensuring compliance with our safety management system. Provide professional leadership to engineers throughout the company, mentoring and challenging them to excel in their field. Influence the development of regulations and standards, safeguarding Network Rail's interests and reflecting them in our documentation. Represent our track engineering interests with internal and external customers, including safety and financial regulators. Develop and oversee track engineering technical rules, controls, specifications, procedures, and good practice guides. Define track engineering design principles to drive innovation and excellence. Establish and manage the track engineering assurance regime, advising the Board on business performance. Play a key role in investigating safety and performance failures, implementing technical recommendations. Who Are We Looking For? To excel in this role, you should possess the following qualifications and qualities: Chartered Engineer or equivalent professional engineering qualification (Level 7). Recognised leadership capabilities in track engineering. Strong understanding of asset management strategies. Extensive experience in managing engineering processes, assets, and products. Extensive knowledge of engineering systems, standards, and process integrity. Previous experience in driving engineering improvements in safety-critical or public-facing industries. Ability to encourage and empower others. Resilience to prioritise multiple engineering issues simultaneously. For a comprehensive list of the role's key accountabilities, as well as essential and desirable criteria, please click apply and you will be redirected to the Network Rail external website where you can find the Network Rail job description dedicated to this advert. If you're ready to tackle phenomenal opportunity, apply now! #LI-MH1","line-12":"How to apply (External)","line-13":"We Are an Inclusive Employer! Network Rail is proud to be an inclusive employer of choice and a Disability Confident Leader. We encourage flexible working and welcome applications from individuals from all backgrounds. Click here for more information on our commitment to diversity and inclusion. If you require accessibility support to apply, visit Evenbreak's Career Hive. If you're ready to tackle phenomenal opportunity, apply now! by clicking 'Apply' and following the application process. Don't Miss Out! Vacancy details: - • Vacancy Type: Permanent, Full Time • Location: Nationwide recruitment is being used for this role but at present the role is based in Milton Keynes. • Closing date: 02nd January 2024 - Late applications will not be accepted. (please note that Network Rail reserves the right to close the role before the advertised closing date due to the number of application received) • Interviews: This will be a two stage interview process; 1st Interviews (competency based) will be held week commencing 15th January 2024 (date subject to change). If successful in your first interview, you will be invited to a second interview which will consist of a psychometric assessment, 10 – 15 minute presentation followed by technical questions. • Band & Salary: Band 1B (£93,636 - £105,341) , salary range is dependent upon experience, plus a comprehensive benefits package. Why Join Us? At Network Rail, we value our employees and offer a range of benefits to support their well-being and professional growth, including: 🌞 Generous annual leave, with the option to buy/sell days. 🚗 Car allowance. 🏢 Regional allowance for London or Southeast-based roles. 💰 Performance-related pay scheme. 🚂 75% subsidy on train/underground season tickets. 🎟️ Interest-free travel loan for train and car park season tickets. 🤝 Employee assistance scheme. 👶 Childcare vouchers. 🎁 Discounts at stations with your Network Rail pass. 🌍 Flexible/hybrid working arrangements. 🕊️ Volunteer leave to make a positive impact. 💪 Training and development opportunities. Security and Safety. As an arm's length department of the UK Government, Network Rail follows a pre-employment vetting process. This includes BPSS checks, which involve eligibility to work in the UK, an employment history check, and an unspent criminal conviction disclosure check. Your well-being and safety are of utmost importance to us. Therefore, all conditional job offers will be subject to a drugs and alcohol test. If you have any questions or to request a reasonable adjustment, please email your C.V. to recruitmentsupport@networkrail.co.uk, and please ensure that you have the IRC number of the vacancy as you will need to quote this. What are you waiting for? join us today and help us make a substantial impact on our nation's transportation landscape! #LI-MH1"}