{"line-1":"Signal Sighting Engineer","line-2":"Location","line-3":"Birmingham, GB","line-4":"Department Name","line-5":"OY Route Signalling Engineer WCMLS (542912) G2","line-6":"About Network Rail","line-7":"We're proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here. Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions. And we do it in millions of different ways. We’re passionate about great service and commit to our service equation vision by “putting passengers first”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves - what can we do to put our passengers and freight users at the centre of everything we do? You will be part of the NW&C Region which consist of three routes: North West Route, covering Manchester, Liverpool, Lancashire and Cumbria. Central Route, covering the West Midlands and Chiltern areas. West Coast South Route, covering the south of Crewe to London Euston. There is also a Regional Team which supports Regional programmes & Professional services. To find out more about us - Take a look here! We value the commitments you may have outside of work and will consider flexible working applications. If we can make it work – we will! Please click here for more information.#LI-IM1","line-8":"Brief Description","line-9":"What will you be doing? Manage SPAD (signal passed at danger) mitigation and associated signal sighting activities across the allocated geography.","line-10":"About the role (External)","line-11":"Every day will be different, but you can expect to be involved in the following activities:1. Lead the technical investigation of category A SPADs, convening the signal sighting committee as necessary. Prepare reports and recommendations for approval. Provide and analyse statistical data on category A SPADs.2. Specify work relating to signal sighting and category A SPAD mitigation in order to deliver Network Rail’s goals.3. Convene signal sighting committee meetings as directed in connection with signal major and minor works schemes, CIRAS report and TOC/FOC complaints.4. Plan, direct and undertake signal sighting inspections and assessments in compliance with Railway Group and Company standards and procedures.5. Review the technical and procedural content of standards relating to signal sighting. Identify the necessary actions for complying with new or revised standards and recommend appropriate non-compliance.6. Produce and check signal sighting forms, sign off where allocated and maintain records.7. Monitor compliance with relevant competence standards, particularly in respect of projects and minor works activities, and address any shortcomings. 8. Provide professional technical support relating signal sighting as required.9. Identify opportunities for innovation to improve signal sighting. In order to be successful in this role, we would like you to have/to be:· ONC or equivalent qualification in relevant subject· Significant relevant experience· Holder of Sentinel Signal Sighting Competency Committee Chair We would also like but it isn’t crucial to have/to be: · Incorporated Engineer· Signalling Maintenance Testing Handbook qualification","line-12":"How to apply (External)","line-13":"We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business Click here for more information Want to find out about what fantastic benefits we offer? Find out here Salary: Band 4C, starting at £43,588 and increasing to £54,484 Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Closing date: 5 December 2023. Late applications will not be accepted. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a diverse interview panel wherever possible. Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}