{"line-1":"Senior Technical Officer [Track]","line-2":"Location","line-3":"Liverpool, GB","line-4":"Department Name","line-5":"Liverpool Cent CMD","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"What will you be doing?Provide technical support to the Maintenance Engineering team.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Carry out work safely and in accordance with the safe systems of work procedures, method statements, plans and other instructions.2. Adhere to company policies and procedures3. Manage and check the quality of work delivered and confirm assets are compliant to standards.4. Manage the preparation of work and resource specifications, method statements and plans.5. Provide technical support and guidance.6. Design, install, test and commission equipment.7. Undertake and supervise technical tasks, survey and design work.8. Undertake technical inspections, tests, investigations and analysis of technical data.9. Prioritise work arising and agree work plans for the group.10. Prepare specifications and requisition for materials.11. Manage processes and systems for the calibration and certification of tools and equipment.12. Manage information to update systems, databases and records.13. Contribute to your own development and that of others.Experience, skills, knowledge and competencies: 1. Knowledge of technical support activities and techniques.2. Knowledge and experience of electrification and plant maintenance and construction management process, systems and standards.3. Knowledge of design requirements, processes and techniques.4. Able to demonstrate, promote and embed safe working behaviours within the team.5. Able to communicate effectively verbally and in writing.6. Able to coach, influence and develop others.7. Hold and retain the competencies relevant to this post and required by business need.8. Ideally hold or be working towards and NVQ level 2 or 3 (or equivalent) in an engineering/leadership subject.9. Able and willing to drive vehicles as required by business need.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business Click here for more information Want to find out about what fantastic benefits we offer? Find out here Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Salary:IMC40 - Starting salary £35,367.00 Closing date: 20th December 2023. Late applications will not be accepted. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a gender diverse interview panel wherever possible. We retain the right to close the advert before the listed closing date (based on application volumes) so if you are interested in this vacancy, we encourage you to submit your application as early as possible."}