{"line-1":"Project Manager - East Midlands Control Centre (12 Month Secondment/FTC)","line-2":"Location","line-3":"Derby, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To lead the safe delivery of projects to achieve cost, time and quality objectives within corporate guidelines and to develop appropriate delivery and supply strategies and plans for specific projects.Please note that this is a 12 month secondment opportunity with the potential of being extended or becoming permanent.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Deliver the project(s) safely to time, cost and quality, in accordance with the Guide to Railway Investment Projects (GRIP), applicable Railway Group, Network Rail company standards and other specific legislation including construction design management (CDM) Regulations.2. Provide a professional, first class, consistent and effective project management service to the clients, including project monitoring and reporting systems in accordance with Railway Group, Network Rail company standards and guidelines.3. Participate in the development of supply strategies and framework contracts.4. Provide detailed input for compilation of the business plan and production of programme / project plans. 5. Control project change, risks and contingency within the project life cycle and provide all cost, contingency and programme details to enable the Sponsor to obtain authorisation for portfolios / programmes / projects.6. Provide a safe working environment in the execution of work directly under the post holder’s responsibility, including development of project safety plans and other associated documentation.7. Discharge Network Rail’s CDM related duties as required by company process.8. Identify training needs in safety, technical and management areas for the personnel reporting to the post holder and contribute to their personal development.9. Comply with the Investment Competence Framework.10. Establish and manage collaborative cross-functional virtual teams to deliver change projects, where appropriate. Job Skills, Experience and Qualifications: Essential· Degree or equivalent· Relevant successful experience in project management· Excellent interpersonal and communication skills· Detailed knowledge of safety regulations (particularly CDM)· Team leader capable of motivating the team· Commercial and financial understanding and knowledge· Membership of the Association for Project Management or other professional body Desirable· Six Sigma Yellow Belt· Knowledge of investment processes and procedures· Knowledge and understanding of project and contract management","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £46,701 - £52,539Closing date: 27th November 2024. - Late applications will not be accepted.Click apply now to apply.This is a fixed term opportunity for 12 months and has the potential to become permanent.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}