{"line-1":"Compliance Auditor","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To undertake audits and deliver the Functional Audit Programme, verify the effectiveness of the audit framework and support the delivery of improvements where identified","line-10":"About the role (External)","line-11":"1. Carry out functional audits and other special topic and cross-functional audits, as specified in the Functional Audit Programme. 2. Co-ordinate and carry out Manager Self Assurance coaching sessions, review findings, making recommendations and provide insights and intelligence. 3. Assist in the development of detailed audit protocols for the audits, co-ordinating the input of technical specialists as required. 4. Work with line managers to determine a risk based approach to directing the audits, taking into consideration the delivery needs of the organisation. 5. Implement the audit arrangements to agreed timescales and quality standards, facilitating inputs from the technical specialists as required. 6. Produce timely high quality audit reports and analysis, review the findings with auditees and enter the relevant details of Non Conformances and corresponding actions into the company database. 7. Liaise with line managers on progress with closing out audit actions, provide the appropriate assurance checks on closure and enter details of closure into the company database. 8. Analyse audit outputs to identify issues and make recommendations for improvement based on recognised best practice. 9. Verify the effectiveness of the audit framework and protocols. 10. Provide professional advice and support to the Network Rail Telecoms, Maintenance and Operations teams for all audit activities, including the provision of training as required. Job Skills, Experience and Qualifications Essential 路 Knowledge of railway operations and/or maintenance management, processes and techniques. 路 Knowledge of the Health and Safety Management System and relevant legislation. 路 Lead Auditor qualified (IATCA / IRCA). 路 Excellent report writing and presentation skills. 路 Good interpersonal, influencing, communication and organisation skills. 路 Excellent report writing and presentation skills. Desirable 路 Good understanding of the railway industry. 路 Associated membership of a professional institute.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: 拢35,582 - 拢40,029 per annum, pro/rataClosing date: 13th December 2023, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employees unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to 拢3000 (to a maximum amount of 拢2,250). Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life."}