{"line-1":"Infrastructure Maintenance Engineer (Hereford)","line-2":"Location","line-3":"Hereford, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively handle work-life balance with a 35hrs per week contract, working in Hereford, Machynlleth and Llandrindod wells minimum 1 day a week each, this role requires travelling and working away when required. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here.We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here Yn Network Rail, rydym yn rhan o deulu mawr sy'n gwasanaethu miliynau o deithwyr a defnyddwyr cludo nwyddau ledled y DU bob dydd. Mae ein gwasanaeth yn effeithio ar filiynau o bobl ac rydym yn ymdrechu i ddod yn fwy effeithlon wrth i ni wella, cynnal a gweithredu ein rhwydwaith. Mae ein teithwyr a'n defnyddwyr cludo nwyddau wrth galon popeth a wnawn. Rydym yn helpu i gysylltu pobl â'u ffrindiau a'u teuluoedd a chael nwyddau â'u cyrchfan yn ddiogel ac yn effeithlon. Rydym yn sefydliad lle mae pobl o bwys. Pan ydych chi'n rhan o'n tîm, rydych chi o bwys i ni, ac rydych chi o bwys i filiynau. Gwyliwch ein fideo i ddarganfod mwy! Mae Rhanbarth Cymru a Gorllewin yn cynnwys mwy na 2,700 milltir o reilffordd ac rydym yn gwasanaethu cymunedau a busnesau Cymru, Cwm Tafwys, gorllewin Lloegr, a Phenrhyn y De -orllewin. Mae ein huchelgais i fod yn ymatebol i deithwyr a defnyddwyr cludo nwyddau yn ein gyrru bob dydd ac mae gennym ni'r pŵer i wneud y peth iawn i'r rhai sy'n defnyddio'r rhwydwaith rheilffyrdd. Rydym yn mynd ati i herio arferion anniogel ac yn cymryd cyfrifoldeb am fynd i'r afael â risgiau, datrys materion, ac amddiffyn diogelwch a lles. Am ein pobl a'r broses recriwtio - rydym yn gyflogwr cynhwysol o ddewis ac rydym yn croesawu ceisiadau gan bawb! Fel gweithiwr rheilffyrdd rhwydwaith, byddwch chi'n mwynhau ystod eang o fuddion! • Teithio staff breintiedig - Gostyngiad teithio hamdden o 75% ar yr holl deithio hamdden ac mae'n cynnwys aelodau o'r teulu. • Cymhorthdal ​​o hyd at 75% ar docynnau tymor y rheilffyrdd a thymor tanddaearol os ydych chi'n teithio i weithio ar y trên. • Cynghrair Tocynnau GWR - Gostyngiad Trwy'r Tocynnau Trwy'r Dydd i chi a hyd at 5 ffrind a theulu i'w defnyddio ar draws y rhwydwaith GWR (20 pas y flwyddyn) • Pecyn budd -daliadau gan gynnwys cynigion gofal iechyd, cynllun cylch i waith, aelodaeth clwb gofal iechyd gostyngedig, a chynigion a buddion gostyngedig gan gynnwys gofal plant, gofal iechyd a safle siopa ar -lein. • ystod o gynlluniau pensiwn i ddewis ohonynt • I bob pwrpas yn trin cydbwysedd rhwng bywyd a gwaith gyda chontract 35 awr yr wythnos, gan weithio yn Henffordd, Machynlleth a ffynhonnau Llanrindod o leiaf 1 diwrnod yr wythnos yr un, mae'r rôl hon yn gofyn am deithio a gweithio i ffwrdd pan fo angen. • 5 diwrnod o absenoldeb gwirfoddoli â thâl. • Pythefnos o Absenoldeb Wrth Gefn Taledig ar gyfer Cymuned y Lluoedd Arfog. • Yn Rhanbarth Cymru a Gorllewin, cewch gyfle i ymuno â Proud, ein cynllun gwobr a chydnabod lle gallwch ddweud diolch a chydnabod cydweithwyr ledled y rhanbarth sydd wedi dangos gwerthoedd ac ymddygiadau rhagorol. I ddarganfod mwy am y buddion yn Network Rail, cliciwch yma. Rydym am helpu i ddarparu rheilffordd sy'n ddiogel, yn ddibynadwy, yn fforddiadwy ac sy'n darparu gwasanaeth gwych i gwsmeriaid i bawb. I gael mwy o wybodaeth am reilffordd rhwydwaith cliciwch yma","line-8":"Brief Description","line-9":"Brief Description (Internal & External) You will lead and direct the Engineering team, your three main depots will be Hereford, Machynlleth and Llandrindod Wells, where you will spend 1 day a week in each of these locations. You will ensure your teams remain complaint in inspection, maintenance, and project related works for all Infrastructure assets to meet relevant standards. You will also drive culture transformation for safety and asset performance, creating continual improvement and deliver safety, compliance and performance strategies, following business processes in order to deliver a compliant, well performing asset through a safe large multi-disciplinary team. Please check out the document attached to this vacancy for more information on what it’s like to work in the Wales route team in Wales & Western region! Byddwch yn arwain ac yn cyfarwyddo'r tîm peirianneg, eich tri phrif ddepo fydd Henffordd, Machynlleth a Llanrindod Wells, lle byddwch chi'n treulio 1 diwrnod yr wythnos ym mhob un o'r lleoliadau hyn. Byddwch yn sicrhau bod eich timau'n parhau i fod yn gwyno o ran archwilio, cynnal a chadw a gwaith sy'n gysylltiedig â phrosiectau i bob ased seilwaith fodloni safonau perthnasol. Byddwch hefyd yn gyrru trawsnewid diwylliant ar gyfer diogelwch a pherfformiad asedau, gan greu gwelliant parhaus a sicrhau diogelwch, cydymffurfio a strategaethau perfformiad, yn dilyn prosesau busnes er mwyn sicrhau ased sy'n cydymffurfio, sy'n perfformio'n dda trwy dîm amlddisgyblaethol mawr diogel diogel.Edrychwch ar y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn nhîm Llwybr Cymru yn Rhanbarth Cymru a Gorllewinol!","line-10":"About the role (External)","line-11":"This is an exciting opportunity where you will work with the most passionate of railway staff in your main depots, Hereford, Machynlleth and Llandrindod Wells. With different types of infrastructure and components in each of the sections, it’s a great learning experience and challenge to take these places to enhanced levels, under your leadership. Working from home is not an option for this role.Your Main Responsibilities in this role will be to:· Create a customer focused, successful team and provide professional leadership and direction in values, behaviours and the application of engineering practises and techniques. Create a strategy for developing a succession of competent engineers to provide service continuity (safety, compliance and performance) and support continual professional development. · Act as engineering professional lead to develop and run implementation of the annual maintenance business plan, ensuring that work is correctly prioritised and volumes delivered to plan, and within agreed budgetary constraints.· Lead and manage the engineering team to deliver holistic asset management, identifying deterioration rates, effectiveness of maintenance intervention, and optimal renewal timescales to reduce overall asset costs.· Lead and direct the continuous improvement cycle. Identify and implement safety, asset performance, reliability, productivity and efficiency improvement initiatives. Coordinate asset renewals proposals and in conjunction with the Route Asset Management team monitor timescales for delivery against asset condition including deferred renewal sites.· Lead and manage the engineering team to be compliant to the management assurance process, create a review strategy that identifies and prevents non-compliance to standards. Check that inspection and maintenance activities are completed in line with policies, procedures and standards, with non-compliances identified, submitted and appropriate action taken where required.· Lead the engineering team in the delivery of health and safety, creating a plan of inspection and monitoring to continually improve safety performance and influence culture change. Managing the arrangements for staff safety, training and competence and delivering compliance with competency assessment systems.· Develop and manage the engineering team, monitoring adequate resources are available to deliver a flexible, competent, skilled and effective workforce at all times and manage staff welfare, use of equipment and fatigue levels. Undertake appropriate safety tours, staff surveillance, work quality and asset condition checks.· Undertake formal investigations and investigate and report on accidents/incidents.· Develop and improve relationships with key stakeholders and suppliers. Lead as the ORR Interface for safety/maintenance/compliance issues.· Identify and manage the introduction of new systems on the network, where applicable, including systems/safety approvals and monitoring so that processes and documentation exist for sustained network usage.· Direct the timely assignment of, and thereafter, discharge of, Construction Design Management (CDM) duties for all maintenance activities.· Discharge the relevant duties assigned under the NR Engineering Management Plan to include the role of Construction Engineering Manager (CEM).· Create a strategy for developing and evolving weather preparedness plans and lead and develop the team in the safe delivery of the plan. You will ideally have · Chartered engineer· Educated to degree level or equivalent experience· NEBOSH certificate· Detailed knowledge of rail engineering subject area and other rail engineering functional disciplines· Successful experience in maintenance management, processes, and techniques· Detailed knowledge of compliance management processes and relevant standards and procedures· Formal Accident & Incident Investigation· Knowledge of operational railway environment· Knowledge of CDM regulations and procedures.· Successful experience as a people manager· Validated interpersonal, influencing, communication and organisation skills What could set you apart · Experience in Oracle (BMIS)Not sure if you meet all the requirements? Let us decide. Mae hwn yn gyfle cyffrous lle byddwch chi'n gweithio gyda'r staff rheilffordd mwyaf angerddol yn eich prif ddepos, Henffordd, Machynlleth a Llanrindod Wells. Gyda gwahanol fathau o seilwaith a chydrannau ym mhob un o'r adrannau, mae'n brofiad dysgu gwych ac yn her mynd â'r lleoedd hyn i wella lefelau, o dan eich arweinyddiaeth. Nid yw gweithio gartref yn opsiwn ar gyfer y rôl hon.Eich prif gyfrifoldebau yn y rôl hon fydd:• Creu tîm llwyddiannus sy'n canolbwyntio ar gwsmeriaid a darparu arweinyddiaeth a chyfeiriad proffesiynol mewn gwerthoedd, ymddygiadau a chymhwyso arferion a thechnegau peirianneg. Creu strategaeth ar gyfer datblygu olyniaeth o beirianwyr cymwys i ddarparu parhad gwasanaeth (diogelwch, cydymffurfiaeth a pherfformiad) a chefnogi datblygiad proffesiynol parhaus.• Gweithredu fel Peirianneg Proffesiynol Arweiniol i Ddatblygu a Rhedeg Gweithredu'r Cynllun Busnes Cynnal a Chadw Blynyddol, gan sicrhau bod gwaith yn cael ei flaenoriaethu'n gywir a chyfeintiau'n cael eu cyflwyno i gynllunio, ac o fewn cyfyngiadau cyllidebol y cytunwyd arno.• Arwain a rheoli'r tîm peirianneg i ddarparu rheolaeth asedau cyfannol, nodi cyfraddau dirywiad, effeithiolrwydd ymyrraeth cynnal a chadw, a'r amserlenni adnewyddu gorau posibl i leihau costau asedau cyffredinol.• Arwain a chyfarwyddo'r cylch gwella parhaus. Nodi a gweithredu diogelwch, perfformiad asedau, dibynadwyedd, cynhyrchiant a mentrau gwella effeithlonrwydd. Cydlynu cynigion adnewyddu asedau ac ar y cyd â thîm rheoli asedau llwybr monitro amserlenni i'w danfon yn erbyn cyflwr asedau gan gynnwys safleoedd adnewyddu gohiriedig.• Arwain a rheoli'r tîm peirianneg i gydymffurfio â'r broses sicrhau rheoli, creu strategaeth adolygu sy'n nodi ac yn atal diffyg cydymffurfio i safonau. Gwiriwch fod gweithgareddau archwilio a chynnal a chadw yn cael eu cwblhau yn unol â pholisïau, gweithdrefnau a safonau, gyda diffyg cydymffurfio wedi'u nodi, eu cyflwyno a chymryd camau priodol lle bo angen.• Arwain y tîm peirianneg wrth ddarparu iechyd a diogelwch, gan greu cynllun o archwilio a monitro i wella perfformiad diogelwch yn barhaus a dylanwadu ar newid diwylliant. Rheoli'r trefniadau ar gyfer diogelwch staff, hyfforddiant a chymhwysedd a sicrhau cydymffurfiad â systemau asesu cymhwysedd.• Datblygu a rheoli'r tîm peirianneg, mae monitro adnoddau digonol ar gael i ddarparu gweithlu hyblyg, cymwys, medrus ac effeithiol bob amser a rheoli lles staff, defnyddio offer a lefelau blinder. Ymgymryd â theithiau diogelwch priodol, gwyliadwriaeth staff, ansawdd gwaith a gwiriadau cyflwr asedau.• Cynnal ymchwiliadau ffurfiol ac ymchwilio ac adrodd ar ddamweiniau/digwyddiadau.• Datblygu a gwella perthnasoedd â rhanddeiliaid a chyflenwyr allweddol. Arwain fel y rhyngwyneb ORR ar gyfer materion diogelwch/cynnal a chadw/cydymffurfio.• Nodi a rheoli cyflwyno systemau newydd ar y rhwydwaith, lle bo hynny'n berthnasol, gan gynnwys systemau/cymeradwyo diogelwch a monitro fel bod prosesau a dogfennaeth yn bodoli ar gyfer defnyddio rhwydwaith parhaus.• Cyfarwyddo aseiniad amserol, ac wedi hynny, cyflawni dyletswyddau rheoli dylunio adeiladu (CDM) ar gyfer yr holl weithgareddau cynnal a chadw.• Rhyddhau'r dyletswyddau perthnasol a neilltuwyd o dan y Cynllun Rheoli Peirianneg NR i gynnwys rôl y Rheolwr Peirianneg Adeiladu (CEM).• Creu strategaeth ar gyfer datblygu ac esblygu cynlluniau parodrwydd tywydd ac arwain a datblygu'r tîm wrth ddarparu'r cynllun yn ddiogel.Yn ddelfrydol, bydd gennych chi• Peiriannydd Siartredig• Addysg i lefel gradd neu brofiad cyfatebol• Tystysgrif NEBOSH• Gwybodaeth fanwl am faes pwnc peirianneg rheilffyrdd a disgyblaethau swyddogaethol peirianneg rheilffyrdd eraill• Profiad llwyddiannus mewn rheoli, prosesau a thechnegau cynnal a chadw• Gwybodaeth fanwl am brosesau rheoli cydymffurfiaeth a safonau a gweithdrefnau perthnasol• Ymchwiliad Damweiniau a Digwyddiad Ffurfiol• Gwybodaeth am amgylchedd rheilffordd gweithredol• Gwybodaeth am reoliadau a gweithdrefnau CDM.• Profiad llwyddiannus fel rheolwr pobl• Sgiliau rhyngbersonol, dylanwadu, cyfathrebu a threfnu dilysedigBeth allai eich gosod ar wahân• Profiad yn Oracle (BMIS)Ddim yn siŵr a ydych chi'n cwrdd â'r holl ofynion? Gadewch inni benderfynu.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: This role is a band 2C – £85,395 - £96,070 per annum. 35 hours a week. Closing date: 5 December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted.Please check out the document attached to this vacancy for more information on what it’s like to work in the Wales route team in Wales & Western region! Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please contact Hayley Bird. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Cyflog: Mae'r rôl hon yn fand 2C - £ 85,395 - £ 96,070 y flwyddyn. 35 awr yr wythnos. Dyddiad cau: 5 Rhagfyr 2023. Sicrhewch eich cais i mewn cyn gynted â phosibl, efallai y byddwn yn cau'r hysbyseb cyn y dyddiad cau rhestredig os ydym yn derbyn digon o geisiadau. Ni dderbynnir ceisiadau hwyr.Edrychwch ar y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn nhîm Llwybr Cymru yn Rhanbarth Cymru a Gorllewinol! Cliciwch ‘Apply Now’ i wneud cais. Rydym yn gyflogwr cyfle cyfartal ac yn werth amrywiaeth. Nid ydym yn gwahaniaethu ar sail hil, crefydd, tarddiad cenedlaethol, rhyw, cyfeiriadedd rhywiol, oedran, statws priodasol, neu statws anabledd. Cliciwch yma i gael mwy o wybodaeth. Mae amrywiaeth a chynhwysiant yn fwy na geiriau gwefr yn unig i ni. Rydyn ni bob amser yn ymdrechu i sicrhau ein bod ni'n darparu amgylchedd croesawgar a diogel i bawb. Rydym yn cydnabod bod rhai grwpiau wedi'u tangynrychioli yn ein tîm ac rydym yn gweithio'n agos gyda'n rhwydweithiau amrywiaeth a chynhwysiant rhanbarthol i sicrhau ein bod yn cefnogi'r grwpiau hyn orau ag y gallwn. Rydym yn gweithio ar y cyd â'r tîm ymasiad diwylliannol. Os hoffech gael cefnogaeth gyda'ch cais neu'ch cyfweliad, cysylltwch â Wales&WesternCulturalfusion@networkrail.co.uk neu ewch i'r dudalen Cyswllt: Cymru a Gorllewin Diwylliannol Fusion (SharePoint.com). Am yr holl gefnogaeth arall, cysylltwch â'ch partner busnes AD. Mae Network Rail yn arweinydd hyderus anabledd a byddwn yn ceisio ein gorau i addasu'r broses a chynnig dewis arall rhesymol i helpu i gefnogi pobl ag anableddau i gael mynediad, cymhwyso a chyfweld am rolau. Gallwch ymweld â chwch gwenyn gyrfa Evbreak i gael cyngor ar gymorth hygyrchedd os nad ydych yn siŵr o'r opsiynau sydd ar gael. Os oes angen unrhyw addasiadau/addasiadau rhesymol arnoch, cysylltwch â Hayley Bird. Mae pob cynnig o gyflogaeth yn amodol ar ôl cwblhau gwiriadau cyn cyflogi yn foddhaol. Cliciwch yma i gael mwy o wybodaeth. Mae ein safon cyffuriau a alcohol wedi newid. Bydd yn ofynnol i bob darpar ymgeisydd gael a phasio prawf cyffuriau ac alcohol. Bydd eich cais yn cael ei ddiddymu os ydych chi'n cofnodi prawf positif. Bydd yr holl gyffuriau positif a chanlyniadau profion alcohol ar gyfer darpar ymgeiswyr yn cael eu dal yn ddiogel ar gronfa ddata Sentinel ac ataliad 5 mlynedd o wneud cais am rôl hanfodol diogelwch, bydd rôl sy'n gofyn am ardystiad PTS neu rôl ddiogelwch allweddol ar seilwaith a reolir gan reilffyrdd rhwydwaith yn cael ei orfodi. Mae cadw pobl yn ddiogel ar y rheilffordd wrth galon popeth a wnawn. Felly mae ymddygiad diogel yn ofyniad i weithio ar gyfer Rhwydwaith Rhwydwaith. Dylech ddangos eich ymroddiad personol i ddiogelwch ar eich cais."}