{"line-1":"Access Co-ordinator","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Arrange track access to support efficient delivery of maintenance and third party works in accordance with planning timescales. Produce and maintain the Delivery Unit Possession Plan.","line-10":"About the role (External)","line-11":"You’ll produce and maintain the Delivery Unit Possession Plan as well as optimising the use of the possessions and isolations. Key Accountabilities 1. Manage the application of all access and isolation requests for the Delivery Unit.2. Produce and manage the Delivery Unit Period Possession Plan.3. Optimise the use of possessions and isolations.4. Submit possessions and Temporary Speed Restriction requests using the Possession Planning System (PPS).5. Manage the possession change control process.6. Process isolation requests and pass to the Isolation Planner. Job Skills, Experience and Qualifications Essential· Knowledge of access planning processes and systems· Detailed knowledge of relevant standards and procedures· Knowledge of maintenance processes and techniques· Knowledge of operational railway environment· Good geographical knowledge· Good interpersonal, communication and organisational skills","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £34,000 - £39,000, plus an Inner London Allowance per annum, pro/rata. Closing date: 1st December 2023, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre –employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employee’s unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3000 (to a maximum amount of £2,250). Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life."}