{"line-1":"Finance Business Partner","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Finance","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. About the function… The Group Efficiencies team is part of the Group FP&A Directorate within the CFO function. We play a crucial part in ensuring we secure appropriate funding and get the best possible value for the money we spend, driving forward our continuing mission to transform the UK’s rail network into a world-class infrastructure.","line-8":"Brief Description","line-9":"Join Our Team as a Finance Business Partner in Milton Keynes! Are you a finance enthusiast who thrives on making a real impact in the business world? As Finance Business Partner, you will work as a key member of the Network Rail Efficiency (Fishbone Framework) team in Group Finance, under the direction of the Senior Finance Business Partner. Network Rail has a commitment to deliver £4bn efficiency savings in CP6 and £3.7bn in CP7 on Renewals and OPEX, and a target of 15% Efficiency saving on the full Enhancement Portfolio in CP6. Who are we looking for? We're on the hunt for a Finance Business Partner to join our passionate team in Milton Keynes. This position is responsible for managing the OMSR Fishbone Framework process including business partnering with all regions and functions. You will provide pro-active, value-add finance support, analysis, guidance, assurance, and positive challenge to business leaders across the functions and routes.","line-10":"About the role (External)","line-11":"What does the average day look like? Every day as a Finance Business Partner is different, filled with diverse responsibilities, including: 🌟Being Responsible for running the OMSR Fishbone Framework process across all regions and delivering analysis and reporting shared across Network Rail. 🌟 Work within the group efficiency team to drive improved reporting on the efficiency story and track benefits against those signed-off post implementation 🌟 Supporting the SFBP in business partnering with the regions and functions to support, guide, and assure the Renewals and OPEX Fishbone submissions. 🌟 Driving improvements in process, taxonomy, analytics and reporting to deliver a robust fishbone framework and inspire confidence with external stakeholders. 🌟 Leading and providing financial advice and guidance to senior budget holders in understanding the impact of the period results and forecasts against budgets so they can understand their business better. 🌟Crafting detailed plans from the ground up to manage and develop specific continuous improvement projects to improve processes. Your work ensures we have top-notch corporate governance and the insights we need for success. 🌟 We deal with a vast array of data which we need to distil to reveal the true insightful information which can make a difference. What essential skills and experiences are required? The successful candidate for this role will be required to be/have: - 1. Demonstrate strong understanding of business needs and relevant application of accounting standards 2. Membership (Or working towards a membership) of a relevant accounting body (CIMA/ACCA) or equivalent experience 3. Expert knowledge and experience of creating and maintaining accounts and annual budget 4. Significant experience within relevant finance disciplines 5. Strong excel skills and use of data manipulation 6. Strong interpersonal and communication skills 7. Ability to interpret technical accounting regulations into everyday language 8. Demonstrable effective influencing skills at a senior level 9. Significant understanding of financial control and risk 10. Excellent technical finance and accounting knowledge For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent Location: This role is based at The Quadrant: MK. For roles based in the Quadrant:MK, you must live within 75/90 minutes of The Quadrant. Closing date: 04/12/23. On occasions, we may need to close the advert early based upon application volumes. Late applications will not be accepted. Interviews will be held week commencing 08/01/24 Band & Salary: Band 4C - £43,588 - £49,036 What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}