{"line-1":"Culture & HR Programme Manager (Change)","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"southern region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"An exciting opportunity with Southern Region to lead our Cultural Change Programme, Southern Region. Within the Southern Regions plan, we have three clear principles to help us face current challenges within the region and to help us become Better Together Southern. ​​​​​​​They describe how we want to work together and create a culture that people want to be part of as we move forward, together. They describe how we can look at our attitudes and behaviours at work and make changes in our approach where necessary. In short, they help us think about what it means to be a Southern Region employee. Collectively, they shine the spotlight on three key ways of working that can help us think about how we do our jobs and what we’re willing to change – in our everyday activities, what we do, how we do it, the way we interact with others and the decisions we make. Your role will be to take the lead with this exciting change programme what has a number of workstreams from on-going programmes, to accelerated target areas and new progressive workstreams across the region, great progress has been made so far with this programme, the next steps will be to take this emersion and rollout across Southern Region.","line-10":"About the role (External)","line-11":"Key Accountabilities 1. Agree remit and success criteria of change projects with the relevant Executive Sponsors and Functional Directors. 2. Manage the development and delivery of a programme of change projects in compliance with company processes and procedures. 3. Manage the production of project management plans for change projects. 4. Act as project sponsor when required. 5. Establish and manage collaborative cross-functional virtual teams to deliver change projects, where appropriate. 6. Deliver regular progress reports on a programme of change projects, including relevant risks and issues, to Executive Sponsors and Functional Directors. 7. Manage project budgets within agreed targets. 8. Promote and monitor the use of efficiency improvement methods. 9. Disseminate lessons learnt. Job Skills, Experience and Qualifications Essential · Relevant experience in the successful management of major and complex change programmes. · Experience of applying programme / project methodologies. · Commercial and financial awareness. Desirable · Educated to degree level. · Member of project association. · Knowledge of the principles of investment processes and procedures. · Knowledge of/experience in the UK rail industry. Key Accountabilities 1. Agree remit and success criteria of change projects with the relevant Executive Sponsors and Functional Directors. 2. Manage the development and delivery of a programme of change projects in compliance with company processes and procedures. 3. Manage the production of project management plans for change projects. 4. Act as project sponsor when required. 5. Establish and manage collaborative cross-functional virtual teams to deliver change projects, where appropriate. 6. Deliver regular progress reports on a programme of change projects, including relevant risks and issues, to Executive Sponsors and Functional Directors. 7. Manage project budgets within agreed targets. 8. Promote and monitor the use of efficiency improvement methods. 9. Disseminate lessons learnt. Job Skills, Experience and Qualifications Essential · Relevant experience in the successful management of major and complex change programmes. · Experience of applying programme / project methodologies. · Commercial and financial awareness. Desirable · Educated to degree level. · Member of project association. · Knowledge of the principles of investment processes and procedures. · Knowledge of/experience in the UK rail industry.","line-12":"Key Accountabilities","line-13":"1. Agree remit and success criteria of change projects with the relevant Executive Sponsors and Functional Directors. 2. Manage the development and delivery of a programme of change projects in compliance with company processes and procedures. 3. Manage the production of project management plans for change projects. 4. Act as project sponsor when required. 5. Establish and manage collaborative cross-functional virtual teams to deliver change projects, where appropriate. 6. Deliver regular progress reports on a programme of change projects, including relevant risks and issues, to Executive Sponsors and Functional Directors. 7. Manage project budgets within agreed targets. 8. Promote and monitor the use of efficiency improvement methods. 9. Disseminate lessons learnt.","line-14":"Job Skills, Experience and Qualifications","line-15":"Essential · Relevant experience in the successful management of major and complex change programmes. · Experience of applying programme / project methodologies. · Commercial and financial awareness. Desirable · Educated to degree level. · Member of project association. · Knowledge of the principles of investment processes and procedures. · Knowledge of/experience in the UK rail industry.","line-16":"How to apply (External)","line-17":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £71,163 - £80,060pa + £3,270pa Inner London AllowanceLocation: London Puddle DockType: Permanent Closing date: 4th December 2023 - Late applications will not be accepted. Remote working opportunity! This role requires working in the office 3 days a week Click apply now to apply.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}