{"line-1":"Performance & Assurance Engineer","line-2":"Location","line-3":"Three Bridges, GB","line-4":"Department Name","line-5":"southern region","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Manage the assurance and compliance processes within the delivery unit. Monitor and report on asset performance, reliability, productivity, efficiency and compliance. Make recommendations that will improve business performance.","line-10":"About the role (External)","line-11":"Key Accountabilities1. Monitor and report on a programme of assurance, staff surveillance, work quality and asset condition checks. Compile periodic reports and analyse trends. Make recommendations to address issues that require management action.2. Monitor and report on asset performance, reliability, work productivity and efficiency. Compile reports and analyse trends. Make recommendations to address issues that require management action.3. Monitor the progression and close-out of Non-Conformance Reports within the agreed timescales.4. Manage the process to submit, monitor and close out Non Compliances.5. Assist in investigation of incidents and performance/compliance related failures.6. Monitor progress and report on business performance improvement initiatives. Make recommendations to address issues that require management action.Job Skills, Experience and QualificationsEssential路 Knowledge of engineering discipline路 Knowledge of maintenance delivery processes and techniques路 Knowledge of assurance and compliance processes路 Knowledge of relevant standards and procedures路 Knowledge of investigation processes and techniques路 Good analytical skills路 Good interpersonal, influencing, communication and organisation skills Desirable路 Good knowledge of railway operating rules and regulations路 Good risk assessment/loss control knowledge路 Knowledge of asset reliability improvement and monitoring techniques路 Auditor qualificationKey Accountabilities1. Monitor and report on a programme of assurance, staff surveillance, work quality and asset condition checks. Compile periodic reports and analyse trends. Make recommendations to address issues that require management action.2. Monitor and report on asset performance, reliability, work productivity and efficiency. Compile reports and analyse trends. Make recommendations to address issues that require management action.3. Monitor the progression and close-out of Non-Conformance Reports within the agreed timescales.4. Manage the process to submit, monitor and close out Non Compliances.5. Assist in investigation of incidents and performance/compliance related failures.6. Monitor progress and report on business performance improvement initiatives. Make recommendations to address issues that require management action.Job Skills, Experience and QualificationsEssential路 Knowledge of engineering discipline路 Knowledge of maintenance delivery processes and techniques路 Knowledge of assurance and compliance processes路 Knowledge of relevant standards and procedures路 Knowledge of investigation processes and techniques路 Good analytical skills路 Good interpersonal, influencing, communication and organisation skills Desirable路 Good knowledge of railway operating rules and regulations路 Good risk assessment/loss control knowledge路 Knowledge of asset reliability improvement and monitoring techniques路 Auditor qualification","line-12":"Key Accountabilities","line-13":"1. Monitor and report on a programme of assurance, staff surveillance, work quality and asset condition checks. Compile periodic reports and analyse trends. Make recommendations to address issues that require management action.2. Monitor and report on asset performance, reliability, work productivity and efficiency. Compile reports and analyse trends. Make recommendations to address issues that require management action.3. Monitor the progression and close-out of Non-Conformance Reports within the agreed timescales.4. Manage the process to submit, monitor and close out Non Compliances.5. Assist in investigation of incidents and performance/compliance related failures.6. Monitor progress and report on business performance improvement initiatives. Make recommendations to address issues that require management action.","line-14":"Job Skills, Experience and Qualifications","line-15":"Essential路 Knowledge of engineering discipline路 Knowledge of maintenance delivery processes and techniques路 Knowledge of assurance and compliance processes路 Knowledge of relevant standards and procedures路 Knowledge of investigation processes and techniques路 Good analytical skills路 Good interpersonal, influencing, communication and organisation skills Desirable路 Good knowledge of railway operating rules and regulations路 Good risk assessment/loss control knowledge路 Knowledge of asset reliability improvement and monitoring techniques路 Auditor qualification","line-16":"How to apply (External)","line-17":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: 拢35,582 - 拢40,029 Band 4BLocation: Three Bridges Cover HouseType: Permanent Closing date: 27th November 2023. - Late applications will not be accepted. Click apply now to apply.Remote working opportunity! This role requires working in the office 3 days a week Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}