{"line-1":"Track Maintenance Engineer","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Lead and direct the Infrastructure Maintenance delivery team in the inspection and maintenance of functional assets to standards and within budget.This role oversees the Off Track, Welding & Grinding and Rail Testing & Lubrication departments as well as the Rail Management Engineer role.","line-10":"About the role (External)","line-11":"1. Lead and direct the Infrastructure Maintenance team to achieve business and functional objectives and meet key performance measures.2. Manage development of individuals and the engagement of the team. 3. Manage the arrangements for staff safety and competence.4. Identify and implement safety, asset performance, reliability, productivity and efficiency improvement initiatives.5. Manage the inspection and maintenance of assets to standards.6. Manage the prioritisation of work and delivery to plan.7. Check that safety, assurance, compliance, performance and business processes are followed.8. Identify and submit non compliances for approval and take appropriate action where required.9. Manage the process to handover and accept back assets being renewed, installed, or modified by projects.10. Restore to normal operation after completion of testing/investigation, equipment that has failed, been subject to an allegation or has been renewed as part of a maintenance delivered renewal programme.11. Develop and agree annual maintenance, inspection and testing programmes and resource levels.12. Develop and authorise quarterly work plans and resource levels.13. Identify and propose asset renewals.14. Review and approve method statements and/or plans for design and/or work activities as required.15. Undertake investigations and report on accidents/incidents.16. Undertake an agreed programme of safety tours, staff surveillance, work quality and asset condition checks. Job Skills, Experience and Qualifications Essential路 Relevant technical competence路 Experience in maintenance management, processes and techniques路 Knowledge of safety and compliance management processes路 Detailed knowledge of relevant standards and procedures路 Knowledge of operational railway environment路 Knowledge of other functional disciplines路 IRSE Licence holder (Signalling only)路 Local Accident & Incident Investigation路 Good interpersonal, influencing, communication and organisation skills Desirable路 Incorporated Engineer 路 Membership of professional body","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: 拢55596- 拢62546 Been referred by a friend, then please complete this form Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employees unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual subsidy on season tickets. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. Closing date: 29th November 2023, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}