{"line-1":"Performance Improvement Co-ordinator","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"Southern Region...SS.9","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"We are currently seeking a Performance Improvement Co-Ordinator to implement the company performance improvement processes in the route/area to deliver train service improvement across the railway industry.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Implement company procedures for all aspects of performance improvement management including FRA, JPIP and the Control Period.2. Co-ordinate and deliver, as appropriate, performance improvement plans for the route/area, focusing on projects with the best return for Network Rail and the industry, based in the outputs of the route analysis team.3. Liaise with delivery units for performance improvement projects within the route/area and work with the local team to mitigate risk during delivery of projects. 4. Produce well-researched, highly numerate analysis of business cases for performance improvements.5. Act as the single point of contact for performance related projects within the route / area during their implementation. 6. Support the routes and operators in effective sharing of best practice and cross learning processes7. Monitor and report the progress and effectiveness of all performance improvement initiatives within the relevant performance tracking system, ensuring all stakeholder performance review meetings are held.8. Liaise with the route teams to document the mitigation actions from Significant Performance Incident Reviews (SPIRs) and lead the implementation of these actions to prevent future reoccurrence.Job Skills, Experience and Qualifications:Essential· Project management skills· Able to demonstrate effective communication skills· Understand investment regulations and budgetary systems· Influencing skills· Business and safety case preparation Desirable· 6 sigma green belt","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582 - £40,029 plus £3,270 Inner London Allowance Band 4BLocation: London Puddle DockType: 11month Fixed Term ContractClosing date: 3rd December 2023 - Late applications will not be accepted. This role has also been advertised externally. Remote working opportunity! This role requires working in the office 3 days a week This is a Fixed Term opportunity ending November 2024 This role has the potential to become permanent.Click apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}