{"line-1":"Roster Clerk (Maintenance) - Fleckney","line-2":"Location","line-3":"Leicester, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To maintain effective and efficient rosters for employees compliant with the relevant company standards in line with current National rostering principles, competency requirements and agreed Terms and Conditions.","line-10":"About the role (External)","line-11":"Key Accountabilities1. Compile and publish agreed rosters using the corporate rostering tool in accordance with Maintenance Rostering Principles, company policies and standards.2. Prepare rosters for weekly rostered duties. Covering sickness, annual leave, training, briefing and special arrangements. Liaise with relevant line managers to crosscheck roster data.3. Manage short notice roster alterations liaising with all affected employees and line managers, including gaining verbal confirmation where necessary. Respond to and resolve any queries relating to roster issues.4. Make roster arrangements for medical examinations and interviews.5. Make roster arrangements for safety critical competence expiries, training plans, training courses and briefings.6. Monitor competency data so that no base roster shifts are left uncovered due to expired competencies.7. Liaise with associated Competency Delivery Specialist on maintaining competency records.8. Gather and analyse fatigue data and highlight issues to the relevant line manager.9. Provide information and data to support the route and delivery unit reporting requirements. Job Skills, Experience and QualificationsEssential· Excellent knowledge of national rostering principles· Previous successful experience in prioritising workloads and delivering to deadlines· Ability to demonstrate excellent interpersonal and communication skills· Previous successful experience of analysing data and producing reports· Understanding of conditions of service applicable to rostering· Understanding of roster systems· Demonstrable ability to accurately manage data and attention to detail· Previous successful experience of working in a team and engaging with virtual team members· Able to demonstrate good general IT skills Desirable· Geographical knowledge of the route· Knowledge of the UK rail industryKey Accountabilities1. Compile and publish agreed rosters using the corporate rostering tool in accordance with Maintenance Rostering Principles, company policies and standards.2. Prepare rosters for weekly rostered duties. Covering sickness, annual leave, training, briefing and special arrangements. Liaise with relevant line managers to crosscheck roster data.3. Manage short notice roster alterations liaising with all affected employees and line managers, including gaining verbal confirmation where necessary. Respond to and resolve any queries relating to roster issues.4. Make roster arrangements for medical examinations and interviews.5. Make roster arrangements for safety critical competence expiries, training plans, training courses and briefings.6. Monitor competency data so that no base roster shifts are left uncovered due to expired competencies.7. Liaise with associated Competency Delivery Specialist on maintaining competency records.8. Gather and analyse fatigue data and highlight issues to the relevant line manager.9. Provide information and data to support the route and delivery unit reporting requirements. Job Skills, Experience and QualificationsEssential· Excellent knowledge of national rostering principles· Previous successful experience in prioritising workloads and delivering to deadlines· Ability to demonstrate excellent interpersonal and communication skills· Previous successful experience of analysing data and producing reports· Understanding of conditions of service applicable to rostering· Understanding of roster systems· Demonstrable ability to accurately manage data and attention to detail· Previous successful experience of working in a team and engaging with virtual team members· Able to demonstrate good general IT skills Desirable· Geographical knowledge of the route· Knowledge of the UK rail industry","line-12":"Key Accountabilities","line-13":"1. Compile and publish agreed rosters using the corporate rostering tool in accordance with Maintenance Rostering Principles, company policies and standards.2. Prepare rosters for weekly rostered duties. Covering sickness, annual leave, training, briefing and special arrangements. Liaise with relevant line managers to crosscheck roster data.3. Manage short notice roster alterations liaising with all affected employees and line managers, including gaining verbal confirmation where necessary. Respond to and resolve any queries relating to roster issues.4. Make roster arrangements for medical examinations and interviews.5. Make roster arrangements for safety critical competence expiries, training plans, training courses and briefings.6. Monitor competency data so that no base roster shifts are left uncovered due to expired competencies.7. Liaise with associated Competency Delivery Specialist on maintaining competency records.8. Gather and analyse fatigue data and highlight issues to the relevant line manager.9. Provide information and data to support the route and delivery unit reporting requirements.","line-14":"Job Skills, Experience and Qualifications","line-15":"Essential· Excellent knowledge of national rostering principles· Previous successful experience in prioritising workloads and delivering to deadlines· Ability to demonstrate excellent interpersonal and communication skills· Previous successful experience of analysing data and producing reports· Understanding of conditions of service applicable to rostering· Understanding of roster systems· Demonstrable ability to accurately manage data and attention to detail· Previous successful experience of working in a team and engaging with virtual team members· Able to demonstrate good general IT skills Desirable· Geographical knowledge of the route· Knowledge of the UK rail industry","line-16":"How to apply (External)","line-17":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £27,802 per annum Closing date: 22nd December 2023. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}