{"line-1":"Delay Resolution Co-ordinator - Permanent role - 2 roles available","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Manage and monitor customer performance, to check that both Network Rail’s interest is protected and customers’ issues are addressed.","line-10":"About the role (External)","line-11":"Key Accountabilities:1. Provide the Network Rail focus for all train performance data, to be supplied to colleagues working on performance improvement schemes in line with the Network Rail Performance Manual.2. Manage the contractual elements of the train performance regime with customers, including audit records.3. Produce reports, for use by customers and Customer Relationship Executive teams, detailing performance issues.4. Proactively manage the delay disputes process to attain satisfactory settlement of level 2& 3 disputes with customers.5. Provide support to line of route teams in managing the relationship with customers in respect of the train performance regime.6. Check the accuracy of the incentive regimes process and calculations and that all information has been provided to the operators in the required timescale.7. Develop, in accordance with the TRUST Delay Attribution Guide, the resolution of all disputed incidents and subsequent re-attribution, where applicableJob Skills, Experience and Qualifications: Essential· Educated to ‘A’ level or equivalent standard· Knowledge of Network Rail performance systems, and understanding of the performance element of the Track Access Conditions.· Familiarity with and understanding of the contractual relationship with the customer.· Knowledge of rail geography and basic operating principles. · Understanding of all customers contract conditions as regards track access and the relationship with Performance Regimes.· Good interpersonal skills. Desirable· Understanding of financial principles· Knowledge of the rail industry","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £27,820 2 Roles available Closing date: 6th December 2023 - Late applications will not be accepted.Click apply now to apply.This is a permanent role.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}