{"line-1":"Section Planner","line-2":"Location","line-3":"Stockport, GB","line-4":"Department Name","line-5":"Manchester Stockholm Road","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Brief Description: In the role of Relief Section Planner, you will be a vital contributor to our organisation's achievements by actively participating in planning activities within the Delivery Unit. Your core duty is to guarantee comprehensive coverage for our depots, especially during periods of Annual Leave and Sickness, and offering assistance to various sections for their planning and access requirements. You will collaborate closely with interdisciplinary teams, leveraging your proficiency in both access and systems planning. While your primary work location will be the Stockport Delivery Unit, travel across the entirety of Manchester's Delivery Unit and Depots will be necessary to meet resource demands.","line-10":"About the role (External)","line-11":"Key Duties:• Planning and optimisation of all agreed activities for covered sections• The update of systems and records where required• Delivery Unit relief support• Production of SSOW packs• Access Planning• Submission of Line Blockages and Possession requests• Representation for Section Managers at Weekly Planning MeetingsEssential Skills:• Work Plan Production and resource optimisation skills• Core Planning Skills Level 2 (Or equivalent)• Knowledge of access and possession processes• Safe System of work planning process• Great interpersonal skills• Organisational skillsDesirable:• Knowledge of the Ellipse system• Knowledge of a maintenance discipline• Knowledge of the running railway• Geographical knowledge of the Manchester railway","line-12":"How to apply (External)","line-13":"Salary: Band 5, Salary £25,000 - £28,000 (depending on experience)Closing date: 18th December 2023. - Late applications will not be accepted. This role has also been advertised externally.To submit your application, click apply now. For tips to help you prepare and apply click hereYou can visit Evenbreak's Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.What does our recruitment process look like?1. Once you have applied, our Recruitment Specialist will look at your CV.2. If your experience matches what we're looking for, you'll be invited to face to face interview with the hiring manager.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information."}