{"line-1":"Programme Manager (Change)","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Infrastructure Investment","line-6":"About Network Rail","line-7":"Key Vacancy Information:Job Title: Programme Manager (Change) Role Type: Full Time, PermanentLocation: York George Stephenson House (please note this role is also being advertised to be based at London or Derby) Closing date: 1st December 2023Salary: starting at £71,163 and increasing to £80,060 (plus Employee Healthcare)Car Allowance: £6,000 per annumAnnual Leave: 28 days + bank holidaysHours: 35 per week *Employees will be entitled to a 75% discount off leisure travel from December 2022, this includes all Advance, off peak and super off peak tickets* About Network Rail: Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!https://www.youtube.com/watch?v=nLZ7OYSoQVUOver the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.","line-8":"Brief Description","line-9":"To manage the development and delivery of a programme of change projects to agreed scope, time, cost and quality requirements, working with Function Directors, Executive Sponsors and their representatives.","line-10":"About the role (External)","line-11":"Key Accountabilities – 1. Agree remit and success criteria of change projects with the relevant Executive Sponsors and Functional Directors. 2. Manage the development and delivery of a programme of change projects in compliance with company processes and procedures. 3. Manage the production of project management plans for change projects. 4. Act as project sponsor when required. 5. Establish and manage collaborative cross-functional virtual teams to deliver change projects, where appropriate. 6. Deliver regular progress reports on a programme of change projects, including relevant risks and issues, to Executive Sponsors and Functional Directors. 7. Manage project budgets within agreed targets. 8. Promote and monitor the use of efficiency improvement methods. 9. Disseminate lessons learnt. 10. Business Transformation requirements in line with the current operating model 11. Establish new governance, Strategy, Structures, Processes, Rewards and People 12. Develop a Key Account management process for 3rd / outside party projects (Clients / Investors). 13. Develop a relationship with internal stakeholders including business development. 14. Lead for the business development activities with future pipeline of projects Essential · Relevant experience in the successful management of major and complex change programmes. · Experience of applying programme / project methodologies · Commercial and financial awareness. · Experience in Transformation · Experience in developing operating model. · Experience in Stakeholder management · Experience in Investment appraisals Desirable · Educated to degree level. · Member of project association · Knowledge of the principles of investment processes and procedures. · Knowledge of/experience in the UK rail industry. · Previous ASPRO Experience","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } External how to apply: Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We are a Disability Confident Leader employer! We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working, recognising that employees may wish to balance work with their family and home life. Network Rail Benefits – To find out about what benefits we offer, click here Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information. Please ensure you have the appropriate Right to Work status when applying for this role.” Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness of our safety vision. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes and bonus scheme. You will also be entitled to 28 days annual leave. Salary: starting at £71,163 and increasing to £80,060 per annum. *Employees will be entitled to a 75% discount off leisure travel from December 2022, this includes all Advance, off peak and super off peak tickets* Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Closing date: 1st December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}