{"line-1":"Track Maintenance Engineer","line-2":"Location","line-3":"Cardiff, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here.We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here Yn Network Rail, rydym yn rhan o deulu mawr sy'n gwasanaethu miliynau o deithwyr a defnyddwyr cludo nwyddau ledled y DU bob dydd. Mae ein gwasanaeth yn effeithio ar filiynau o bobl ac rydym yn ymdrechu i ddod yn fwy effeithlon wrth i ni wella, cynnal a gweithredu ein rhwydwaith. Mae ein teithwyr a'n defnyddwyr cludo nwyddau wrth galon popeth a wnawn. Rydym yn helpu i gysylltu pobl â'u ffrindiau a'u teuluoedd a chael nwyddau â'u cyrchfan yn ddiogel ac yn effeithlon. Rydym yn sefydliad lle mae pobl o bwys. Pan ydych chi'n rhan o'n tîm, rydych chi o bwys i ni, ac rydych chi o bwys i filiynau. Gwyliwch ein fideo i ddarganfod mwy! Mae Rhanbarth Cymru a Gorllewin yn cynnwys mwy na 2,700 milltir o reilffordd ac rydym yn gwasanaethu cymunedau a busnesau Cymru, Cwm Tafwys, gorllewin Lloegr, a Phenrhyn y De -orllewin. Mae ein huchelgais i fod yn ymatebol i deithwyr a defnyddwyr cludo nwyddau yn ein gyrru bob dydd ac mae gennym ni'r pŵer i wneud y peth iawn i'r rhai sy'n defnyddio'r rhwydwaith rheilffyrdd. Rydym yn mynd ati i herio arferion anniogel ac yn cymryd cyfrifoldeb am fynd i'r afael â risgiau, datrys materion, ac amddiffyn diogelwch a lles.Am ein pobl a'r broses recriwtio - rydym yn gyflogwr cynhwysol o ddewis ac rydym yn croesawu ceisiadau gan bawb! Fel gweithiwr rheilffyrdd rhwydwaith, byddwch chi'n mwynhau ystod eang o fuddion! • Teithio staff breintiedig - Gostyngiad teithio hamdden o 75% ar yr holl deithio hamdden ac mae'n cynnwys aelodau o'r teulu. • Cymhorthdal ​​o hyd at 75% ar docynnau tymor y rheilffyrdd a thymor tanddaearol os ydych chi'n teithio i weithio ar y trên. • Cynghrair Tocynnau GWR - Gostyngiad Trwy'r Tocynnau Trwy'r Dydd i chi a hyd at 5 ffrind a theulu i'w defnyddio ar draws y rhwydwaith GWR (20 pas y flwyddyn) • Pecyn budd -daliadau gan gynnwys cynigion gofal iechyd, cynllun cylch i waith, aelodaeth clwb gofal iechyd gostyngedig, a chynigion a buddion gostyngedig gan gynnwys gofal plant, gofal iechyd a safle siopa ar -lein. • ystod o gynlluniau pensiwn i ddewis ohonynt • 5 diwrnod o absenoldeb gwirfoddoli â thâl. • Pythefnos o Absenoldeb Wrth Gefn Taledig ar gyfer Cymuned y Lluoedd Arfog. • Yn Rhanbarth Cymru a Gorllewin, cewch gyfle i ymuno â Proud, ein cynllun gwobr a chydnabod lle gallwch ddweud diolch a chydnabod cydweithwyr ledled y rhanbarth sydd wedi dangos gwerthoedd ac ymddygiadau rhagorol. I ddarganfod mwy am y buddion yn Network Rail, cliciwch yma. Rydym am helpu i ddarparu rheilffordd sy'n ddiogel, yn ddibynadwy, yn fforddiadwy ac sy'n darparu gwasanaeth gwych i gwsmeriaid i bawb. I gael mwy o wybodaeth am reilffordd rhwydwaith cliciwch yma","line-8":"Brief Description","line-9":"You will lead and direct the Infrastructure Maintenance delivery team in the safe delivery of inspection and maintenance of functional assets to standards and within budget. Byddwch yn arwain ac yn cyfarwyddo'r Tîm Cyflenwi Cynnal a Chadw Seilwaith wrth ddarparu archwiliad a chynnal asedau swyddogaethol yn ddiogel i safonau ac o fewn y gyllideb.","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:· Lead and direct the Infrastructure Maintenance team to achieve business and functional objectives and meet key performance measures.· Manage development of individuals and the engagement of the team. · Manage the arrangements for staff safety and competence.· Identify and implement safety, asset performance, reliability, productivity and efficiency improvement initiatives.· Manage the inspection and maintenance of assets to standards.· Manage the prioritisation of work and delivery to plan.· Check that safety, assurance, compliance, performance and business processes are followed.· Identify and submit non compliances for approval and take appropriate action where required.· Manage the process to handover and accept back assets being renewed, installed, or modified by projects.· Restore to normal operation after completion of testing/investigation, equipment that has failed, been subject to an allegation or has been renewed as part of a maintenance delivered renewal programme.· Develop and agree annual maintenance, inspection and testing programmes and resource levels.· Develop and authorise quarterly work plans and resource levels.· Identify and propose asset renewals.· Review and approve method statements and/or plans for design and/or work activities as required.· Undertake investigations and report on accidents/incidents.· Undertake an agreed programme of safety tours, staff surveillance, work quality and asset condition checks.You will ideally have · Relevant technical competence· Experience in maintenance management, processes and techniques· Knowledge of safety and compliance management processes· Detailed knowledge of relevant standards and procedures· Knowledge of operational railway environment· Knowledge of other functional disciplines· IRSE Licence holder (Signalling only)· Local Accident & Incident Investigation· Good interpersonal, influencing, communication and organisation skills What could set you apart· Incorporated Engineer· Membership of professional bodyNot sure if you meet all the requirements? Let us decide. Eich prif gyfrifoldebau fydd:• Arwain a chyfarwyddo'r tîm cynnal a chadw seilwaith i gyflawni amcanion busnes a swyddogaethol a chyflawni mesurau perfformiad allweddol.• Rheoli datblygiad unigolion ac ymgysylltiad y tîm.• Rheoli'r trefniadau ar gyfer diogelwch a chymhwysedd staff.• Nodi a gweithredu diogelwch, perfformiad asedau, dibynadwyedd, cynhyrchiant a mentrau gwella effeithlonrwydd.• Rheoli archwiliad a chynnal asedau i safonau.• Rheoli blaenoriaethu gwaith a chyflwyniad i gynllunio.• Gwiriwch fod diogelwch, sicrwydd, cydymffurfiaeth, perfformiad a phrosesau busnes yn cael eu dilyn.• Nodi a chyflwyno diffyg cydymffurfio i'w cymeradwyo a chymryd camau priodol lle bo angen.• Rheoli'r broses i drosglwyddo a derbyn asedau cefn sy'n cael eu hadnewyddu, eu gosod neu eu haddasu gan brosiectau.• Adfer i weithrediad arferol ar ôl cwblhau profion/ymchwilio, offer sydd wedi methu, wedi bod yn destun honiad neu wedi cael ei adnewyddu fel rhan o raglen adnewyddu a gyflwynir gan waith cynnal a chadw.• Datblygu a chytuno ar raglenni cynnal a chadw, archwilio a phrofi blynyddol a lefelau adnoddau.• Datblygu ac awdurdodi cynlluniau gwaith chwarterol a lefelau adnoddau.• Nodi a chynnig adnewyddiadau asedau.• Adolygu a chymeradwyo datganiadau dull a/neu gynlluniau ar gyfer dylunio a/neu weithgareddau gwaith yn ôl yr angen.• Cynnal ymchwiliadau ac adrodd ar ddamweiniau/digwyddiadau.• Cynnal rhaglen gytûn o deithiau diogelwch, gwyliadwriaeth staff, ansawdd gwaith a gwiriadau cyflwr asedau.Yn ddelfrydol, bydd gennych chi• Cymhwysedd technegol perthnasol• Profiad o reoli, prosesau a thechnegau cynnal a chadw• Gwybodaeth am brosesau rheoli diogelwch a chydymffurfiaeth• Gwybodaeth fanwl am safonau a gweithdrefnau perthnasol• Gwybodaeth am amgylchedd rheilffordd gweithredol• Gwybodaeth am ddisgyblaethau swyddogaethol eraill• Deiliad trwydded IRSE (signalau yn unig)• Ymchwiliad Damweiniau a Digwyddiad Lleol• Sgiliau rhyngbersonol da, dylanwadu, cyfathrebu a threfnuBeth allai eich gosod ar wahân• Peiriannydd corfforedig• Aelodaeth o gorff proffesiynolDdim yn siŵr a ydych chi'n cwrdd â'r holl ofynion? Gadewch inni benderfynu.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: This role is a band 3C – £55,596 - £62,546 per annum. The contracted working hours are 35 Hours a week, scheduled 1-in-4 and/or 1-in-3 weekends and/or nights to complete assurance and inspections, which will result in a 10% salary uplift payment. The requirement for you to work unsocial hours is dependent on the needs of the business and this will next be reviewed on a regular frequency. Closing date: 04/12/2023. Interview date: 11/12/2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please contact Hayley Bird – Hayley.bird@networkrail.co.uk. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Cyflog: Mae'r rôl hon yn fand 3C - £ 55,596 - £ 62,546 y flwyddyn. Mae'r oriau gwaith dan gontract yn 35 awr yr wythnos, wedi'u hamserlennu penwythnosau 1-mewn-4 a/neu 1-mewn-3 a/neu nosweithiau i gwblhau sicrwydd ac archwiliadau, a fydd yn arwain at daliad codiad cyflog o 10%. Mae'r gofyniad i chi weithio oriau anghymdeithasol yn dibynnu ar anghenion y busnes a bydd hyn yn cael ei adolygu nesaf ar amledd rheolaidd.Dyddiad cau: 04/12/2023. Dyddiad y Cyfweliad: 11/12/2023. Sicrhewch eich cais i mewn cyn gynted â phosibl, efallai y byddwn yn cau'r hysbyseb cyn y dyddiad cau rhestredig os ydym yn derbyn digon o geisiadau. Ni dderbynnir ceisiadau hwyr.Cliciwch ‘Apply Now’ i wneud cais. Rydym yn gyflogwr cyfle cyfartal ac yn werth amrywiaeth. Nid ydym yn gwahaniaethu ar sail hil, crefydd, tarddiad cenedlaethol, rhyw, cyfeiriadedd rhywiol, oedran, statws priodasol, neu statws anabledd. Cliciwch yma i gael mwy o wybodaeth. Mae amrywiaeth a chynhwysiant yn fwy na geiriau gwefr yn unig i ni. Rydyn ni bob amser yn ymdrechu i sicrhau ein bod ni'n darparu amgylchedd croesawgar a diogel i bawb. Rydym yn cydnabod bod rhai grwpiau wedi'u tangynrychioli yn ein tîm ac rydym yn gweithio'n agos gyda'n rhwydweithiau amrywiaeth a chynhwysiant rhanbarthol i sicrhau ein bod yn cefnogi'r grwpiau hyn orau ag y gallwn. Rydym yn gweithio ar y cyd â'r tîm ymasiad diwylliannol. Os hoffech gael cefnogaeth gyda'ch cais neu'ch cyfweliad, cysylltwch â Wales&WesternCulturalfusion@networkrail.co.uk neu ewch i'r dudalen Cyswllt: Cymru a Gorllewin Diwylliannol Fusion (SharePoint.com). Mae Network Rail yn arweinydd hyderus anabledd a byddwn yn ceisio ein gorau i addasu'r broses a chynnig dewis arall rhesymol i helpu i gefnogi pobl ag anableddau i gael mynediad, cymhwyso a chyfweld am rolau. Gallwch ymweld â chwch gwenyn gyrfa Evbreak i gael cyngor ar gymorth hygyrchedd os nad ydych yn siŵr o'r opsiynau sydd ar gael. Os oes angen unrhyw addasiadau/addasiadau rhesymol arnoch, cysylltwch â Hayley Bird - hayley.bird@networkrail.co.uk.Mae pob cynnig o gyflogaeth yn amodol ar ôl cwblhau gwiriadau cyn cyflogi yn foddhaol. Cliciwch yma i gael mwy o wybodaeth. Mae ein safon cyffuriau a alcohol wedi newid. Bydd yn ofynnol i bob darpar ymgeisydd gael a phasio prawf cyffuriau ac alcohol. Bydd eich cais yn cael ei ddiddymu os ydych chi'n cofnodi prawf positif. Bydd yr holl gyffuriau positif a chanlyniadau profion alcohol ar gyfer darpar ymgeiswyr yn cael eu dal yn ddiogel ar gronfa ddata Sentinel ac ataliad 5 mlynedd o wneud cais am rôl hanfodol diogelwch, bydd rôl sy'n gofyn am ardystiad PTS neu rôl ddiogelwch allweddol ar seilwaith a reolir gan reilffyrdd rhwydwaith yn cael ei orfodi. Mae cadw pobl yn ddiogel ar y rheilffordd wrth galon popeth a wnawn. Felly mae ymddygiad diogel yn ofyniad i weithio ar gyfer Rhwydwaith Rhwydwaith. Dylech ddangos eich ymroddiad personol i ddiogelwch ar eich cais."}