{"line-1":"Senior Engineer [M&E]","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Technical Authority","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. About the function… Technical Authority (TA) are vitally important part of the freight and passenger business. We are here to consistently deliver for our front line and customer today, tomorrow and for the future. TA’s purpose is to support our front line to deliver safe and efficient performance for passenger and freight. We do this through providing technical leadership and specialist expertise, managing the National Control and Competence Frameworks, facilitating technical growth and lateral learning and assuring regional delivery. Our role is to find creative technical solutions to problems, to set effective strategies and policies, to find better ways of doing things and to provide strong competence and assurance regimes that make sure we do things effectively. We are looking to recruit a Senior Engineer [M&E] role that can provide technical engineering input, support and advice related to power distribution systems and associated equipment.","line-8":"Brief Description","line-9":"🚀 Join Our Team as a Senior Engineer [M&E] in Milton Keynes! 🚀 Who Are We Looking For? Are you an experienced Senior Engineer [M&E] ready to take on a new challenge? We're on the lookout for a talented individual to join our dynamic team in Milton Keynes. As a key player, you'll provide invaluable technical engineering expertise and support across a designated discipline. We're not just seeking an employee; we're searching for a passionate team member ready to make a significant impact. The successful candidate should demonstrate a good knowledge of electrical power distribution systems and equipment (both HV and LV) currently used on Network Rail infrastructure and be willing to lead a small team of M&E Engineers and Assistant Engineers to achieve the objectives set. Experience of, knowledge of, or interest in, IEC 61850 based equipment or electrical protection schemes & equipment in railways would be advantageous.","line-10":"About the role (External)","line-11":"What Does Your Average Day Look Like? Your role as a Senior Engineer [M&E] is diverse and exciting. Here's a glimpse of what you'll be doing: ✨ Expert Advice and Support: Offering expert advice and support related to services for both our valued customers and suppliers. Your insights will be integral to our success. 🌐 Professional Leadership: Taking the lead in providing professional leadership for your designated engineering discipline. Your expertise will guide our team towards excellence. 🔍 Investigations and Analysis: Conducting technical accident and incident investigations and supporting the development of standards and specifications. Your analytical skills will play a crucial role in shaping our approach. 📊 Policy and Standards: Contributing to policy and standards development, operational processes, and system management. You'll manage the design and delivery of programs, ensuring the development of technical capabilities within Network Rail. 💡 Innovation and Improvement: Identifying opportunities for technical and business process improvement, fostering innovation, and developing business cases where needed. Your proactive approach will drive positive change. 🚧 Project Delivery: Acting as the Delivery Manager for specific projects, ensuring timely, cost-effective, and high-quality delivery. Your project management skills will shine in this role. 🌍 External Representation: Representing Network Rail externally and contributing to European issues when required. Your role extends beyond our organization – you'll be an ambassador for us in the industry. 🤝 Collaboration and Integration: Coordinating activities across various engineering disciplines and contributing to the development of fellow engineers. Your collaborative spirit will be instrumental in fostering a thriving engineering community. What essential skills and experiences are required? The successful candidate for this role will be required to be/have: - Essential: 1. Degree or equivalent in a relevant discipline or able to demonstrate an equivalent level of experience (Level 6) 2. Membership of a relevant technical body 3. Broad technical engineering experience 4. Project or financial planning and management experience Desirable: 1. Management or supervisory experience 1. Chartered status 2. Formal Project Management qualification (e.g. APMP, PRINCE2, PMIP, MSP) 3. Proven ability in managing commercial, contractual and financial issues 4. Knowledge of the railway industry and a understanding of railway infrastructure For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent Location: This role is based at The Quadrant:MK. For roles based in the Quadrant:MK, you must live within 75/90 minutes of The Quadrant. Closing date: 22nd January 2024. On occasions, we may need to close the advert early based upon application volumes. Late applications will not be accepted. Interviews will be held W/C 29th January 2024 – dates subject to change depending on business requirements Band & Salary: Band 3C- £55,596 - £62,546 What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. What does our recruitment process look like? 1. Once you have applied, our Recruitment Specialist will look at your CV. 2. If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment. 3. If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}