{"line-1":"Section Manager [Track] - Newport","line-2":"Location","line-3":"Newport, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"Os hoffech i hwn gael ei gyfieithu i'r Gymraeg, cysylltwch â hayley.bird@networkrail.co.ukAt Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain and operate our network. Now is a fantastic time and join our team in Wales and Western region as we finalise the reforms to our maintenance organisation which will deliver: · A safer and more reliable and punctual service for passengers and employees – quicker fault fixes by more agile multi-disciplined response teams.· Individual rostering – enabling us to send the right number or people to fix a fault.· Multi-skilling – investing in the knowledge and skills of our people so they are better equipped to fix the most common faults themselves.· Accelerated and improved technology deployment – we have a raft of labour and life-saving technology ready to be rolled out. Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us and you matter to millions. Watch our video to find out more! About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! We look for opportunities to offer great opportunities to learn and grow through personal and professional development. And, if you make the grade then you can look forward to a rewarding and fulfilling career with a company that joined the top 50 in the Glassdoor's 2021 Best Places to Work. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"You’ll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. You will be accountable for managing a section of the rail network. You’ll manage and develop a large maintenance team, and drive safety and efficiency across diverse works.","line-10":"About the role (External)","line-11":"In this key role, you will be accountable for managing a section of the rail network. Leading a large maintenance team, you will enjoy significant responsibilities. Managing in-house teams and contractors alike, you’ll make a vital contribution to the success of our ambitious plans. From signalling to track and electrification, you’ll proactively direct the work of teams delivering inspections, renewals and maintenance of diverse infrastructure assets. You’ll be personally responsible for planning, inspecting and implementing important tactical works. This is role is operational and there will be an element of on call and out of hours contact needed.Championing safety as a top priority, you’ll have the authority to recommend any necessary renewals. Managing budgets and driving engagement and development across the team, you’ll see that work is consistently delivered to performance, cost and quality targets.Due to the importance of your role, we’ll expect you to respond to issues that arise, even when off duty.You will be a specialist in Track - You’ll be responsible for maintaining, inspecting, and repairing the track network, (also known as the Permanent Way or P-Way) to keep the railway safe and efficient. This is a very manual role as you’ll be working with rails, sleepers and ballast that support the trains, together with their associated drainage and ancillary structures. Your skills matter:· Experience of managing the production and delivery of a comprehensive and compliant work programme· Able to demonstrate, promote and embed safe working behaviours within the team· Able to coach, influence and develop others· Knowledge of discipline-specific maintenance, inspection, faulting and renewal techniques· Able to lead and implement change and improvement initiatives· Excellent communication and influencing skills, both in person and in writing· Comfortable working shifts including days, nights and weekends To stand out you will:· Hold or be working towards an NVQ level 3 or 4 (or equivalent) in a relevant subject or have attained an appropriate level of knowledge through equivalent relevant experience· Able to promote and demonstrate safe working behaviours· Knowledge of budget management and cost/waste control processes and techniques· Able and willing to drive vehicles as required by business need You matter to usYour commitment to self-development and continuous learning is hugely important in this role and we'll provide you with all the training to develop both technical skills and non-technical skills. If you’re joining us from another industry, the structured training will give you the skills and confidence to move into a rewarding career in rail. Today’s Section Managers are tomorrow’s Engineers or Project Managers, and we offer a clear career path for you.As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members.· A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· Effectively manage work-life balance with a 35hrs per week contract, with hybrid working, flexible working, and family friendly support.· 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: Maintenance Grade role Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 18th December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. The assessment process will consist of competency and technical interview. Click ‘apply now’ to apply. Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}