{"line-1":"Technical Lead (Regions)","line-2":"Location","line-3":"Bristol, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, flexible working, and enhanced family friendly support. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"Are you someone who likes to see your work make a difference to the people around you? We are seeking an Azure Developer with a strong ability to work directly with users. This role is part of a team that sits within the wider Finance directorate and serves the wider region. The region is shifting to a devolved model where products and solutions can be developed locally and have National interfaces. As part of the role you will: · Undertake the support, maintenance, and development of digital and data products owned and supported by the Region. · Work with suppliers to deliver Possession Optimisation, a key priority within the first 12 months that is revolutionising how Engineering Access is planned and delivered through digital and data-driven tools. · Coordinate and build coding components that support regional products ensuring that the safety, data protection requirements, and security needs are clearly identified, maintained, and assured. · Develop and support regional upskilling in Digital and Data environments and tools. Through your technical expertise in Microsoft Azure back-end or front-end coding, you will work with the Region’s teams building relationships with key internal customers helping to support and enhance performance Digital and Data Products across a range of measures. A strong ability to work directly with users is required to understand their needs and translate them into technical requirements. The location is stated as Bristol, however, the job location is flexible for hybrid working within the Wales & Western Geographic Region. Our internal customers work all over the Region so travel will be required to attend offices, delivery units, and trackside. Application Process: As part of the interview, there will be a technical element where you will be asked to show and explain the coding and display of products you have created and how they enable business value.","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:1. Maintain a high level of expertise in the supported technology domain, keeping up to date with new developments in the field as well as maintaining a deep knowledge of the existing and legacy applications of the technology in the NR environment. Ownership of technical-level relationship with the vendor.2. Provide expert-level consultancy and support services to delivery projects utilising the technology domain, ensuring that new solution deliveries successfully integrate and follow domain and NR best practice and standards.3. Influence and guide strategic direction to confirm that NR’s strategy and policy for the technical specialism prioritises maintainability, supportability and best practice with relation to the technology domain.4. Provide expert level technical support to assist Region colleagues who require assistance or solutions for complex business issues related to the supported technology area.5. Highlight, communicate and address future and current risks, opportunities and challenges for NR arising from developments or changes in the technology domain. 6. Define, author and maintain Regional operational patterns, standards and best practice for the supported technology domain. You will ideally have· Extensive experience in an expert-level role supporting and delivering solutions in the supported technology (Microsoft Azure and Power Products)· Industry recognised high level qualification in the supported technology· Experience in design, development and support of bespoke solutions in the supported technology· Demonstrable expertise in and knowledge of current, future and existing developments in the field of the supported technology What could set you apart· Comprehensive knowledge and understanding of the supported technology deployments within Network Rail· Recognised industry contributor to the development of the supported technology domain best practice· Thorough understanding of consultancy approaches, tools and techniques· Experience of working as an expert authority in the supported technology domain within a large organisationNot sure if you meet all the requirements? Let us decide.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £55,596 to £62,546 per annum. Closing date: 15th January 2024. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. Please note this is a 12-month fixed term contract opportunity, with potential to become permanent. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}