{"line-1":"Train Running Controller","line-2":"Location","line-3":"Birmingham, GB","line-4":"Department Name","line-5":"Operations & Customer Services","line-6":"About Network Rail","line-7":"We're proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here. Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions. And we do it in millions of different ways.This is an exciting time to join Network Rail. We’re passionate about great service and commit to our service equation vision by “putting passengers first”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves - what can we do to put our passengers and freight users at the centre of everything we do? You will be part of the NW&C Region which consist of three routes:· North West Route, covering Manchester, Liverpool, Lancashire and Cumbria.· Central Route, covering the West Midlands and Chiltern areas.· West Coast South Route, covering the south of Crewe to London Euston. There is also a Regional Team which supports Regional Major Programmes & Professional services.To find out more about us - Take a look here! For us, ‘Diversity' means recognising differences between people while valuing the contribution they make. ‘Inclusion’ means creating safe and welcoming workplaces with fair cultures that encourages innovative and fresh ways of thinking. We value the commitments you may have outside of work and will consider flexible and hybrid working applications. If we can make it work – we will! Please click here for more information.","line-8":"Brief Description","line-9":"Manage train services on the network to meet the agreed train plan both during normal operation and disruptive events. Deliver PPM, Train Operator franchise commitments, Network Rail and other customer targets. Lead and manage the performance of the daily train plan and take early action to minimise customer disruption. Communicate effectively regarding train performance and train regulation, within control, with signallers and relevant Train Operators. Define and implement contingency plan and service recovery arrangements.","line-10":"About the role (External)","line-11":"Every day will be different, but you can expect to be involved in the following activities:1. Work during both normal train running and disruptive events, to deliver the optimum service that meets the differing needs of the rail industry, passengers and freight customers.2. Manage the safe and efficient running of trains over the Route infrastructure and of cross route trains in liaison with other Network Rail Train Running Controllers.3. Where nominated, lead the on shift management for Network Rail of specific train operator’s services, service groups or trains on an “end to end” basis in full liaison with all other relevant Network Rail Controls and train operators.4. Make pro-active train regulating decisions using control systems and interpreting incoming information to identify potential disruption and initiate early action to minimise train delays, communicating with signallers, interfacing Network Rail Controls and train operators as necessary.5. Work closely with the Incident Controller to manage train service delivery during times of perturbation, being the key liaison with representatives of train operators whose services run in the route and other control centres.6. Develop and specify during times of disruption emergency timetables, contingency and service recovery plans, initiating and leading discussion with interfacing Network Rail Controls and train operator staff regarding resourcing of the plan.7. Lead discussions with interfacing Network Rail and TOC Controls in respect of traffic management during engineering work.8. Maintain a daily log of all train running information and events, using the available systems in accordance with the relevant company standards and instructions.9. Undertake planning of VSTP train movements to a time horizon of 48 hours. In order to be successful in this role, we would like you to have/to be:· Operational Rules knowledge· Knowledge of passenger and freight operating procedures· Operational experience within a control environment or operations role· Understanding of the Working Timetable, together with detailed working knowledge of Route timetables· Knowledge of Train Operating Companies organisational structure, operational strategy, deployment and routes· Good geographical knowledge of applicable Route· Demonstrable skill in the use of Microsoft Office package and Control specific software e.g. CCF, TMIS, TRUST, TRUST DA, TOPS, Nexus Alpha and Alpha Page or other communications/ pager system· Working knowledge of railway communication systems and protocols· Good team working skills and ability to make objective decisions· Able to influence others and work under pressure· Good understanding of commercial business objectives within Network Rail and Train Operating Companies· Knowledge of train service contingency plans and regulation policies We would also like but it isn’t crucial to have/to be: · Geographical knowledge of adjoining Routes· Working knowledge of the Railway Operating Code","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business Click here for more information Salary and benefits: · Salary: Controller 3 £60,825 Pro-rata annual leave entitlement (28 days) My benefits – our discounted online shopping site A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits Subsidies of up to 75% on rail and underground season tickets 75% discount on leisure travel A choice of contributory pension schemes 2 weeks paid reserve leave for our Armed Forces community Want to find out about what fantastic benefits we offer? Find out here Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Closing date: 5 December 2023. Late applications will not be accepted. Please note this advert may close early. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a diverse interview panel wherever possible. Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}