{"line-1":"Engineer [M&E]","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Technical Authority","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. About the function… Technical Authority (TA) are a vitally important part of the freight and passenger business. We are here to consistently deliver for our front line and customers today, tomorrow and for the future. TA’s purpose is to support our front line to deliver safe and efficient performance for passengers and freight. We do this through providing technical leadership and specialist expertise, managing the National Control and Competence Frameworks, facilitating technical growth and lateral learning and assuring regional delivery. Our role is to find creative technical solutions to problems, to set effective strategy and policy, to cut red tape, to find better ways of doing things and to provide strong competence and assurance regimes that make sure we do things effectively. This vacancy is for an Engineer in the M&E Power Distribution Team in the Technical Authority. The workstreams will be varied but will focus on low voltage fixed plant equipment and involve working with internal and external departments to Network Rail.","line-8":"Brief Description","line-9":"Who are we looking for? We are looking for an Engineer [M&E] to cover a Permanent position based In Milton Keynes. As an Engineer, you’ll be responsible for taking the lead and working under the guidance of a Principal Engineer, acting as the technical expert or engineering support on a variety of low voltage fixed plant equipment (e.g., signalling power distribution systems, rail heating systems, operational lighting, etc.). The M&E Power Distribution team acts as the technical specialists for Network Rail with regards to this equipment. Liaison with both internal Network Rail departments and outside parties is a key requirement with good communication skills essential. Financial control and reporting in line with departmental procedures will be conducted for all projects. A Degree/HND/HNC in Electrical or Electrical/Mechanical or Electrical/Electronic Engineering is a must, along with experience and detailed knowledge of the working principles of plant and equipment. The ability to write technical reports and specifications as well as design capabilities in your field of expertise is desirable.","line-10":"About the role (External)","line-11":"What are the key accountabilities? In this role, you will undertake a diverse range of tasks which includes, but is not limited to, the following: · Act as focal point for best practice and technical advice in own specialist area. · Provide support for incident and technical investigation and analysis. · Provide support for capability and performance assessment of options and designs. · Support the delivery of activities required by Network Rail policy and standards, incorporating legislation and international standards as appropriate. · Support the development of and work to agreed operational processes. · Provide support for strategy, product acceptance and asset development. · Identify and prioritise actions to address defects and deliver corrective actions. · Schedule and undertake analysis and risk assessments and develop mitigating actions. · Monitor and evaluate technical and related asset data. · Undertake information management, record-keeping and Engineering Verification activities. · Act as Delivery Manager for delivery of a specific project or portfolio of projects and deliver projects to time, cost and quality. What are the essential skills and experience we’re looking for? · HNC/HND or equivalent qualification or demonstrate equivalent experience (Level 4 / 5). · Experience in a relevant engineering area. · Sound knowledge of relevant policies and standards. · An understanding of safety management systems and risk assessment techniques. We would also like, but it’s not essential: · Incorporated Engineer or Chartered Engineer. · Project management experience and awareness of project management techniques. · Railway industry experience. · Qualifications with regards to BS7671. For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description. What are the key accountabilities? In this role, you will undertake a diverse range of tasks which includes, but is not limited to, the following: · Act as focal point for best practice and technical advice in own specialist area. · Provide support for incident and technical investigation and analysis. · Provide support for capability and performance assessment of options and designs. · Support the delivery of activities required by Network Rail policy and standards, incorporating legislation and international standards as appropriate. · Support the development of and work to agreed operational processes. · Provide support for strategy, product acceptance and asset development. · Identify and prioritise actions to address defects and deliver corrective actions. · Schedule and undertake analysis and risk assessments and develop mitigating actions. · Monitor and evaluate technical and related asset data. · Undertake information management, record-keeping and Engineering Verification activities. · Act as Delivery Manager for delivery of a specific project or portfolio of projects and deliver projects to time, cost and quality. What are the essential skills and experience we’re looking for? · HNC/HND or equivalent qualification or demonstrate equivalent experience (Level 4 / 5). · Experience in a relevant engineering area. · Sound knowledge of relevant policies and standards. · An understanding of safety management systems and risk assessment techniques. We would also like, but it’s not essential: · Incorporated Engineer or Chartered Engineer. · Project management experience and awareness of project management techniques. · Railway industry experience. · Qualifications with regards to BS7671. For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"What are the key accountabilities? In this role, you will undertake a diverse range of tasks which includes, but is not limited to, the following: · Act as focal point for best practice and technical advice in own specialist area. · Provide support for incident and technical investigation and analysis. · Provide support for capability and performance assessment of options and designs. · Support the delivery of activities required by Network Rail policy and standards, incorporating legislation and international standards as appropriate. · Support the development of and work to agreed operational processes. · Provide support for strategy, product acceptance and asset development. · Identify and prioritise actions to address defects and deliver corrective actions. · Schedule and undertake analysis and risk assessments and develop mitigating actions. · Monitor and evaluate technical and related asset data. · Undertake information management, record-keeping and Engineering Verification activities. · Act as Delivery Manager for delivery of a specific project or portfolio of projects and deliver projects to time, cost and quality. What are the essential skills and experience we’re looking for? · HNC/HND or equivalent qualification or demonstrate equivalent experience (Level 4 / 5). · Experience in a relevant engineering area. · Sound knowledge of relevant policies and standards. · An understanding of safety management systems and risk assessment techniques. We would also like, but it’s not essential: · Incorporated Engineer or Chartered Engineer. · Project management experience and awareness of project management techniques. · Railway industry experience. · Qualifications with regards to BS7671. For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-13":"How to apply (External)","line-14":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent Location: This role is based at The Quadrant:MK. For roles based in the Quadrant:MK, you must live within 75/90 minutes of The Quadrant. Closing date: 14th January 2024. On occasions, we may need to close the advert early based upon application volumes. Late applications will not be accepted. Interviews will be held W/C 22nd January 2024. Band & Salary: Band 4C: £43,588 – £49,037 per annum, (dependent upon experience) plus benefits. What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. What does our recruitment process look like? 1. Once you have applied, our Recruitment Specialist will look at your CV. 2. If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment. 3. If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}