{"line-1":"Infrastructure Maintenance Engineer","line-2":"Location","line-3":"Romford, GB","line-4":"Department Name","line-5":"DI IMDM Romford Indirect (821031) G1","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Romford Delivery Unit is seeking an Infrastructure Maintenance Engineer. They will lead and direct the Engineering team in the efficient delivery of inspection, maintenance, and project related works for all Infrastructure assets to meet relevant standards. The successful candidate will drive culture transformation for safety and asset performance creating continual improvement and deliver safety, compliance and performance strategies, following business processes in order to deliver a compliant, well performing asset through a safe large multi-disciplinary team.","line-10":"About the role (External)","line-11":"Every day will be different, but key responsibilities will include: 1. Create a customer focused, high performing team and provide professional leadership and direction in values, behaviours and the application of engineering practises and techniques. Create a strategy for developing a succession of competent engineers to provide service continuity (safety, compliance and performance) and support continual professional development. 2. Act as engineering professional lead to develop and manage implementation of the annual maintenance business plan, ensuring that work is correctly prioritised and volumes delivered to plan, and within agreed budgetary constraints.3. Lead and manage the engineering team to deliver holistic asset management, identifying deterioration rates, effectiveness of maintenance intervention, and optimal renewal timescales to reduce overall asset costs.4. Lead and direct the continuous improvement cycle. Identify and implement safety, asset performance, reliability, productivity and efficiency improvement initiatives. Coordinate asset renewals proposals and in conjunction with the Route Asset Management team monitor timescales for delivery against asset condition including deferred renewal sites.5. Lead and manage the engineering team to be compliant to the management assurance process, create a review strategy that identifies and prevents non-compliance to standards. Check that inspection and maintenance activities are completed in line with policies, procedures and standards, with non-compliances identified, submitted and appropriate action taken where required.6. Lead the engineering team in the delivery of health and safety, creating a plan of inspection and monitoring to continually improve safety performance and influence culture change. Managing the arrangements for staff safety, training and competence and delivering compliance with competency assessment systems.7. Develop and manage the engineering team, monitoring adequate resources are available to deliver a flexible, competent, skilled and effective workforce at all times and manage staff welfare, use of equipment and fatigue levels. Undertake appropriate safety tours, staff surveillance, work quality and asset condition checks.8. Undertake formal investigations and investigate and report on accidents/incidents.9. Develop and improve relationships with key stakeholders and suppliers. Lead as the ORR Interface for safety/maintenance/compliance issues.10. Identify and manage the introduction of new systems on the network, where applicable, including systems/safety approvals and monitoring so that processes and documentation exist for sustained network usage.11. Direct the timely assignment of, and thereafter, discharge of, Construction Design Management (CDM) duties for all maintenance activities.12. Discharge the relevant duties assigned under the NR Engineering Management Plan to include the role of Construction Engineering Manager (CEM).13. Create a strategy for developing and evolving weather preparedness plans and lead and direct the team in the safe delivery of the plan. We are looking for someone who meets the below criteria: 路 Chartered engineer路 Educated to degree level or equivalent experience路 NEBOSH certificate路 Detailed knowledge of rail engineering discipline and other rail engineering functional disciplines路 Successful experience in maintenance management, processes and techniques路 Detailed knowledge of compliance management processes and relevant standards and procedures路 Formal Accident & Incident Investigation路 Knowledge of operational railway environment路 Knowledge of CDM regulations and procedures.路 Successful experience as a people manager路 Proven interpersonal, influencing, communication and organisation skills Its not essential, but we would love it if you have: 路 Experience in Oracle (BMIS)","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Network Rail encourages applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other relevant factor. We will interview all disabled applicants who meet the essential criteria. We positively support flexible working recognising that employees may wish to balance work and home life. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal dedication to safety in their application! We follow a structured pay framework: Band 2C; Salary range: 拢85,395 - 拢96,070 Closing Date: 6th December 2023 Network Rail can offer you a rewarding career with competitive pay and excellent benefits including: 拢3270 inner London allowance拢6,000 car allowance75% off the cost of a season ticket for travel to work75% off leisure travel for yourself and family membersFlexible working arrangements28 days annual leave, plus bank holidaysA choice of contributory pension schemesPlease note, all offers with network rail will be subject to a medical assessment and negative drugs and alcohol test."}