{"line-1":"Project Management Assistant","line-2":"Location","line-3":"Manchester, GB","line-4":"Department Name","line-5":"Transpennine Route Upgrade","line-6":"About Network Rail","line-7":"Key InformationSalary: Starting at £27,820 per annum, dependent on experienceLocation: Base location of Manchester (office to be confirmed) but with the requirement to travel between Leeds and Huddersfield when requiredOffice requirement: This role will require the successful applicant to be in the office at least 4 days a week due to the support nature of the role28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak tickets. Employees are also entitled to 75% discount towards season tickets.Network Rail Benefits – To find out about what benefits we offer, click hereAbout Network RailNetwork Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!https://youtu.be/nLZ7OYSoQVUOver the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry.In being a part of Network Rail, you’re not only part of an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.https://network-rail.wistia.com/medias/e9gfrx2przWe have an exciting opportunity to join Transpennine Route Upgrade as Project Management Assistant!Transpennine Route Upgrade and AMEYAmey is working in partnership with Network Rail on the Transpennine route upgrade project since 2018, with an increased focus on providing reliable, frequent, faster, and greener railways to the North of England.Covering 76 miles of railway between Manchester, Leeds, York, Selby and onto Humberside, we lay the foundations, covering upgrades to civils, track, railway systems and electrification to the west of Leeds.By completing such works, we aim to support Network Rail with cutting carbon emissions and ensuring to deliver a smoother, more enjoyable journey to their customers. For more information visit www.theTRUpgrade.co.ukWe're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"We are looking for an enthusiastic, driven applicant who likes a challenge. The role is to support the Senior Management Team in everyday management of the Project, through detailed design and delivery. As part of your role, you will be responsible for maintaining trackers, chasing actions and updating the team with information via the various project meetings. You will monitor and report progress via our Alliance reporting systems and assist with general project queries. This is an opportunity for a talented individual to join the TRU West Alliance. We are upgrading the Infrastructure from Huddersfield to Leeds over the course of the next 5 years on the biggest railway project in the North. You need to have the ability to work in a fast-paced environment and under pressure. The ideal candidate will have great communication skills, written and verbal, be able to act with their own initiative to solve problems and provide a consistent level of support to the Senior Team. You will be working directly for the TRU West Delivery Director in this exciting role.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are: -1. Work as part of a project team, assisting the Senior Leadership team in delivering the projects to time, cost, and quality through various phases in a safe and environmentally responsible manner.2. Monitor and report programme and progress in accordance with project reporting systems and guidelines.3. Develop and integrate, effective support systems to enable the Project Manager to manage and control change.4. Process contractor possession and isolation applications so that they applications are complete and submitted to the prescribed time scales as directed.5. Monitor contractor performance indicators and provide periodic progress reports.6. Support the Project Management team in providing a safe working environment at all times during the execution of those projects under their responsibility.7. Manage generic and site-specific methods of working and supply risk assessments to agreed timescales.8. Monitor so that HSQE risk assessments have been carried out by the contractor and monitor compliance.9. Comply with the Investment Competence Framework.We need you to have: -· Some management experience including project management.· Educated to HND/HNC or similar standard.· HSQE awareness, issues and principles.It would be advantageous if you have: -· Membership (or working towards membership of) the Association for Project Management.· A degree or equivalent.· Knowledge of safety, quality, environmental, commercial and financial aspects.· Understanding of possession planning.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Location: Base location of Manchester (office to be confirmed) but with the requirement to travel between Leeds and Huddersfield when required.Office requirement: This role will require the successful applicant to be in the office at least 4 days a week due to the support nature of the role.Closing date: 8th December 2023. Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}