{"line-1":"Section Manager M&E [Control & Systems Maintenance]","line-2":"Location","line-3":"Gravesend, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":"🌟 Join our xx Team at Network Rail High Speed – Section Manager M&E [Control & Systems Maintenance]🌟Who we areNetwork Rail High Speed Ltd. (NRHS) is responsible for operating and maintaining the UK’s only international high-speed railway, High Speed (HS1).The 109km HS1 infrastructure consists of a diverse range of railway assets such as the track, signalling, overhead line, lineside buildings, depots, viaducts and long tunnels. NRHS is also responsible for operating and maintaining three international stations; St Pancras, Ebbsfleet and Stratford International. As a wholly owned subsidiary of Network Rail Infrastructure Ltd, NRHS is privately financed under an agreement with our client ‘HS1 Ltd’, undertaking a diverse range of activities from railway infrastructure maintenance and operations - through to station facilities management and retail on behalf of our client. Our Vision - to deliver the best High Speed rail customer experience.https://www.networkrail.co.uk/running-the-railway/our-routes/network-rail-high-speed/ Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us and you matter to millions. Watch our video to find out more!","line-8":"Brief Description","line-9":"The role We are excited to be introducing a Section Manager M&E [Control & Systems Maintenance] into our team. Manage and direct the Infrastructure Maintenance delivery team to deliver inspection, maintenance and renewal of assets to standards. Manage activities within agreed resource levels, budget and unit cost measures to achieve safety, asset performance, cost and quality business targets. This is a permanent position, so come and be part of a truly unique business that brings the UK closer to Europe. We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-10":"About the role (External)","line-11":"The person ​​​​​​​So, who are we looking for? If you can answer ‘yes’ to the following questions, then we look forward to receiving your application. Do you have experience in; Manage and direct the Infrastructure Maintenance delivery team and Contractors to achieve business and functional objectives and meet key performance measures. 2. Manage the development of individuals and the engagement of the team. 3. Manage the arrangements for staff competence and welfare. 4. Adhere to company policies and procedures. 5. Carry out work safely and in accordance with the safe systems of work procedures, method statements, plans and other instructions. 6. Implement safety, asset performance, reliability, productivity and efficiency improvement initiatives. 7. Manage the development of work plans that enables work to be delivered safely, efficiently and compliant to standards. 8. Manage and direct the inspection, faulting, maintenance and renewal of assets to standards. 9. Manage and check the quality of work delivered and confirm assets are compliant to standards. 10. Identify and propose asset renewals. 11. Manage the preparation of work and resource specifications, method statements and plans. 12. Manage information to update systems, databases and records. 13. Undertake a programme of staff surveillance, work quality and asset condition checks. 14. Contribute to your own development and that of others. 15. Discharge the relevant duties assigned to the ‘CDM Contractor’ (Network Rail Infrastructure Limited) in accordance with the Construction, Design and Management (CDM) Regulations. Experience, skills, knowledge and competencies: · Experience of managing and directing a team. · Experience of team leadership and development. · Experience of managing the production and delivery of a comprehensive and compliant work programme. · Able to demonstrate, promote and embed safe working behaviours within the team. · Able to lead and implement change and improvement initiatives. · Able to communicate effectively verbally and in writing. · Able to coach, influence and develop others. · Knowledge of conductor rail equipment maintenance and construction management processes, systems and standards. · Knowledge of budget management and cost/waste control processes and techniques. · Knowledge of the Construction, Design and Management Regulations. · Hold and retain competencies relevant to this post and required by business need. · Ideally hold (or be working towards) an NVQ level 3 or 4 (or equivalent) in a relevant subject or have attained the appropriate level of knowledge gained through equivalent relevant experience. · Able and willing to drive vehicles as required by business need.","line-12":"How to apply (External)","line-13":"The important stuff The role is based at Singlewell however frequent travel to our other office and site locations along the High Speed line is expected. What can we offer you in return? We follow a structured pay framework, any salary offered will be within the following pay range: Band xx - £52,000 (plus outer London allowance of £1,940 if based at Singlewell) In addition, we can offer you a rewarding career with excellent benefits, including: · 28 days annual leave (plus bank holidays) · Bonus scheme · Healthcare · Excellent choice of pension schemes · 75% subsidy on rail season tickets (including London underground) · 75% off leisure rail travel for you and your family · ‘my benefits’ – our discounted online shopping site · Training, development and employee assistance programme available · Two weeks paid reserve leave for our armed forces community · 5 days paid volunteering leave Network Rail Benefits - To find out about what benefits we offer, click here If you have been referred for a job vacancy in the Southern region of Network Rail, please complete the form below: Employee Referral Form If you are successful in your application, you may be required to go through a security vetting process (depending on the role). We are dedicated to creating an inclusive environment for our people. We want our employees to reflect the diverse communities that we serve. We welcome different and fresh ways of thinking and encourage a culture where people feel empowered to act and we would consider flexible working. Closing date and application process The closing date will be 29th December 2023. Late applications will not be accepted. Network Rail High Speed retains the right to close the advert early depending on application volume. This role is also advertised externally, Drugs and Alcohol Standard All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}