{"line-1":"Finance Business Partner","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Finance Business Partner to join our team to work with the supported business leadership team, under the direction of the Financial Controller/Senior Finance Business Partner, to deliver professional finance and accounting advise. Providing proactive, value add finance support to the business leaders across the function/route. Role and Responsibilities may include but are not limited to: 1. Lead and provide financial advice and guidance to senior budget holders in understanding the impact of the period results and forecasts against budges so they can understand their business better. 2. Be the expert in the function on accounting practices and advise on financial results and forecasts for budget holders, including preparing period accruals, transfers and adjustments to validate accounts are reflective, relevant. 3. Manage corporate governance throughout the cost centres they manage, conducting deep dives and reviewing compliance with financial regulations to protect the business from legal or negative consequences. 4. Deliver expert and accurate business review information and reporting, and highlight any significant issues with financial and other business results to enable informed decision making by the business area. 5. Engage and influence senior members of the team to help them understand their financial position and use professional expertise to guide in initiatives to improve business performance 6. Build bottom up, detailed plans to manage and develop the production of business plans and budgets to enable good corporate governance and value add analysis for senior leaders 7. Identify and proactively manage commercial risks, including the financial suitability of new customers or suppliers reducing the potential risk impact on the business area and influencing decision makers. 8. Manage the performance of central accounting functions to deliver for the cost centre area to enable an efficiently and effective accounting service. 9. Collate, investigate and make recommendation for investment appraisals and business case analysis to aid business decisions. 10. Model and analyse cost base and identify and drive opportunities and efficiencies to achieve area targets. **Please note that this is a 12 month secondment opportunity**","line-10":"About the role (External)","line-11":"Essential · Demonstrate strong understanding of business needs and relevant application of accounting standards · Membership (Or working towards a membership) of a relevant accounting body (CIMA/ACCA) · Expert knowledge and experience of creating and maintaining accounts and annual budget · Significant experience within relevant finance disciplines · Strong excel skills and use of data manipulation · Strong interpersonal and communication skills · Ability to interpret technical accounting regulations into everyday language · Demonstrable effective influencing skills at a senior level · Significant understanding of financial control and risk · Excellent technical finance and accounting knowledge Desirable · Understanding of project management principles and experience of managing complex projects · Membership of a relevant accounting body · Extensive experience of Oracle based systems · Degree or equivalent qualification in finance and accounting or business management or experience.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary and benefits: • Salary of £43,588 - £49,037 (Band 4.C) depending on skills, qualifications and experience • 28 days annual leave entitlement plus bank holidays • My benefits – Our discounted online shopping site • A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits • Subsidies of up to 75% on rail and underground season tickets • A choice of contributory pension schemes • 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 3 December 2023 and late applications will not be considered ** **Please note that this is a 12 month secondment opportunity** Oh, and by the way… We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you! We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications. Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. If you like the sound of all that, we’d love it if you could submit your application online."}