{"line-1":"On Track Plant Specialist","line-2":"Location","line-3":"Basingstoke, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Manage the effective planning, co-ordination and operation of all On Track Plant (OTP) to achieve the route work bank. Promote compliance with legislation, Network Rail company standards and Rail Industry Standards on the use of OTP and provide motivation and support for continued improvement in OTP operational standards. This is an opportunity for 12 months with the potential to become a permanent position.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Provide support in the planning of operations involving OTP at Delivery Unit and Route level.2. Provide a check of the Lifting Operations involving OTP in compliance with the Lifting Operations and Lifting Equipment regulations, Network Rail and Rail Industry Standards.3. Provide the technical lead on OTP including all briefing requirements to maintenance staff and suppliers.4. Provide expert advice and guidance on OTP operations to local management.5. Provide coaching and mentoring support for supervisor and senior managers required to undertake OTP assurance.6. Provide local support for national initiatives involving OTP improvements.7. Conduct assurance surveillance and inspections to identify good practice and incidents on non compliance and take appropriate action.8. Provide out of hours support for real time lifting operations.9. Act as regular liaison and key point of contact with OTP suppliers to manage compliance to relevant standards and maintain a good working relationship.10. Provide the focus for technical support for OTP incident investigations.Job Skills, Experience and Qualifications: Essential· Experience of planning· Knowledge of LOLER regulations and application· Knowledge of Construction Design and Management Regulations Site Safety requirements · Ability to obtain Network Rail Lift Planner competence· Knowledge of the engineering safety management and risk assessment processes· Ability to work under pressure and autonomously Desirable· Significant relevant experience of railway engineering· Experience of the construction industry· Experience of mentoring and coaching others· Holder of Appointed Person competence or Network Rail Lift Planner competence· Experience in both maintenance and projects· Experience of leading assurance activities","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582- £40,029 plus uplift for unsociable working hours Closing date: 29th November 2023, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes. This is an opportunity for 12 months with the potential to become a permanent position. Been referred by a friend, then please complete this form Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre –employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employee’s unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual subsidy on season tickets. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. #LI-DB1"}