{"line-1":"Senior Development Manager","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"OA Route Business Development (118657) G1","line-6":"About Network Rail","line-7":"Key Vacancy Information:Job Title: Senior Development Manager Role Type: Full Time, PermanentLocation: London Stratford PlaceClosing date: 1st December 2023 Salary: salary starting at £46,701and increasing to £52,538 (plus Employee Healthcare & an Inner London Allowance of £3,270 per annum)Annual Leave: 28 days + bank holidaysHours: 35 per week *Employees will be entitled to a 75% discount off leisure travel from December 2022, this includes all Advance, off peak and super off peak tickets* About Network Rail: Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!https://www.youtube.com/watch?v=nLZ7OYSoQVUOver the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.","line-8":"Brief Description","line-9":"The main purpose of this role is to support the development of the eastern section of East West Rail between Bedford and Cambridge. East West Rail Ltd are a body entirely separate from Network Rail, but the Senior Development Manager will act as Network Rail’s project sponsor, working closely with our asset protection team to assist East West Rail with the development of their options while also ensuring that Network Rail’s interests are protected. The role will require close working with representatives from East West Rail as well as stakeholders from across Network Rail and the industry to ensure that a broad range of views and experience are brought into the design development. Typical activities could include supporting East West Rail with regard to timetable and performance modelling; conducting design reviews with stakeholders; representing Network Rail at optioneering meetings; gathering requirements and managing key interfaces. The senior development manager will also be required to ensure that the asset protection team is adequately funded via funding agreements with East West Rail that will also require the securing of internal authority from Network Rail’s panels. In addition to supporting East West Rail, the senior development manager also has a broader role in leading the development of other projects through their early stages by managing the creation of Strategic Outline Business Cases (SOBCs) that can be submitted to government for funding approval. It is important to note that this role is largely focused on projects in the Anglia and the East Midlands Routes. The creation of SOBCs involves similar activities to those described in supporting East West Rail, with the key differences being that Network Rail would lead the work directly ourselves, and would also therefore own the business cases.","line-10":"About the role (External)","line-11":"Key Accountabilities – 1. Client the development of interventions, as part of the funding and commitment process, to the extent necessary to gain funding from, and be accountable within the company governance processes. 2. Work with internal and external stakeholders to establish parameters of scope, baseline conditions and delivery options which optimise value for money and consider the whole life cost, using a systems approach. 3. Manage the process of identifying and quantifying risk associated with the developed interventions, and, in line with the identified strategy, build these requirements into the procurement and contracting strategy decision making process. 4. Consider other company and industry requirements including risk, selection criteria, system integration, project interdependencies, asset protection and payment regime that are necessary to form part of the output specification. 5. Control the approval and escalation of any scope, value or cost changes after the contract has been awarded for the duration of the project / programme lifecycle. Manage the assurance and co-ordination of activity to support the scheme or portfolio throughout its lifecycle. 6. Build and manage relationships (internally & externally) through effective stakeholder management to balance the requirements of the Government, Network Rail and the industry as a whole. 7. Facilitate the discharge of the duties assigned by the CDM Co-ordinator [Network Rail Infrastructure Ltd] as detailed within the Construction, Design and Management Regulations 2007. Essential · Ability to articulate complex business problems into contractible work packages · Commercially astute, persuasive, and customer focused · Proven ability to write coherently; conveying report / investment information in a concise manner · Proven influencing and negotiating skills Desirable · Qualified to degree level or equivalent · Experience of converting risk into a commercial requirement and overlaying contractual agreements with this. · Experience of negotiating contracts to finalisation and able to demonstrate significant commercial success · Experience of leading a successful team · Experience in significant management roles in a commercial environment","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } External how to apply: Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We are a Disability Confident Leader employer! We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working, recognising that employees may wish to balance work with their family and home life. Network Rail Benefits – To find out about what benefits we offer, click here Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information. Please ensure you have the appropriate Right to Work status when applying for this role.” Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness of our safety vision. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). You will also be entitled to 28 days annual leave Salary: starting at £46,701 and increasing to £52,538 per annum. *Employees will be entitled to a 75% discount off leisure travel from December 2022, this includes all Advance, off peak and super off peak tickets* Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Closing date 1st December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}