{"line-1":"Project Operations Interface Specialist","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"SH Wessex Route Ops Manager (103315) G1","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"A great opportunity to join the Wessex Operations Team in developing and managing the project interface between the new electrical control room control system and re-controlling the current electrical controls rooms at Raynes Park and Eastleigh to Basingstoke Rail Operations Centre in 2025/26. You’ll be working closely with the project teams delivering the project and the local Operations teams and the wider electrical control room operators function.","line-10":"About the role (External)","line-11":"1. Signing off that each phase of the major project / programme of works is operationally feasible on behalf of the route throughout the GRIP lifecycle. 2. Chairing stakeholder meetings on operational matters related to the project or programme. 3. Providing expert witness on behalf of the route input to specific meetings. 4. Develop the operational requirements during project development including review and acceptance of key project products e.g. operations and control strategy. 5. Manage and coordinate all necessary modelling of proposals affecting the route in order to confirm the most appropriate solution is selected to deliver business requirements. 6. Lead for the route in the projection of the ‘major projects notice’ or similar for disruptive possessions / project activities in conjunction with the project team and secure necessary agreement with key stakeholders. 7. Lead for the route in managing the ergonomic and efficiency requirements of the major projects / programme of works in regard to all operational matters. 8. Manage and coordinate operations risk assessment to inform the process for commissioning plans and stage works for major projects or programmes associated with the route including any special working arrangements for engineering or other works, to successfully deliver project objectives. 9. Manage project liaison associated with route or other designated body. 10. Review and accept on behalf of the route documentation to verify that all necessary operational requirements have been accommodated. Undertake and review risk assessments to check that relevant operational principles are complied with and all necessary operational and maintenance requirements can be met. 11. Prepare expert subject material in connection with the project/programme for application for derogation or temporary non-compliance to normal operating or maintenance standards by suitable and sufficient risk assessment and arrange preparation of necessary instructions for approval. 12. Participate in project/programme related Committees dealing with operating recommendations for projects arising from them. Job Skills, Experience and Qualifications Essential · Significant experience in an operational role · Member of a relevant professional institution and/or educated to degree level · Detailed knowledge of operational standards and procedures and operation · Detailed knowledge of operational procedures and practices in a working environment · Detailed knowledge of Rules and Train related regulations · Knowledge of operational principles and standards · Knowledge of risk management and QRA techniques · Good communication skills Desirable · NEBOSH Certificate in Operational Safety and Health · Knowledge of modelling techniques","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £ 46701 - £52539 Been referred by a friend, then please complete this form Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre –employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employee’s unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual subsidy on season tickets. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. Closing date: 13th December 2023. late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}