{"line-1":"Roster Clerk","line-2":"Location","line-3":"Preston, GB","line-4":"Department Name","line-5":"BB Area Services Manager - North (850021) G2","line-6":"About Network Rail","line-7":"We're proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here. Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions. And we do it in millions of different ways. You will be part of the NW&C Region which consist of three routes: · North West Route, covering Manchester, Liverpool, Lancashire and Cumbria. · Central Route, covering the West Midlands and Chiltern areas. · West Coast South Route, covering the south of Crewe to London Euston. There is also a Regional Team which supports Regional Major Programmes & Professional services. To find out more about us - Take a look here! For us, ‘Diversity' means recognising differences between people while valuing the contribution they make. ‘Inclusion’ means creating safe and welcoming workplaces with fair cultures that encourages innovative and fresh ways of thinking. We value the commitments you may have outside of work and will consider flexible and hybrid working applications. If we can make it work – we will! Please click here for more information.","line-8":"Brief Description","line-9":"As a Roster Clerk, you’ll make sure that 80 -100 maintenance colleagues are in the right place at the right time completing essential maintenance activities so that we can continue to deliver a safe, efficient service for our passengers and freight customers. You will be placed on a 5-6 week training course to ensure you have all the skills needed to excel in the role. You will maintain effective and efficient rosters for employees compliant with the relevant company standards in line with current National rostering principles, competency requirements and agreed Terms and Conditions. We are able to offer this role either on a permanent full time basis or we can look at part-time hours to suit or job shares! There are several roles available and will be based in either Liverpool, Preston, Warrington, Carlisle or Stockport but travel may also be required.","line-10":"About the role (External)","line-11":"This is a new role which has come about as part of our drive to modernise our maintenance function. Whilst it would be great to have applicants who have experience of rostering staff, we’re happy to consider applications from candidates with the right mix of skills including: · Fantastic attention to detail· Determination and curiosity to solve problems or puzzles· Ability to plan, yet just as comfortable responding to last minute changes· Happy to manage lots of different things at one time and knowing how to prioritise and get them all done· Confident in using IT especially excel and word and ability to learn the bespoke roster system Since this is a new role, we’ll offer a comprehensive, tailor-made training package including:· An introduction to the railway, how we’re structured and how we work· A classroom-based course, Effective & Efficient Rostering, to give you all the skills you need to set you up for success in your role· Training in Fatigue Management standards and how to carry out fatigue checks· A plan of visits to sites and depots to meet maintenance colleagues and to understand local access availability for maintenance work· Briefing time with the Section Managers to understand their business requirements· Formal excel training Every day will be different, but you can expect to be involved in the following activities:1. Compile and publish agreed rosters using the corporate rostering tool in accordance with Maintenance Rostering Principles, company policies and standards.2. Prepare rosters for weekly rostered duties. Covering sickness, annual leave, training, briefing and special arrangements. Liaise with relevant line managers to crosscheck roster data.3. Manage short notice roster alterations liaising with all affected employees and line managers, including gaining verbal confirmation where necessary. Respond to and resolve any queries relating to roster issues.4. Make roster arrangements for medical examinations and interviews.5. Make roster arrangements for safety critical competence expiries, training plans, training courses and briefings.6. Monitor competency data so that no base roster shifts are left uncovered due to expired competencies.7. Liaise with associated Competency Delivery Specialist on maintaining competency records.8. Gather and analyse fatigue data and highlight issues to the relevant line manager.9. Provide information and data to support the route and delivery unit reporting requirements.","line-12":"How to apply (External)","line-13":"We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business Click here for more information Salary and benefits: · Salary: £27,820 Pro-rata annual leave entitlement (28 days) My benefits – our discounted online shopping site A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits Subsidies of up to 75% on rail and underground season tickets 75% discount on leisure travel A choice of contributory pension schemes 2 weeks paid reserve leave for our Armed Forces community Want to find out about what fantastic benefits we offer? Find out here Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Closing date: 27th November 2023. Late applications will not be accepted. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a diverse interview panel wherever possible."}