{"line-1":"Head of Financial Control & Analysis","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To provide strategic oversight on leading the finance team/s that manage the financial analysis and accounting operations of the relevant business areas, to deliver budgets and financial forecasts, month-end reporting, year-end activities as well as financial and non-financial analysis to support strategic insight and enable sound business decisions to be made. The role leads on financial risk management and collaborates with senior leaders to create risk minimisation plans and contributes to enabling financial systems are fit for purpose.","line-10":"About the role (External)","line-11":"Key Accountabilities 1. Lead and direct the finance and corporate governance processes for the function, in accordance with statutory, regulatory, government and group financial policy and regulations, to remain compliant with Network Rail and relevant accounting standards (incl. International Financial Reporting Standards IFRS).2. Leverage business and commercial acumen to suggest appropriate strategic options, where sustainable financial plans and objectives can be developed. Evaluate, justify, and embed strategic options using various innovative methods to implement strategy and manage change to effectively deliver business objectives. 3. Oversee all financial accounting, analysis, and reporting activities (incl. Profit & Loss, balance sheet, cashflow reporting), whilst enabling robust financial controls and governance for the associated function, with particular focus on managing public money principles to reduce risk to the business.4. Lead the team to produce insightful management reporting and analysis. Advise and influence senior stakeholders on appropriate strategies to manage business and organisational performance in relation to business and finance risks, while communicating the impact effectively to influence strategic decisions.5. Lead and coach the finance team in their day-to-day operations of the core financial and analytical activities and create a positive team environment by identifying strengths of individuals and empowering them to collaborate effectively.6. Create policies and systems for internal financial control and challenge stakeholders to support the integrity of assets and the associated financial records, to reduce financial and reputational risks to the business.7. Identify opportunities for efficiencies and challenge business partners on their value offering as part of the commitment towards continuous improvement and to enable more efficient and effective business decisions.8. Lead the business planning process through strong business partnering and influencing stakeholder at all levels to optimally utilise taxpayer’s funds. Create innovative approaches towards directing effective budgeting and financial forecasting and monitoring to improve financial performance and trends to enable better business planning to allow for sound management decisions and effective use of public funds and resources.9. Consult on the design and use of the latest technology and information systems for finance to evolve decision making and organisational performance in line with advancements in current technologies.10. Develop and improve the co-ordination with other functions, maintain positive working relationships with internal and external stakeholders (incl. the government) to aid collaborative working and lead to cohesive and effective business performance. Job Skills, Experience and QualificationsEssential· Significant post qualification experience with relevant accounting institution (i.e. ACCA, CIMA, ICAEW, or equivalent).· Thorough knowledge of emerging risk management and governance procedures (incl. operating under Managing Public Money rules)· Strong demonstrable commercial experience, with an understanding of investment regulations · Significant experience in balancing stakeholder expectations against the needs and capabilities of the business and wider government.· Expansive experience within multiple financial disciplines· Strong ability to identify, evaluate and advise on alternate sources of business finance and different ways of raising finance.· Influence and lead senior stakeholders through effective conflict resolution by positive challenge· Significant experience in influencing wider business decisions.· Experience of leading and motivating a team.· Strong ability to manage people through periods of significant changes and business pressures. Desirable· Wide and successful background either in rail or construction industry with extensive experience at a senior level · Experience of working in the public sector· Experience of dealing with third party funding arrangements","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £85,395 – £96,070, Car allowance of £6,000 and an Inner London Allowance of £3,270 per annum.Closing date: 30th November 2023 - Late applications will not be acceptedBeen referred by a friend, then please complete this form Click apply now to apply.Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}