{"line-1":"Finance Business Partner","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"OC Route Finance Anglia (338274) G4","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"The Anglia Finance team are looking for their next Finance Business Partner. The ideal candidate would be an enthusiastic individual who will provide accounting support and advice to the Senior Finance Business Partner, Operations teams and the wider Finance team whilst adhering to NR policies and guidance. The Finance function provides business partnering to manage the financial planning, analysis and reporting process for the Route/Region.","line-10":"About the role (External)","line-11":"In this role, you will be responsible to: 路 Support finance processes such as month end/year end closure inc commentaries, Balance Sheet Reconciliations, Budgeting, Forecasting, Reporting to deliver insightful and relevant financial reporting for the Business Partners. 路 Provide financial advice and guidance to budget holders in understanding the impact of the financial results. 路 Manage the performance of the central accounting functions to deliver an effective accounting service. 路 Model and analyse cost base and identify and drive opportunities and efficiencies to improve financial business performance. 路 Support and ensure that appropriate financial controls are in place on financial activity to protect the business from negative consequences e.g. financial loss of materials. We're looking for someone who can demonstrate the following essential criteria: 路 Working towards or a member of a relevant accounting body (CIMA/ACCA) or equivalent experience 路 Experience within relevant finance disciplines e.g. month-end, budgeting and forecasting 路 Numeric and analytical skills - Strong excel skills and ability to manage large volumes of data 路 Ability to communicate oral and written information logically 路 Ability to interpret technical accounting regulations into everyday language 路 Strong technical finance and accounting knowledge including financial control and processes 路 A team player with a positive attitude towards colleagues, shares knowledge and insights and provides accounting support to relevant Business Partners Whilst it's not essential, we'd love it if you can demonstrate the following: 路 Experience of working with Oracle Hyperion system 路 Degree or equivalent qualification in finance and accounting or business management or experience","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Network Rail encourages applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other relevant factor. We will interview all disabled applicants who meet the essential criteria. We positively support flexible working recognising that employees may wish to balance work and home life. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal dedication to safety in their application! We follow a structured pay framework: Band 4C; Salary range: 拢43,588 - 拢49,037 Closing Date: 28th November 2023 Network Rail can offer you a rewarding career with competitive pay and excellent benefits including: 拢3270 inner London allowance 75% off the cost of a season ticket for travel to work 75% off leisure travel for yourself and family members Flexible working arrangements 28 days annual leave, plus bank holidays A choice of contributory pension schemes Please note, all offers with network rail will be subject to a medical assessment and negative drugs and alcohol test."}