{"line-1":"Commercial Manager (Cardiff or Bristol)","line-2":"Location","line-3":"Cardiff, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, flexible working, and enhanced family friendly support.· 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here.We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here Yn Network Rail, rydym yn rhan o deulu mawr sy'n gwasanaethu miliynau o deithwyr a defnyddwyr cludo nwyddau ledled y DU bob dydd. Mae ein gwasanaeth yn effeithio ar filiynau o bobl ac rydym yn ymdrechu i ddod yn fwy effeithlon wrth i ni wella, cynnal a gweithredu ein rhwydwaith.Mae ein teithwyr a'n defnyddwyr cludo nwyddau wrth galon popeth a wnawn. Rydym yn helpu i gysylltu pobl â'u ffrindiau a'u teuluoedd a chael nwyddau â'u cyrchfan yn ddiogel ac yn effeithlon. Rydym yn sefydliad lle mae pobl o bwys. Pan ydych chi'n rhan o'n tîm, rydych chi o bwys i ni ac rydych chi o bwys i filiynau. Gwyliwch ein fideo i ddarganfod mwy!Mae Rhanbarth Cymru a Gorllewin yn cynnwys mwy na 2,700 milltir o reilffordd ac rydym yn gwasanaethu cymunedau a busnesau Cymru, Cwm Tafwys, gorllewin Lloegr a Phenrhyn y De -orllewin. Mae ein huchelgais i fod yn ymatebol i deithwyr a defnyddwyr cludo nwyddau yn ein gyrru bob dydd ac mae gennym ni'r pŵer i wneud y peth iawn i'r rhai sy'n defnyddio'r rhwydwaith rheilffyrdd. Rydym yn mynd ati i herio arferion anniogel ac yn cymryd cyfrifoldeb am fynd i'r afael â risgiau, datrys materion ac amddiffyn diogelwch a lles.Am ein pobl a'r broses recriwtio - rydym yn gyflogwr cynhwysol o ddewis ac rydym yn croesawu ceisiadau gan bawb! Fel gweithiwr rheilffyrdd rhwydwaith, byddwch chi'n mwynhau ystod eang o fuddion!• Teithio staff breintiedig - Gostyngiad teithio hamdden o 75% ar yr holl deithio hamdden ac mae'n cynnwys aelodau o'r teulu. • Cymhorthdal ​​o hyd at 75% ar docynnau tymor y rheilffyrdd a thymor tanddaearol os ydych chi'n teithio i weithio ar y trên. • Pecyn budd -daliadau gan gynnwys cynigion gofal iechyd, cynllun cylch i waith, aelodaeth clwb gofal iechyd gostyngedig, a chynigion a buddion gostyngedig gan gynnwys gofal plant, gofal iechyd a safle siopa ar -lein. • Rheoli cydbwysedd rhwng bywyd a gwaith yn effeithiol gyda chontract 35 awr yr wythnos, gweithio hybrid, gweithio hyblyg, a gwell cefnogaeth sy'n addas i deuluoedd. • 5 diwrnod o absenoldeb gwirfoddoli â thâl. • Pythefnos o Absenoldeb Wrth Gefn Taledig ar gyfer Cymuned y Lluoedd Arfog. • Yn Rhanbarth Cymru a Gorllewin, cewch gyfle i ymuno â Proud, ein cynllun gwobr a chydnabod lle gallwch ddweud diolch a chydnabod cydweithwyr ledled y rhanbarth sydd wedi dangos gwerthoedd ac ymddygiadau rhagorol.I ddarganfod mwy am y buddion yn Network Rail, cliciwch yma.Rydym am helpu i ddarparu rheilffordd sy'n ddiogel, yn ddibynadwy, yn fforddiadwy ac sy'n darparu gwasanaeth gwych i gwsmeriaid i bawb. I gael mwy o wybodaeth am reilffordd rhwydwaith cliciwch yma","line-8":"Brief Description","line-9":"The Wales & Western Capital Delivery team believe in the ‘One Team’ ethos. You will be working in a team that is passionate about delivering safely, efficiently and providing value for money for our passengers, train and freight operators and the taxpayer. We are embarking on an exciting delivery model for Control Period 7. Our portfolio is diverse spanning from Buildings & Civils, Enhancements, Track, Signalling, Power and Communications. The projects delivered can range from major enhancements e.g., HS2 Old Oak Common Station on the Great Western Mainline to medium sized enhancements, third party funded projects, renewals and minor works. All of these are key to keeping our railway safe and running. Our focus is on recruiting and retaining people who are key to the running of our railway. We are committed to supporting learning and development and enabling individuals to bring their whole selves to work. We are passionate about diversity and inclusion and have evidenced that a diverse team has enabled better delivery. The location can be Cardiff or Bristol. Please see document attached to this vacancy for more information on what it’s like to work in the Commercial Function of Wales & Western region! Mae Tîm Cyflenwi Cyfalaf Cymru a’r Gorllewin yn credu yn yr ethos ‘un tîm’. Byddwch yn gweithio mewn tîm sy'n angerddol am gyflawni'n ddiogel, yn effeithlon a darparu gwerth am arian i'n teithwyr, gweithredwyr trên a chludo nwyddau a'r trethdalwr. Rydym yn cychwyn ar fodel dosbarthu cyffrous ar gyfer cyfnod rheoli 7. Mae ein portffolio yn rhychwantu amrywiol o adeiladau a sifiliaid, gwelliannau, trac, signalau, pŵer a chyfathrebu. Gall y prosiectau a ddarperir amrywio o welliannau mawr e.e., HS2 Old Oak Common Station on the Great Western Mainline i welliannau maint canolig, prosiectau a ariennir gan drydydd parti, adnewyddiadau a mân weithiau. Mae'r rhain i gyd yn allweddol i gadw ein rheilffordd yn ddiogel ac yn rhedeg. Mae ein ffocws ar recriwtio a chadw pobl sy'n allweddol i redeg ein rheilffordd. Rydym wedi ymrwymo i gefnogi dysgu a datblygu a galluogi unigolion i ddod â'u hunain i weithio. Rydym yn angerddol am amrywiaeth a chynhwysiant ac wedi tystio bod tîm amrywiol wedi galluogi danfon yn well. Gall y lleoliad fod yn Gaerdydd neu Fryste. Gweler y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn swyddogaeth fasnachol Rhanbarth Cymru a Gorllewin!","line-10":"About the role (External)","line-11":"You will manage commercial post contract activities required to meet business performance and efficiency targets. You will also provide pre-contract commercial support required to procure the contracts but not the procurement process itself. You will work collaboratively with stakeholders and manage key supplier relationships, identifying best practice and liaising as required to provide an efficient, cost effective and collaborative delivery of commercial activity therefore concluding the delivery of the current control period and setting control period 7 up for success. Robust commercial / contract management is both exciting and challenging but rewarding when contracts are delivered successfully, and you will play a key role in this. Your Main Responsibilities will be to:· Support the programme and project teams with Commercial compliance.· Commercial reporting of allocation project.· Flagging and mitigating issues found through reporting.· Monitor and actively influence decision makers and contractor’s commercial behaviours, delivery and activity.· Manage and challenge assessment and valuation of contractor’s applications and processing of payment certification.· Commercial advice on project changes.· Produce applications for payment/invoices to outside clients.· Identify and advise on all commercial risk/claim events.· Provide of ad-hoc management information and analysis to promote informed decision-making.· Produce and retain appropriate commercial correspondence and contractual notices for issue in accordance with contractual conditions.· Undertake final account settlements and internal reconciliation to project close-out.· Support demonstration of efficiencies and continual improvement of estimating by undertaking cost analysis of completed projects and feedback.· Support pre post contractual procurement activities as appropriate.· Provide support to estimating resources, offering guidance and advice on project scale/scope as required.· Support the negotiation of all prices under existing contracts/framework arrangements and participate in quantitative risk assessment and value management workshops.You will ideally have· Demonstrable experience in commercially managing investment projects· Good understanding of railway / construction industry forms of contract, or in relatable industry· Good understanding of the construction/railway industry, or relatable industry· Good negotiation skills What could set you apart· Educated to degree standard in related subject· Membership of a relevant professional institute, chartered status· Significant experience of working within a generalist commercial environment· Awareness of industry issuesNot sure if you meet all the requirements? Let us decide.Byddwch yn rheoli gweithgareddau masnachol ar ôl contract sy'n ofynnol i gyrraedd targedau perfformiad busnes ac effeithlonrwydd. Byddwch hefyd yn darparu cefnogaeth fasnachol cyn-gontract sy'n ofynnol i gaffael y contractau ond nid y broses gaffael ei hun. Byddwch yn gweithio ar y cyd â rhanddeiliaid ac yn rheoli perthnasoedd allweddol i gyflenwyr, gan nodi arfer gorau a chysylltu yn ôl yr angen i ddarparu darpariaeth effeithlon, cost -effeithiol a chydweithredol o weithgaredd masnachol gan ddod i ben i gyflawni'r cyfnod rheoli cyfredol a gosod cyfnod rheoli 7 i fyny ar gyfer llwyddiant. Mae rheoli masnachol / contract cadarn yn gyffrous ac yn heriol ond yn werth chweil pan fydd contractau'n cael eu cyflwyno'n llwyddiannus, a byddwch yn chwarae rhan allweddol yn hyn.Eich prif gyfrifoldebau fydd:• Cefnogi'r rhaglen a thimau prosiect gyda chydymffurfiad masnachol.• Adrodd yn fasnachol y prosiect dyrannu.• Materion fflagio a lliniaru a geir trwy adrodd.• Monitro a dylanwadu'n weithredol ar y rhai sy'n gwneud penderfyniadau ac ymddygiadau masnachol, cyflawni a gweithgaredd y contractwr.• Rheoli a herio asesu a phrisio ceisiadau contractwr a phrosesu ardystiad talu.• Cyngor masnachol ar newidiadau i brosiectau.• Cynhyrchu ceisiadau am daliad/anfonebau i gleientiaid allanol.• Nodi a chynghori ar yr holl ddigwyddiadau risg/hawlio masnachol.• Darparu gwybodaeth a dadansoddiad rheoli ad-hoc i hyrwyddo gwneud penderfyniadau gwybodus.• Cynhyrchu a chadw gohebiaeth fasnachol briodol a hysbysiadau cytundebol i'w rhoi yn unol ag amodau cytundebol.• Ymgymerwch â setliadau cyfrif terfynol a chymod mewnol i brosiectau agos.• Cefnogi arddangos effeithlonrwydd a gwella amcangyfrif yn barhaus trwy ymgymryd â dadansoddiad costau o brosiectau ac adborth wedi'u cwblhau.• Cefnogi gweithgareddau caffael cytundebol ymlaen llaw fel y bo'n briodol.• Darparu cefnogaeth i amcangyfrif adnoddau, gan gynnig arweiniad a chyngor ar raddfa/cwmpas y prosiect yn ôl yr angen.• Cefnogi trafod yr holl brisiau o dan y contractau/trefniadau fframwaith presennol a chymryd rhan mewn gweithdai asesu risg meintiol a rheoli gwerth.Yn ddelfrydol, bydd gennych chi• Profiad amlwg mewn rheoli prosiectau buddsoddi yn fasnachol• Dealltwriaeth dda o ffurfiau contract rheilffordd / adeiladu diwydiant, neu mewn diwydiant trosglwyddadwy• Dealltwriaeth dda o'r diwydiant adeiladu/rheilffordd, neu'r diwydiant trosglwyddadwy• Sgiliau trafod daBeth allai eich gosod ar wahân• Addysgwyd i safon gradd mewn pwnc cysylltiedig• Aelodaeth o sefydliad proffesiynol perthnasol, statws siartredig• Profiad sylweddol o weithio o fewn amgylchedd masnachol cyffredinol• Ymwybyddiaeth o faterion diwydiantDdim yn siŵr a ydych chi'n cwrdd â'r holl ofynion? Gadewch inni benderfynu.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £43,588 - £49,037 per annum. Hybrid working available – 2/3 days in the office/on site (35 hours a week). Closing date: 7th December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Cyflog: £ 43,588 - £ 49,037 y flwyddyn. Gweithio hybrid ar gael - 2/3 diwrnod yn y swyddfa/ar y safle (35 awr yr wythnos). Dyddiad cau: 7fed Rhagfyr 2023. Sicrhewch eich cais i mewn cyn gynted â phosibl, efallai y byddwn yn cau'r hysbyseb cyn y dyddiad cau rhestredig os ydym yn derbyn digon o geisiadau. Ni dderbynnir ceisiadau hwyr. Cliciwch ‘Apply Now’ i wneud cais. Rydym yn gyflogwr cyfle cyfartal ac yn werth amrywiaeth. Nid ydym yn gwahaniaethu ar sail hil, crefydd, tarddiad cenedlaethol, rhyw, cyfeiriadedd rhywiol, oedran, statws priodasol, neu statws anabledd. Cliciwch yma i gael mwy o wybodaeth. Mae amrywiaeth a chynhwysiant yn fwy na geiriau gwefr yn unig i ni. Rydyn ni bob amser yn ymdrechu i sicrhau ein bod ni'n darparu amgylchedd croesawgar a diogel i bawb. Rydym yn cydnabod bod rhai grwpiau wedi'u tangynrychioli yn ein tîm ac rydym yn gweithio'n agos gyda'n rhwydweithiau amrywiaeth a chynhwysiant rhanbarthol i sicrhau ein bod yn cefnogi'r grwpiau hyn orau ag y gallwn. Mae Network Rail yn arweinydd hyderus anabledd a byddwn yn ceisio ein gorau i addasu'r broses a chynnig dewis arall rhesymol i helpu i gefnogi pobl ag anableddau i gael mynediad, cymhwyso a chyfweld am rolau. Gallwch ymweld â chwch gwenyn gyrfa Evbreak i gael cyngor ar gymorth hygyrchedd os nad ydych yn siŵr o'r opsiynau sydd ar gael. Os bydd angen unrhyw addasiadau/addasiadau rhesymol arnoch, ychwanegwch nodyn at eich cais. Mae pob cynnig o gyflogaeth yn amodol ar ôl cwblhau gwiriadau cyn cyflogi yn foddhaol. Cliciwch yma i gael mwy o wybodaeth Mae ein safon cyffuriau a alcohol wedi newid. Bydd yn ofynnol i bob darpar ymgeisydd gael a phasio prawf cyffuriau ac alcohol. Bydd eich cais yn cael ei ddiddymu os ydych chi'n cofnodi prawf positif. Bydd yr holl gyffuriau positif a chanlyniadau profion alcohol ar gyfer darpar ymgeiswyr yn cael eu dal yn ddiogel ar gronfa ddata Sentinel ac ataliad 5 mlynedd o wneud cais am rôl hanfodol diogelwch, bydd rôl sy'n gofyn am ardystiad PTS neu rôl ddiogelwch allweddol ar seilwaith a reolir gan reilffyrdd rhwydwaith yn cael ei orfodi . Mae cadw pobl yn ddiogel ar y rheilffordd wrth galon popeth a wnawn. Felly mae ymddygiad diogel yn ofyniad i weithio ar gyfer Rhwydwaith Rhwydwaith. Dylech ddangos eich ymroddiad personol i ddiogelwch ar eich cais."}