{"line-1":"Planner","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Human Resources","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Embark on a rewarding role where you'll play a crucial part in our team's success. Utilising agreed planning processes, systems, and databases, you'll support in developing detailed, fully resourced, and optimised training delivery plans for Leadership Development activity across the business. Your commitment to precision and optimisation ensures that our training initiatives are not only comprehensive but also tailored to individual needs. Join our inclusive environment where your planning expertise contributes to the growth and development of our workforce, fostering a culture of continuous learning and success for all.","line-10":"About the role (External)","line-11":"Enter key information about the role including 4-5 main day-to-day responsibilities. Think about what background the ideal candidate will have including essential skills, experience and qualifications.Job ad content is your opportunity to market the role, to attract people to be interested in the opportunity and apply. A copy and paste of the job description won't engage a diverse audience. Get creative and use plain English. Use the Speak Passenger guide. Make it short, make it clear, make it warm.Describe the job opportunity in a way that makes sense to anyone reading it. Make sure the content is accessible to everyone.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £XX range/ spot rateClosing date: xxxxxx. - Late applications will not be accepted.Click apply now to apply.This is a fixed term opportunity ending on DD-MM-YYYY. [remove if not applicable] and has the potential to become permanent. [remove if not applicable]For this role you need to live within 75/90 minutes of The Quadrant in Milton Keynes. [MK roles only! Remove if role is not based in Milton Keynes]Remote working opportunity! this role requires working in the office 2/3 days a week (amend as applicable)What does our recruitment process look like? [remove/amend if not applicable] Once you have applied, our Recruitment Specialist will look at your CV.If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment.If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}