{"line-1":"Works Delivery Co-ordinator (B&C) - Leeds Managed Station","line-2":"Location","line-3":"Leeds, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Support the Works Delivery Manager and team in the delivery of Building & Civils maintenance and project work to standards and within agreed resource levels.","line-10":"About the role (External)","line-11":"Key Accountabilities:1. Support the Works Delivery Manager(s) and team to achieve business and functional objectives and meet key performance measures.2. Support the development of work plans that enables work to be delivered safety, efficiently and compliant to standards.3. Assist in the identification of and implementation of safety, asset performance, reliability, productivity and efficiency improvement initiatives.4. Review remits and specifications for deliverability.5. Support the delivery of maintenance and project work to standards.6. Manage and coordinate of work, resource specifications, method statements and plans as required.7. Deliver work in accordance with the agreed programme.8. Provide information to update systems, databases and records.9. Support an agreed programme of staff surveillance, work quality checks and asset condition checks.Job Skills, Experience and Qualifications:Essential· Experienced in the management and coordination of projects, worksites and resources · Knowledge of relevant standards and procedures· Knowledge of other functional disciplines· Knowledge of operational railway environment· Good interpersonal, influencing, communication and organisation skills Desirable· Understanding of Civils Engineering· Understanding of Building Construction· Educated to Level 3 NVQ or equivalent· Project Management skills· Knowledge of quality, environmental, commercial, and financial procedures","line-12":"How to apply (External)","line-13":"Salary: £27,820 Closing date: 29th November 2023 - Late applications will not be accepted. Click apply now to apply. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}