{"line-1":"Project Manager","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Technical Authority","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. About the function… This role is within the Central Projects Team within the Technical Authority. This team consists of programme and project managers that are focussed on delivery and this is an integral part of the Technical Authority. We have some fantastic concepts and proposals within Technical Authority and our team’s job is to turn them into reality through clearly defined projects. This will ensure that we make a difference by realising benefits that help the front line and passengers. The Central Projects Team deliver programmes and projects that discharge the Technical Authority’s accountabilities. These are usually programmes and projects that are: • High profile - regulatory or of significant public interest • Complex - involves many different deliverables or impact on a number of corporate objectives • Longer-term - will require consistent management & momentum over a longer period of time • Multi-functional - involve other business functions or external suppliers • High-risk – significant implication if not delivered on time and to quality The programme work delivered by the team includes scoping, planning, contracting, cost forecasting, reporting, stakeholder engagement, ensuring cost control, and identifying and mitigating risk. This role will lead a number of projects within the Track, Level Crossings and Signalling Programme, we are finalising our projects for CP7, but current CP6 projects include Competency projects for Track and Signalling, the Whole Life Cost Programme, a new framework contract for the regions to purchase Data Loggers and finalising training modules for Microdrills ensuring that we make a difference by realising benefits that help our front-line staff and our passengers.","line-8":"Brief Description","line-9":"Who are we looking for? Join our dynamic team as a Project Manager and lead the way in delivering exciting projects that make a real impact! We have a fantastic Permanent opportunity based in Milton Keynes, where you'll take charge of ensuring our projects are delivered safely, on time, and within budget.","line-10":"About the role (External)","line-11":"What does the average day look like? As a Project Manager, your days will be filled with diverse and engaging tasks. You'll be responsible for overseeing project delivery, adhering to industry guidelines, and maintaining top-notch quality standards. Your expertise will be crucial in developing effective strategies and plans tailored to each specific project. Additionally, you'll work closely with clients, providing them with a professional and exceptional project management service. Here's a snapshot of what you'll be doing: · Safely deliver projects, meeting cost, time, and quality objectives, while complying with relevant regulations and standards. · Create and implement project monitoring and reporting systems, ensuring consistency and effectiveness. · Collaborate with cross-functional teams to develop supply strategies and framework contracts. · Contribute to the compilation of business plans and the production of comprehensive program/project plans. · Manage project change, risks, and contingency, providing necessary details to obtain authorization. · Foster a safe working environment, developing project safety plans and related documentation. · Fulfil CDM-related duties and identify training needs for team members, supporting their personal development. · Comply with the Investment Regulations Framework to ensure effective project execution. · Establish and lead collaborative virtual teams to drive successful change projects. What essential skills and experiences are required? The successful candidate for this role will be required to be/have: - 1. Degree or equivalent 2. Relevant successful experience in project management 3. Excellent interpersonal and communication skills 4. Detailed knowledge of safety regulations (particularly CDM) 5. Team leader capable of motivating the team 6. Commercial and financial understanding and knowledge 7. Membership of the Association for Project Management or other professional body For a full list of the key accountabilities and the essential and desirable criteria, please see the attached Network Rail job description If you're ready for an exciting challenge in a supportive and forward-thinking environment, apply today and be a part of our team driving positive change through successful project delivery. We look forward to hearing from you!","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent Location: This role is based at The Quadrant:MK. For roles based in the Quadrant:MK, you must live within 75/90 minutes of The Quadrant. Please note we have adopted hybrid working and you will be required to work in MK 2 days per week Closing date: 12th January 2024. On occasions, we may need to close the advert early based upon application volumes. Late applications will not be accepted. Interviews will be held W/C 18th January 2024 Band & Salary: Band 3B - £46,701- £52,539 What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. What does our recruitment process look like? 1. Once you have applied, our Recruitment Specialist will look at your CV. 2. If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment. 3. If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}