{"line-1":"Team Organiser - Gloucester Pway","line-2":"Location","line-3":"Exeter, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To support a senior executive or a complex team, and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Undertake general office administration duties including control of all mail, co-ordinating diaries, processing and maintaining personnel records including vulnerable assets such as mobile telephones; make necessary returns. Arrange travel, hotels and vehicles, and order and control Personal Protective Equipment (PPE) for the team.2. Organise meetings and the production, collation and dissemination of documentation for and resulting from them. Take minutes when required and follow up actions from the meeting.3. Provide a consistent telephone presence on behalf of the team delivering excellent customer service levels. Provide communications to the team, including sending messages as required.4. Maintain an efficient filing system paying particular attention to records of standing meetings, statutory records and authorisations.5. Utilise financial and procurement systems and act as Local Purchasing Agent (where directed) by ordering stationery and other office consumables as required.6. Report team problems e.g. IT and office facilities and monitor response.7. Undertake administrative tasks as directed including technical literature searches for the team.8. Undertake the role in a way that is consistent with, and reinforces, Network Rail’s values.Job Skills, Experience and Qualifications: Essential· Ability to multi task· Experience in appropriate IT packages· Good time manager · Strong organisation skills· Good communication skills (verbal and written) including excellent telephone manner· Experience of working with a team. Desirable· Sound railway background and knowledge of railway geography · Recognised qualification in keyboard associated skills and office management techniques· Knowledge and experience of records management","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: Circa £23,000 per annumClosing date: 7th December 2023 - Late applications will not be acceptedClick apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}