{"line-1":"CAD Technician","line-2":"Location","line-3":"Stockport, GB","line-4":"Department Name","line-5":"AY Project Manager, Internal Design Team, Direct (850007) G5","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You will be part of the North West & Central Region (NW&C) which consist of three routes – North West, Central and West Coast South – and a regional team supporting Regional Major Programmes & Professional services.","line-8":"Brief Description","line-9":"The Internal Design Team (IDT) is expanding to meet demand brought about by our continued success in project delivery and is looking for talented people from all backgrounds to join our journey and move us forward. Our team deals with a wide range of engineering projects such as structural repair works, retaining structures, sea defences, bridge refurbishments and geotechnical works such as embankment regrades and slopes analysis. We also operate on large scale schemes such as our award-winning work on Liverpool High Neck Tunnel and our refurbishments of Ribblehead and Sankey viaduct to name but a few. We are again happy to be looking for another candidate to join our diversely capable team for a bright and fulfilling career in civil engineering with a focus on safety and look forward to hearing from you. As a CAD technician for IDT your duties will include ‘red-line’ mark-up drawing amendments, on-site scanning and clerical tasks such as assisting the team with bookings and submitting time sheets. As such experience in Excel is highly advantageous with experience in Access desirable. This would be an excellent opportunity for a recent graduate with possibilities for future development.","line-10":"About the role (External)","line-11":"CAD projects are performed within the Autodesk suite with our projects completed in AutoCAD and our 3D data converted within Autodesk RECAP. Knowledge of other CAD programs such as MicroStation, FreeCAD, Solidworks, Blender and sketchup though not directly applicable is appreciated within our CAD environment. 1. Manage existing and incoming CAD data, external drawing requests and photographic records both in hard and soft formats in a structured manner, to manage the availability of latest revision data, with superseded data appropriately archived. 2. Prepare scheme diagrams, conceptual and detailed plans, for inclusion in reports, contract documentation and presentation to external bodies. 3. Provide professional advice on data transfer standards and systems, for inclusion in contract documentation. 4. Assist CAD Manager in circulation of the Project’s CAD Procedures to suppliers, consultants and contractors In order to be successful in this role, we would like you to have/to be: · Good CAD skills and engineering knowledge. · Relevant successful experience using MicroStation or AutoCAD. · Good communication skills. We would also like but it isn’t crucial to have/to be: · Knowledge of OS Digital Mapping formats. · Railway experience. · Good desk top software skills.","line-12":"How to apply (External)","line-13":"Salary: £27,820 - £30,000 depending on experience. Closing date: Wednesday 27 December 2023. Late applications will not be accepted. Click apply now to apply. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. If successful at interview you will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}