{"line-1":"Systems Support Manager (Asset Management)","line-2":"Location","line-3":"Swindon, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, and enhanced family friendly support. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"Lead and direct system and database management processes within asset management. Provide direction and support on the use of the systems and databases and all aspects of asset data management to provide accurate and current data quality and systems management. Undertake the management and maintenance of geospatial asset data; provide technical expertise and a specialist analysis service to internal and external customers of geospatial asset information.","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:1. Manage, coordinate, and validate the upgrade, update, maintenance and utilisation of all systems and databases within asset management. 2. Provide direction and support including briefings on the use of systems and databases within asset management.3. Manage the collation of information from asset management and third parties such that systems and databases are updated to provide accurate information at all times.4. Manage data quality within systems and databases to meet corporate requirements.5. Manage the integrated risk management process. If required, maintain, and update the Active Risk Manager Database.6. Resolve issues that adversely affect the effective performance of systems and databases.7. Monitor, audit and report on the accuracy, receipt and updating of data.8. Provide information to support delivery of business plans and improvement initiatives and project works.9. Provide analysis and management reports as required to support asset management. Make recommendations where management action is required.10. Accurately update systems, databases and records as required including the Hazard Directory. You will ideally have· Good knowledge of maintenance systems and databases· Good analytical skills· Good interpersonal, communication and organisation skills What could set you apart· Knowledge of asset management, maintenance delivery processes and techniques· Knowledge of coaching techniquesNot sure if you meet all the requirements? Let us decide.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582 to £40,029 per annum. Closing date: 5th January 2024. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}