{"line-1":"Senior Project Engineer (CDE) [Structures/Geotech]","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"North Portfolio offers a unique opportunity to be involved in of all aspects of Rail project delivery on the Eastern Region comprising of the East Coast Mainline, North & East, East Midlands and Anglia routes. Whether delivering renewals with our route colleagues, minor enhancements with our sponsorship colleagues, or 3rd party funded interventions, we deliver projects across a range of disciplines including Signalling, Civil Engineering, Power & Distribution and Telecoms. Delivering projects across all project lifecycle stages, Portfolio North gives a unique development opportunity no matter your current level of experience.The Portfolio North team is made up 130 dedicated professionals delivering a portfolio of projects worth c£1.0bn. Within this the Building & Civils team has a turnover of c£450m over CP7.In Portfolio North we understand the value of developing our people, and our track record for development speaks for itself with almost 50% of our people having been promoted internally. Whatever level you join our team at, there will always be the opportunity to grow and develop in Portfolio North.As well as trusting and developing our people, in Portfolio North our values include supporting the wellbeing of our people, creating an inclusive and respectful environment whilst encouraging creativity, engaging openly and honestly with ourselves and our partners, all whilst driving a positive and safe culture at all times. At the very soul of Portfolio North is enjoying what we do, celebrating our successes, and continual learning.We are looking for a Senior Project Engineer to provide client-side engineering leadership to projects from early development (PACE Phase 1) to delivery and handback (PACE Phase 3/4) within the North and East and East Coast Routes as part of a small team of other client-side engineers. Working within the client team of Portfolio Managers, Commercial Managers and Construction Assurance Specialists and many engineering and operational specialists, the role is required to provide technical leadership and assurance. The role will manage a team of Buildings/Civils Engineers to deliver the Project Engineering roles across a portfolio of works as well as individually deliver the Project Engineer role for specific projects. Projects are delivered collaboratively with our funders and suppliers and a key part of the role will involve the early definition of the technical requirements and alignment to programme and budget.","line-10":"About the role (External)","line-11":"For this role we are looking for Buildings, Civils, Structures or Geotech experience from any relevant sectors that can be transferable to the railway environment. Typical schemes in the portfolio cover bridges, stations and earthworks and scope ranges from refurbishment to renewal and minor enhancements. The team also support the Signalling and Power teams with the civils aspects of these projects. We are looking for someone who can lead the building/civils aspects and can bring together all the technical specialists within the railway environment to provide high value, minimum cost solutions which meet the essential needs of stakeholders. The role of the railway is changing and the needs of stakeholders, clients and taxpayers is changing. As a client-side engineering leader, you have a unique opportunity to make these changes happen. This may include reducing embedded carbon, improving weather resilience, moving to a digital railway, embracing new technologies, attracting more leisure travellers, providing for aging customers, reducing the timescales needed to deliver railway projects as part of Project SPEED or demonstrating cost efficiency through the Minimum Viable Product initiatives. Key Accountabilities. As the Senior Project Engineer you will lead and manage a team of Project Engineers. As the engineering lead (Designated Project Engineer) on a project or projects, you will be accountable for ensuring the technical aspects of the project are met. This includes: · Agreeing technical outputs with sponsors and stakeholders, · Technical discipline leadership, · Monitoring competence of contractors’ design, construction and specialist personnel, · Identify and share best practice across the various project teams, · Carry out the duties of designated project engineer (DPE) for specific projects, · Appling engineering controls and procedures to all projects using relevant techniques and procedures of quantified and qualitative risk assessment and HAZOP analysis to all projects including in accordance with Network Rail Environmental Policy, · Implementing Network Rail systems and procedures monitoring all projects for compliance with Railway Group and Network Rail Company standards and project control procedures and construction design management (CDM) regulations. As part of those duties: · You will work with asset managers and internal specialists to provide clarify on requirements and gain endorsement of proposals, · You will provide non-technical updates on key engineering issues to internal and external stakeholders, · You will work with project delivery teams to advise on risks and opportunities, · You will work with framework contractors and funders to ensure concepts are deliverable, · You will ensure projects have the necessary safety and approval documents in place so projects can progress seamlessly from a single concept through to delivery. Essential Criteria. In addition to those listed in the Job Description, this role requires: · A desire to help internal and external clients to specify affordable outputs which can be delivered within their timescales. This will require strong communication skills including an ability to translate non-technical aspirations into clear, unambiguous engineering requirements, · To respectfully challenge where you suspect stakeholders may be asking for things which are above and beyond the core requirements. · To drive through new initiatives even when established practices are well engrained. · Successful relevant experience in engineering disciplines, ideally with involvement in construction and design projects across multi discipline areas. · Appreciation of Inclusive Design and CDM regulations. It’s desirable if you have it to help give you context to the role: - · Membership of a relevant professional body with chartered status and/or educated to degree level. · Knowledge and experience of Railway Interoperable Regulations and Common Safety Method RA and their application in a railway environment, or equivalent risk assessment processes. · Knowledge of structuring safety cases in support of projects. · An appreciation of environmental issues in engineering works. · Project safety management experience · A good working knowledge of the railway as a system and internal technical interfaces is essential.","line-12":"How to apply (External)","line-13":"Salary: £55,596 - £62,546Closing date: 3rd December 2023. - Late applications will not be accepted. This role has also been advertised externallyInterviews will take place the week commencing 11th DecemberClick apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more informationSalary: £55,596 - £62,546Closing date: 3rd December 2023. - Late applications will not be accepted. This role has also been advertised externallyInterviews will take place the week commencing 11th DecemberClick apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information","line-14":"Salary: £55,596 - £62,546Closing date: 3rd December 2023. - Late applications will not be accepted. This role has also been advertised externallyInterviews will take place the week commencing 11th DecemberClick apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}