{"line-1":"Capital Programme Planning Assurance Manager","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"eastern region","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Vacancy: Capital Programme Planning Assurance ManagerLocation: London Stratford PlaceSalary: £46,701 - £52,538Role Type: PermanentEmployees will be entitled to a 75% discount off leisure travel this includes all off peak and super off peak tickets Network Rail Benefits - To find out about what benefits we offer, click here - At Network rail you will have a clear development path with access to training and additional qualifications. You can enjoy a range of employee benefits, such as; up to 28 days annual leave, 75% of Leisure Travel and Season Ticket for travel, a range of pension options, flexible and agile working arrangements, healthcare, discounts on shopping, gym memberships and much more. Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Network Rail have an opportunity for the right candidate to become part of our Capital Delivery Eastern team as a Capital Programme Planning Assurance Manager This is an exciting unique opportunity for a committed, highly motivated & enthusiastic individual to join our Business Intelligence Planning and Controls team. As Planning Assurance Manager your role will be to manage the supply chain programme assurance and business needs to ensure successful delivery of our projects. You will lead planning assurance activities on behalf of the project team(s) for Major Projects and Programmes across Anglia - including Beaulieu New Station and Cambridge South Infrastructure Enhancement (CSIE). You will ensure programmes comply with company and legislation standards and are compliant with Project Acceleration in a Controlled Environment (PACE). This full time role is based in our Stratford office, with a requirement to work out of this location three days per week minimum.","line-10":"About the role (External)","line-11":"Day to day, your activities will include:Leading the portfolio’s assurance planning function monitoring supply chain compliance to portfolio requirements and Network Rail standards including Project Acceleration in a Controlled Environment (PACE) so they meet the required standards and contractual obligationsDeveloping and providing guidance on the development of project schedules in line with company requirements to support robust delivery programmes and reportable metrics.Developing and disseminating lessons learnt on schedule management and best practice to support a continuous improvement culture.Leading the portfolio’s assurance support to the procurement and selection process as part of the supply chain selection criteriaImplementing the measurement and monitoring of assurance activities across the supply chain programme / schedule submissions to provide confidence in deliverability.Providing quantified schedule output assurance metrics to the project(s) teams to enable them to discharge their responsibilities.Providing quantified schedule output assurance metrics to enable supply chain performance measurement(s) to be tracked, available and comparable across the portfolio.Leading the interface with delivery partners on technical planning queries so resolutions are quickly found, and any delays are mitigated.Developing and maintaining Network Rail programmes in Primavera P6 as necessary to support delivery and provide project or portfolio teams with a detailed schedule of sequenced activities.Directing the provision of Earned Value to meet company standards and provide deliverability indicators for the project team.Using Acumen FUSE to compile FUSE metrics to report schedule health checks on project plans.We're looking for someone who can demonstrate the following essential criteria:Relevant successful experience in the planning and delivery of construction/engineering projects.Relevant successful experience in using a number of project management scheduling tools & techniques including Primavera P6 and Acumen Fuse.Microsoft ExcelDemonstrable skills in initiating and building positive working relationships with customers, their team and stakeholders. Demonstrable experience of being output driven, prioritising work to deliver on time and taking ownership in their role Strong analytical skills with a methodical approach & attention to detailStrong communication skills – ability to work closely & collaboratively and establish relationships with people from all levels and departments of the businessSkills in initiating and building positive working relationships.Ability to display and communicate work clearlyProactive and capable of using own initiativeInquisitive, curious, and a desire to explore and investigate large datasetsDesirable Criteria Knowledge of MS Power Bi & Power Pivots","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £46,701 - £52,538Closing date: 2nd January 2024. - Late applications will not be accepted. Interviews will take place the week commencing 8th January 2024Click apply now to apply.Remote working opportunity! this role requires working in the office 3 days a week Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}