{"line-1":"Information Co-ordinator - York Rail Operating Centre","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To act as the focal point within the Control for the provision of timely and relevant information about the network for internal / external parties and customers. Continuously maintain and update relevant information systems.","line-10":"About the role (External)","line-11":"Key Accountabilities:1. Collate and disseminate information to / from Network Rail Control to TOC / FOC Controls as required, to include providing real time train information to customers, both internal and external, through means such as TYRELL messaging and email messaging.2. Disseminate accurate, concise and timely information on the OIS screens, in accordance with Network Rail company standards and statutory requirements, to passengers, Train Operator staff, Network Rail staff and other railway Group members, relating to incidents.3. Input into a daily log of all notable actions, using the available systems in accordance with the relevant company standards and instructions. 4. Work closely with the Route Control Manager in the management of information flows within / out with the control organisation.5. Produce reports and supporting data to agreed specifications and co-ordinate the provision of other necessary Control information to defined timescales. 6. Assist the Incident Controller (Lead Operations Controller) in creating the “prioritised plan” in line with the PIDD ACOP requirements.7. Assist the Train Running Controller in the production & dissemination of an amended train plan during disruptive events. 8. Support the Control Team during manning of Gold Command in the collation of minutes and discussions held during incidents, and also during normal incident management conference calls. Job Skills, Experience and Qualifications: Essential· Good Communicator · Good geographical knowledge of applicable Route· Knowledge and demonstrable experience of control procedures and instructions· Demonstrable skill in the use of Microsoft Office package and Control specific software e.g TRUST, CCIL, TRUST DA, Tyrell or other communications system· Knowledge of Train Operating Companies within the route· Good team working skills and ability to make objective decisions· Able to influence others and work under pressure Desirable· Appreciation of signalling, p’way and electrification disciplines· Geographical knowledge of adjoining Routes· Understanding of commercial/ business picture within Network Rail and TOC’s","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Band 5b - Salary Circa £27,820Closing date: 20th December 2023 Late applications will not be accepted.Click ‘apply now’ or click here for details of how to apply.We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more informationWe positively embrace flexible working recognising that employees may wish to balance work and family/home life.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}