{"line-1":"Assurance Specialist (Licensing)","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"technical authority","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. About the function… This role sits within the Technical Authority. The Technical Authority, led by the group safety and engineering director, is a vitally important part of the freight and passenger business. We define and discharge network accountabilities for policy, strategy and the control framework (including assurance against it) in safety, engineering, asset management, security, health, information management, environment and sustainability.","line-8":"Brief Description","line-9":"Who are we looking for? We are looking for an Assurance Specialist (Licensing) to fill a Permanent opportunity based in Milton Keynes, but with national travel and some evening/weekend working to provide industry assurance to the Client and technical authorities. Other locations may be considered on a case-by-case basis. Direct improvements of suppliers and Network Rail teams to drive performance including behavioural safety culture on site. Lead audits to determine compliance with CDM Regulations and Company Standards.","line-10":"About the role (External)","line-11":"What does the average day look like? The role of Assurance Specialist (Licensing) is a multifaceted role in that you will undertake various duties including (but not limited to): · Lead licence applications and specialist onsite audits to comply with CDM Regulations, Sentinel Scheme Rules, Safe Systems of Work Planning and other relevant company standards. · Provide expert support, direction and guidance to all business units and suppliers regarding CDM Regulations and Principal Contractor Duties to drive performance including behavioural safety culture on site. · Provide industry assurance for the technical authorities and Client (as defined in CDM) using the Licensing Framework. · Independently identify non-compliance and areas of risk requiring immediate attention by undertaking reviews. Influencing senior stakeholders (both internally and in external organisations) in the development of associated improvement plans to resolve deficiencies. · Managing supplier performance by independently review and evaluate reports and emerging data to assess the performance of internal and external Principal Contractors creating a risk profile and determining the appropriate intervention / audit measure. · Fulfil the Principal Contractor assurance requirements as defined by the Health and Safety Management System. · Direct improvements in site activities by promoting collaborative behavioural based safety, safety culture development, the use of Life Saving Rules and the sharing of other good practice. · Support the Technical Authority audit team by leading functional audits to assess compliance against Network Rail standards and processes. What essential skills and experiences are required? The successful candidate for this role will be required to be/have: - 1. Membership of a relevant professional body (eg IQA, IRCA) 2. Lead auditor qualified 3. NEBOSH Construction Certificate qualification and proven expert knowledge of CDM 4. Good understanding of risk assessment/loss control tools and techniques 5. Good understanding of Environmental requirements (IEMA qualified) on construction sites 6. Excellent report writing and presentation skills 7. Exceptional interpersonal skills, possessing the ability to influence both internal and external stakeholders up to and including Exec level For a full list of the key accountabilities and essential/desirable criteria, please click apply and you will be taken to the network rail external site where you can see the attached Network Rail Job Description.","line-12":"How to apply (External)","line-13":"A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. Duration: Permanent Location: This role is based at The Quadrant:MK. For roles based in the Quadrant:MK, you must live within 90 minutes of The Quadrant. Other locations may be considered on a case-by-case basis. Closing date: 2nd January 2024. On occasions, we may need to close the advert early based upon application volumes. Late applications will not be accepted. Interviews will be held in early January 2024 Band & Salary: Band 4B - £35,582 - £44,477 dependent upon experience What can we offer you in return? We have a range of benefits including: · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · My Benefits – our discounted online shopping site · Flexible and family friendly policies and practices · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training, development and employee assistance programme available · To learn about the benefits we offer please here. What does our recruitment process look like? 1. Once you have applied, our Recruitment Specialist will look at your CV. 2. If your experience matches what we're looking for, you'll be invited to an interview /or complete a first interview using xxx a video interviewing platform, you can complete your interview anytime that works for you. /or complete an assessment. 3. If you ace your video interview/or assessment, you'll be invited to face to face interview with the hiring manager. About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.’ Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact iRecSupport@networkrail.co.uk and have your IRC number ready as this will be required. As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}