{"line-1":"Senior Commercial Manager - C&P","line-2":"Location","line-3":"Leeds, GB","line-4":"Department Name","line-5":"IN TRU - Central Delivery (457330) G2","line-6":"About Network Rail","line-7":"***All applications, Internal and External will need to be made via Tribepad. Any applications made in Oracle unfortunately will not be considered. Please apply via: https://careershub.networkrail.co.uk/members/?j=2591***Key InformationRole: Senior Commercial Manager (2 roles available)Salary: £55,596 per annum to £62,546 per annumLocation: LeedsContract Type: Permanent28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak tickets. Employees will also be entitled to 75% discount on season tickets. Network Rail Benefits – To find out about what benefits we offer, click here🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To manage the post contract commercial contract management and support pre-contract activity of all frameworks and contracts related to the programme of works.This is a fantastic opportunity for an experienced Commercial Manager who has extensive experience on large scale complex contracts. You’ll need extensive contract management experience coupled with strong leadership skills that can motivate and inspire a diverse team. You’ll be a great team manager, but you will also need a head for detail and be commercially astute in order to drive this part of our business forward. As an Senior Commercial Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have an interesting and varied role, providing commercial support as required in accordance with established Network Rail policy.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are: 1. Establish and implement appropriate commercial strategies including effective project cost management and provide feedback into subsequent procurement processes. 2. Provide commercial management of framework agreements and supporting contracts leading the commercial review of contractor delivery, attending valuation and progress meetings as necessary. 3. Initiate estimating and risk and value management of projects in a timely manner during the project life-cycle, recommending appropriate mitigating actions on commercial/risk events at the earliest opportunity. 4. Lead the negotiation of all prices under existing contracts/framework agreements (including the negotiation of target costs) and fully participate in the associated Quantitative Risk Assessment and Value Management Workshops. 5. Monitor and manage all project reporting such that it is accurately maintained and recorded in accordance with company reporting systems. Explain all variances to outturns, period forecasts, AFCs and budget/authority to Commercial Director, proposing mitigating actions at the earliest opportunity. 6. Lead and deploy the commercial team in the management of all live projects ensuring they are adequately resourced from a commercial perspective. 7. Provide pro-active expertise, advice and governance on all contract/scope changes in accordance with change control systems, recommending or authorising appropriate action within delegated authority and progressing the timely resolution of contract variations. 8. Manage all commercial correspondence and contractual notices issued in accordance with contractual conditions to confirm whether Network Rail’s contractual position is clearly defined. 9. Identify emerging problems, report contractual claims and support in the management and resolution of legal and/or commercial disputes in conjunction with Functional management as appropriate. 10. Establish appropriate compliance controls and audit regimes to achieve adherence to Network Rail's relevant procedures, Group and company standards. 11. Lead the final account settlements on all projects to manage close out as per the project authority, project plan and within agreed timescales. Monitor all multi-year framework agreements, to agreement and reconciled annual accounts within 6 months of each year-end. 12. Support demonstration of efficiencies and continual improvement of estimating by undertaking cost analysis of completed projects and feedback as per Cost Allocation Feedback process. 13. Support with pre and post contract procurement activities as appropriate acting as role model for commercial staff, providing coaching and development as appropriate. We need you to have: · Knowledge of railway and construction industry conditions of contract · Educated to degree level or equivalent and professional qualification · Experienced negotiator · Experience of resolution of construction contract disputes · 5 years’ relevant railway and/or construction experience · Knowledge of railway commercial contract management It would be advantageous if you have: · Experience of managing and developing a team of staff · Good communication skills both written and oral · Experience of contractors accounts","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } ***All applications, Internal and External will need to be made via Tribepad. Any applications made in Oracle unfortunately will not be considered. Please apply via: https://careershub.networkrail.co.uk/members/?j=2591***We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. Salary: starting at £55,596 to £62,546 per annum. Closing date: 20th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}