{"line-1":"Senior Arboriculturist - Baglan","line-2":"Location","line-3":"Baglan, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 3 friends and family to use across the GWR network · Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, flexible working, flexible leave, and enhanced family friendly support. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here.We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here Yn Network Rail, rydym yn rhan o deulu mawr sy'n gwasanaethu miliynau o deithwyr a defnyddwyr cludo nwyddau ledled y DU bob dydd. Mae ein gwasanaeth yn effeithio ar filiynau o bobl ac rydym yn ymdrechu i ddod yn fwy effeithlon wrth i ni wella, cynnal a gweithredu ein rhwydwaith. Mae ein teithwyr a'n defnyddwyr cludo nwyddau wrth galon popeth a wnawn. Rydym yn helpu i gysylltu pobl â'u ffrindiau a'u teuluoedd a chael nwyddau â'u cyrchfan yn ddiogel ac yn effeithlon. Rydym yn sefydliad lle mae pobl o bwys. Pan ydych chi'n rhan o'n tîm, rydych chi o bwys i ni, ac rydych chi o bwys i filiynau. Gwyliwch ein fideo i ddarganfod mwy! Mae Rhanbarth Cymru a Gorllewin yn cynnwys mwy na 2,700 milltir o reilffordd ac rydym yn gwasanaethu cymunedau a busnesau Cymru, Cwm Tafwys, gorllewin Lloegr, a Phenrhyn y De -orllewin. Mae ein huchelgais i fod yn ymatebol i deithwyr a defnyddwyr cludo nwyddau yn ein gyrru bob dydd ac mae gennym ni'r pŵer i wneud y peth iawn i'r rhai sy'n defnyddio'r rhwydwaith rheilffyrdd. Rydym yn mynd ati i herio arferion anniogel ac yn cymryd cyfrifoldeb am fynd i'r afael â risgiau, datrys materion, ac amddiffyn diogelwch a lles. Am ein pobl a'r broses recriwtio - rydym yn gyflogwr cynhwysol o ddewis ac rydym yn croesawu ceisiadau gan bawb! Fel gweithiwr rheilffyrdd rhwydwaith, byddwch chi'n mwynhau ystod eang o fuddion! • Teithio staff breintiedig - Gostyngiad teithio hamdden o 75% ar yr holl deithio hamdden ac mae'n cynnwys aelodau o'r teulu. • Cymhorthdal ​​o hyd at 75% ar docynnau tymor y rheilffyrdd a thymor tanddaearol os ydych chi'n teithio i weithio ar y trên. • Cynghrair Tocynnau GWR - Gostyngiad Trwy'r Tocynnau Trwy'r Dydd i chi a hyd at 3 ffrind a theulu i'w defnyddio ar draws y rhwydwaith GWR • Pecyn budd -daliadau gan gynnwys cynigion gofal iechyd, cynllun cylch i waith, aelodaeth clwb gofal iechyd gostyngedig, a chynigion a buddion gostyngedig gan gynnwys gofal plant, gofal iechyd a safle siopa ar -lein. • ystod o gynlluniau pensiwn i ddewis ohonynt • Rheoli cydbwysedd rhwng bywyd a gwaith yn effeithiol gyda chontract 35 awr yr wythnos, gweithio hybrid, gweithio hyblyg, absenoldeb hyblyg, a gwell cefnogaeth sy'n addas i deuluoedd. • 5 diwrnod o absenoldeb gwirfoddoli â thâl. • Pythefnos o Absenoldeb Wrth Gefn Taledig ar gyfer Cymuned y Lluoedd Arfog. • Yn Rhanbarth Cymru a Gorllewin, cewch gyfle i ymuno â Proud, ein cynllun gwobr a chydnabod lle gallwch ddweud diolch a chydnabod cydweithwyr ledled y rhanbarth sydd wedi dangos gwerthoedd ac ymddygiadau rhagorol. I ddarganfod mwy am y buddion yn Network Rail, cliciwch yma. Rydym am helpu i ddarparu rheilffordd sy'n ddiogel, yn ddibynadwy, yn fforddiadwy ac sy'n darparu gwasanaeth gwych i gwsmeriaid i bawb. I gael mwy o wybodaeth am reilffordd rhwydwaith cliciwch yma","line-8":"Brief Description","line-9":"You will lead the provision of Arboricultural expertise to Works Delivery and / or Maintenance teams and provide support and guidance to integrate the Network Rail Environment Policy and environment management systems to deliver legislative compliant projects and to contribute to continuous improvement in environment management. Byddwch yn arwain y ddarpariaeth o arbenigedd ceunell i dimau cyflawni a / neu gynnal a chadw gwaith ac yn darparu cefnogaeth ac arweiniad i integreiddio systemau polisi a rheolaeth yr amgylchedd rheilffordd y rhwydwaith i ddarparu prosiectau sy'n cydymffurfio â deddfwriaeth ac i gyfrannu at welliant parhaus wrth reoli'r amgylchedd.","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:· Lead and direct a team of Arborists to undertake a range of railway infrastructure arboriculture projects.· Oversee the specialist ecological advice and guidance to site managers, engineers, planners and others associated with the undertaking and completion of surveys given by the Arboriculturists.· Liaise with senior managers to establish and programme the remit for the route national tree survey and database.· Lead the provision of regular project updates and deliver progress reports including, risks and issues, to the relevant project / programme management team.· Write clear, concise surveys, map target notes, and have the ability to compile vegetation management scoping documents in line with the relevant Network Rail standards and suitable for the Contracts & Procurement tendering purposes.· Liaise with the Environmental Specialist team on project surveys and agree appropriate mitigation strategies to comply with current legislation.· Direct the completion of data analysis from survey results to time lag works.· Lead the liaison process for vegetation removal with statutory bodies, local authorities and third parties.· Support the production of periodic business reporting You will ideally have · Experience in delivering projects to a specified timescales and within agreed budget parameters.· Experience in managing teams to deliver within prescribed timescales.· Experience in interpreting and presenting gathered survey data and delivering Arboriculture reports that fulfil the varied remits.· Knowledge of rail maintenance delivery process and techniques for vegetation removal· Good interpersonal, influencing, communication and organisation skills and be a task orientated leader.· Comprehensive field experience· A relevant qualification in arboriculture i.e. National Certificate of Arboriculture or Royal Forestry Society Diploma or Level 3 City & Guilds· In-depth experience of Arboricultural practice within the railway environment is essential.· Demonstrable knowledge of the identification and implications of structural weakness, decay, pest diseases and the effects of tree root systems on rail infrastructure and adjoining land· Working knowledge of CDM Regulations· Railway competencies such as COSS/IWA or assessed as medically fit to carry out these duties. What could set you apart · Knowledge and experience of operational railway environment· Knowledge of ISO 14001 Environmental Management Standard· Membership of a relevant professional body· Experience attending client meetings and working with multi-disciplinary teams.· Full UK driving licence.· A good working knowledge of Network Rail IT systems and mapping tools Not sure if you meet all the requirements? Let us decide. Eich prif gyfrifoldebau fydd:• Arwain a chyfarwyddo tîm o goedwyr i ymgymryd ag ystod o brosiectau cawodydd seilwaith rheilffordd.• Goruchwylio'r cyngor a'r arweiniad ecolegol arbenigol i reolwyr safle, peirianwyr, cynllunwyr ac eraill sy'n gysylltiedig ag ymgymryd a chwblhau arolygon a roddwyd gan yr addurno.• Cysylltu ag uwch reolwyr i sefydlu a rhaglennu'r cylch gwaith ar gyfer yr Arolwg Coed Cenedlaethol a chronfa ddata.• Arwain darparu diweddariadau prosiectau rheolaidd a chyflawni adroddiadau cynnydd gan gynnwys, risgiau a materion, i'r tîm rheoli prosiect / rhaglenni perthnasol.• Ysgrifennu arolygon clir, cryno, nodiadau targed map, a bod â'r gallu i lunio dogfennau cwmpasu rheoli llystyfiant yn unol â safonau rheilffyrdd rhwydwaith perthnasol ac sy'n addas ar gyfer y dibenion tendro contractau a chaffael.• Cysylltu â'r Tîm Arbenigol Amgylcheddol ar arolygon prosiect a chytuno ar strategaethau lliniaru priodol i gydymffurfio â'r ddeddfwriaeth gyfredol.• Cyfeirio cwblhau dadansoddiad data o ganlyniadau'r arolwg i waith oedi amser.• Arwain y broses gyswllt ar gyfer tynnu llystyfiant gyda chyrff statudol, awdurdodau lleol a thrydydd partïon.• Cefnogi cynhyrchu adroddiadau busnes cyfnodolYn ddelfrydol, bydd gennych chi• Profiad o gyflawni prosiectau i amserlenni penodol ac o fewn paramedrau cyllideb y cytunwyd arnynt.• Profiad o reoli timau i gyflawni o fewn amserlenni rhagnodedig.• Profiad o ddehongli a chyflwyno data arolwg a gasglwyd a darparu adroddiadau coedyddiaeth sy'n cyflawni'r cylchoedd amrywiol.• Gwybodaeth am broses a thechnegau cyflenwi cynnal a chadw rheilffyrdd ar gyfer tynnu llystyfiant• Sgiliau rhyngbersonol da, dylanwadu, cyfathrebu a threfnu a bod yn arweinydd sy'n canolbwyntio ar dasgau.• Profiad maes cynhwysfawr• Cymhwyster perthnasol mewn coedyddiaeth h.y. Diploma Tystysgrif Genedlaethol Coediogaeth neu Gymdeithas Coedwigaeth Frenhinol neu Ddinas ac Urdd Lefel 3• Mae profiad manwl o ymarfer ceunant yn yr amgylchedd rheilffordd yn hanfodol.• Gwybodaeth amlwg o adnabod a goblygiadau gwendid strwythurol, pydredd, clefydau plâu ac effeithiau systemau gwreiddiau coed ar seilwaith rheilffyrdd a thir cyfagos• Gwybodaeth weithio o reoliadau CDMBeth allai eich gosod ar wahân• Gwybodaeth a phrofiad o amgylchedd rheilffordd gweithredol• Gwybodaeth am Safon Rheoli Amgylcheddol ISO 14001• Aelodaeth o gorff proffesiynol perthnasol• Profiad o fynychu cyfarfodydd cleientiaid a gweithio gyda thimau amlddisgyblaethol.• Trwydded yrru lawn y DU.• Gwybodaeth weithredol dda o systemau TG rheilffordd rhwydwaith ac offer mapioDdim yn siŵr a ydych chi'n cwrdd â'r holl ofynion? Gadewch inni benderfynu.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: This role is a band 3B, £46,701 - £52,538 per annum. 35 hours a week. This will be some nights and weekend working. On site and office/hybrid. Closing date: 26 December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Cyflog: Mae'r rôl hon yn fand 3B, £ 46,701 - £ 52,538 y flwyddyn. 35 awr yr wythnos. Bydd hwn yn gyfuniad o nosweithiau, gweithio yn ystod yr wythnos a phenwythnosau. Ar y safle a'r swyddfa/hybrid. Dyddiad cau: 26 Rhagfyr 2023. Sicrhewch eich cais i mewn cyn gynted â phosibl, efallai y byddwn yn cau'r hysbyseb cyn y dyddiad cau rhestredig os ydym yn derbyn digon o geisiadau. Ni dderbynnir ceisiadau hwyr. Cliciwch ‘Apply Now’ i wneud cais. Rydym yn gyflogwr cyfle cyfartal ac yn werth amrywiaeth. Nid ydym yn gwahaniaethu ar sail hil, crefydd, tarddiad cenedlaethol, rhyw, cyfeiriadedd rhywiol, oedran, statws priodasol, neu statws anabledd. Cliciwch yma i gael mwy o wybodaeth. Mae amrywiaeth a chynhwysiant yn fwy na geiriau gwefr yn unig i ni. Rydyn ni bob amser yn ymdrechu i sicrhau ein bod ni'n darparu amgylchedd croesawgar a diogel i bawb. Rydym yn cydnabod bod rhai grwpiau wedi'u tangynrychioli yn ein tîm ac rydym yn gweithio'n agos gyda'n rhwydweithiau amrywiaeth a chynhwysiant rhanbarthol i sicrhau ein bod yn cefnogi'r grwpiau hyn orau ag y gallwn. Rydym yn gweithio ar y cyd â'r tîm ymasiad diwylliannol. Os hoffech gael cefnogaeth gyda'ch cais neu'ch cyfweliad, cysylltwch â Wales&WesternCulturalfusion@networkrail.co.uk neu ewch i'r dudalen Cyswllt: Cymru a Gorllewin Diwylliannol Fusion (SharePoint.com). Am yr holl gefnogaeth arall, cysylltwch â'ch partner busnes AD. Mae Network Rail yn arweinydd hyderus anabledd a byddwn yn ceisio ein gorau i addasu'r broses a chynnig dewis arall rhesymol i helpu i gefnogi pobl ag anableddau i gael mynediad, cymhwyso a chyfweld am rolau. Gallwch ymweld â chwch gwenyn gyrfa Evbreak i gael cyngor ar gymorth hygyrchedd os nad ydych yn siŵr o'r opsiynau sydd ar gael. Os bydd angen unrhyw addasiadau/addasiadau rhesymol arnoch, ychwanegwch nodyn at eich cais. Mae pob cynnig o gyflogaeth yn amodol ar ôl cwblhau gwiriadau cyn cyflogi yn foddhaol. Cliciwch yma i gael mwy o wybodaeth Mae ein safon cyffuriau a alcohol wedi newid. Bydd yn ofynnol i bob darpar ymgeisydd gael a phasio prawf cyffuriau ac alcohol. Bydd eich cais yn cael ei ddiddymu os ydych chi'n cofnodi prawf positif. Bydd yr holl gyffuriau positif a chanlyniadau profion alcohol ar gyfer darpar ymgeiswyr yn cael eu dal yn ddiogel ar gronfa ddata Sentinel ac ataliad 5 mlynedd o wneud cais am rôl hanfodol diogelwch, bydd rôl sy'n gofyn am ardystiad PTS neu rôl ddiogelwch allweddol ar seilwaith a reolir gan reilffyrdd rhwydwaith yn cael ei orfodi. Mae cadw pobl yn ddiogel ar y rheilffordd wrth galon popeth a wnawn. Felly mae ymddygiad diogel yn ofyniad i weithio ar gyfer Rhwydwaith Rhwydwaith. Dylech ddangos eich ymroddiad personol i ddiogelwch ar eich cais."}