{"line-1":"Team Organiser","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"Technical Authority -Occupational Health","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Occupational Health and Wellbeing at Network Rail This is an exciting time to join our team of Occupational Health professionals, as we have just launched our inhouse service model, delivering flexibly, out of our 22 Occupational Health locations nationwide. It’s a great time to join us as we begin our journey to shape the new service for our organisation and the rail industry. The health, safety & wellbeing of our colleagues is of the paramount importance to us, delivering a high-quality occupational health service, and proactively managing our people’s immediate and long-term health and wellbeing risks. We’re looking for people who are customer focussed, highly motivated, and committed to deliver our new In-House Occupational Health for our 46,000 colleagues, for both clinical and operational roles. We’re creating a railway ‘Fit for the Future’ so we need a workforce ‘Fit for the future’ and you can play a key part in creating a sustainable service for the future. We’ve a fantastic opportunity for an experienced Team Organiser to support the team in the day-to-day operation and running of the OH In-House Service and support the Head of Delivery in driving the service forward. It would be advantageous if you had experience of working in an Occupational Health or medical environment. The service is currently in the early stages of its launch, the role will require some flexibility and require you to be adaptable to change. Please note for this role you will be required to be on-site for a minimum 3 days per week and may require nationwide travel.","line-10":"About the role (External)","line-11":"On a day to day, you will be expected to: 1. Undertake general office administration duties including control of all mail, co-ordinating diaries, processing and maintaining personnel records including vulnerable assets such as mobile telephones; make necessary returns. Arrange travel, hotels and vehicles, and order and control Personal Protective Equipment (PPE) for the team. 2. Organise meetings and the production, collation and dissemination of documentation for and resulting from them. Take minutes when required and follow up actions from the meeting. 3. Provide a consistent telephone presence on behalf of the team delivering excellent customer service levels. Provide communications to the team, including sending messages as required. 4. Maintain an efficient filing system paying particular attention to records of standing meetings, statutory records, and authorisations. 5. Utilise financial and procurement systems and act as Local Purchasing Agent (where directed) by ordering stationery and other office consumables as required. 6. Report team problems e.g. IT and office facilities and monitor response. 7. Undertake administrative tasks as directed including technical literature searches for the team. 8. Undertake the role in a way that is consistent with, and reinforces, Network Rail’s values. We're looking for someone who can demonstrate the following essential criteria: · Ability to multitask · Experience in appropriate IT packages · Good time manager · Strong organisation skills · Good communication skills (verbal and written) including excellent telephone manner · Experience of working with a team. It's not essential, but it would be advantageous if you have: A sound railway background and knowledge of railway geography A recognised qualification in keyboard associated skills and office management techniques Knowledge and experience of records management What we can offer you · 28 days annual leave entitlement, plus Bank Holidays and five volunteer days · 35 hours working week · Parental leave · Carer’s leave · A range of discounted offers including, Healthcare offers, cycle to work, healthcare club discounted membership and other benefits · Subsidies of up to 75% on rail and underground season tickets · A range of pension schemes · Two weeks paid reserve leave for our Armed Forces community · Training and development opportunities to support you in your career · Employee assistance programme available To learn more about Network Rail and about the benefits we offer please click Life at Network Rail - Network Rail","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: Starting from £25,000 and increasing to £30,000 Closing date: Friday 29th December. Interviews to take place beginning January. Late applications will not be accepted Click apply now to apply. Please note for this role you will be required to be on-site full time. Monday -Friday, 0830-1630. We are not able to offer hybrid working. What does our recruitment process look like? Once you have applied, our Recruitment Specialist will look at your CV. If your experience matches what we're looking for, you'll be invited to an interview. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}