{"line-1":"Asset Protection Scheme Interface Manager","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"AM Asset Protection Programme Mgr - LNE (570445) G1","line-6":"About Network Rail","line-7":"Key Vacancy Information:Job Title: Asset Protection Scheme Interface ManagerRole Type: Full Time, PermanentLocation: York George Stephenson HouseClosing date: 5th January 2024Salary: starting at £43,588 and increasing to £49,037 (plus Employee Healthcare) Annual Leave: 28 days + bank holidaysHours: 35 per week *Employees will be entitled to a 75% discount off leisure travel, this includes all Advance, off peak and super off peak tickets* About Network Rail: Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!https://www.youtube.com/watch?v=nLZ7OYSoQVUOver the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.","line-8":"Brief Description","line-9":"To safely and seamlessly integrate externally funded projects into the railway environment, whilst minimising impacts on railway operations and operational infrastructure. Leverage knowledge and understanding of rail related risks and constraints to facilitate solutions that align with the external client objectives whilst meeting all stakeholder requirements. To provide guidance to the external client team to support adherence to relevant Network Rail and rail industry standards and processes.","line-10":"About the role (External)","line-11":"Key Accountabilities – 1. Develop and deliver solutions for externally funded, high value, politically sensitive and multi-disciplinary projects (Levels of Control 2, 3 & 4) and where mandated, assure delivery in accordance with the GRIP lifecycle. Manage the seamless integration of all project risks affecting the operational railway. 2. Engage with and manage the interface with internal stakeholders to enable compliance with Network Rail governance and assurance processes. Facilitate compliance against the Railways Act and Network Licence and oversee the completion of deliverables. 3. Interrogate the Client remit and programme and provide clarity of operational railway interface requirements, devising solutions to enable early and accurate decision making by the Client. 4. Liaise with Construction Design Management (CDM) Client and other duty holders to establish principles for project compliance with the CDM Regulations. 5. Support the Network Rail interface with projects to secure and allocate resource and assure that delivery of projects is in compliance with Network Rail processes and procedures. Assist in communicating progress against defined milestones and expectations, supporting implementation of contingency measures where necessary. 6. Assist in facilitating agreement between all parties to identify which organisation acts as proposer for infrastructure changes in accordance with the Common Safety Method - Risk Assessment Regulations. Monitor and analyse all aspects of risk and performance over the project lifecycle. 7. Review lessons learned and develop mitigation strategies with stakeholders to refine project proposals to facilitate successful delivery. 8. Build effective relationships with all stakeholders, manage expectations, champion project interests. 9. Identify and progress opportunities to reduce Network Rail asset and maintenance liabilities, resolving conflicting works and driving efficiencies. 10. Assist in facilitating full recovery of Network Rail costs in accordance with the Legal Agreement between the external party and Network Rail. 11. Provide support to accident, incident & close call events, sharing outputs with client teams. Essential · Educated to degree level in a relevant discipline or equivalent experience · Membership (or working towards membership) Association for Project Management · Knowledge of the operational railway and railway infrastructure · Demonstrable experience of delivery of projects in the rail environment · Excellent stakeholder management and communication skills · Team player able to quickly build relationships and share knowledge acquired · Demonstrable ability to constructively challenge the ideas of others with good evaluation and decision-making skills. · Understanding of project commercial requirements & programme controls · Knowledge of health, safety & environmental requirements and legislation including CDM Regulations and CSM-RA · Knowledge and experience of project budget management. · Knowledge of GRIP/PACE Desirable · Knowledge of investment, commercial and procurement practices. · Previous experience working within Asset Protection · Understanding of rail infrastructure maintenance techniques · Knowledge of rail possessions/ isolations","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } External how to apply: Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We are a Disability Confident Leader employer! We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working, recognising that employees may wish to balance work with their family and home life. Network Rail Benefits – To find out about what benefits we offer, click here Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness of our safety vision. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). You will also be entitled to 28 days annual leave Salary: starting at £43,588 and increasing to £49,037. *Employees will be entitled to a 75% discount off leisure travel, this includes all Advance, off peak and super off-peak tickets* Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Closing date : 5th January 2024. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}