{"line-1":"Human Resources Business Partner","line-2":"Location","line-3":"Birmingham, GB","line-4":"Department Name","line-5":"IC HR Lead HR Business Partner Central (453130) G2","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You will be part of the North West & Central Region (NW&C) which consist of three routes – North West, Central and West Coast South – and a regional team supporting Regional Major Programmes & Professional services.","line-8":"Brief Description","line-9":"Based in our central Birmingham office, you will work with the Capital Delivery leadership team, under the direction of the both the Head of Human Resources and Senior HR Business Partner to deliver the business aligned People Plan/HR strategy and provide coaching and support to members of the supported leadership team. You will provide pro-active, value-add HR support to the business leaders across Capital Delivery on medium term and operational people issues.","line-10":"About the role (External)","line-11":"Working closely with the supported business, to implement and deliver the HR Strategy/People Plan to include; talent, succession planning and change management, in order to support the delivery of business objectives and drive a high performance culture. Work closely and building strong relationships with members of the supported business senior leadership team and other relevant stakeholders. Coach, advise and challenge, where appropriate, business leaders on short and medium term HR issues as required. Provide operational HR support on (for example) organisation change, senior appointments, salary and bonus, graduate or apprentice programmes. Successfully deliver client responsive, cost effective and integrated people solutions that address key business objectives, gaining acceptance from key stakeholders. Reinforce the ownership of people management by the business and line managers and support the HR delivery model. Work with the broader HR function, including Centres of expertise, HR Direct and HR shared services teams to provide the best solutions for the business. Work with appropriate Union representatives to support the business in delivering business solutions. Liaise with HR Business Partners in other areas of the business in order to work collaboratively on cross business/geographical issues. In order to be successful in this role, we would like you to have/to be: Demonstrates strong business/commercial approach and understanding of business needs. Proven experience of working in partnership and building strong working relationships with senior managers in order to improve people management. Passionate about customer service with ability to articulate previous achievements through business deliverables. Knowledge and experience of implementing best practice HR solutions to drive a high-performance culture. Experience of coaching and influencing senior managers. Excellent communication skills and ability to negotiate and influence effectively with all levels of an organisation. Understands how to work with the business to identify, develop and retain talent. Excellent technical HR Knowledge - CIPD qualified or relevant experience to demonstrate level of competence. Proven track record of operating in a complex working environment. Involvement in organisation change programmes e.g. TUPE, Organisation re-design, redundancy programmes, etc Graduate calibre We would also like but it isn’t crucial to have/to be: MCIPD/post-graduate human resources qualification. Understanding of project management principles and experience of managing complex projects to successful conclusion. Experience of managing projects to successful conclusion. Experience of working within a unionised environment. Key Leadership Capabilities: Influencing others Creating solutions Understanding others Making things happen Thinking flexibly Customer focus Working closely with the supported business, to implement and deliver the HR Strategy/People Plan to include; talent, succession planning and change management, in order to support the delivery of business objectives and drive a high performance culture. Work closely and building strong relationships with members of the supported business senior leadership team and other relevant stakeholders. Coach, advise and challenge, where appropriate, business leaders on short and medium term HR issues as required. Provide operational HR support on (for example) organisation change, senior appointments, salary and bonus, graduate or apprentice programmes. Successfully deliver client responsive, cost effective and integrated people solutions that address key business objectives, gaining acceptance from key stakeholders. Reinforce the ownership of people management by the business and line managers and support the HR delivery model. Work with the broader HR function, including Centres of expertise, HR Direct and HR shared services teams to provide the best solutions for the business. Work with appropriate Union representatives to support the business in delivering business solutions. Liaise with HR Business Partners in other areas of the business in order to work collaboratively on cross business/geographical issues.","line-12":"Working closely with the supported business, to implement and deliver the HR Strategy/People Plan to include; talent, succession planning and change management, in order to support the delivery of business objectives and drive a high performance culture. Work closely and building strong relationships with members of the supported business senior leadership team and other relevant stakeholders. Coach, advise and challenge, where appropriate, business leaders on short and medium term HR issues as required. Provide operational HR support on (for example) organisation change, senior appointments, salary and bonus, graduate or apprentice programmes. Successfully deliver client responsive, cost effective and integrated people solutions that address key business objectives, gaining acceptance from key stakeholders. Reinforce the ownership of people management by the business and line managers and support the HR delivery model. Work with the broader HR function, including Centres of expertise, HR Direct and HR shared services teams to provide the best solutions for the business. Work with appropriate Union representatives to support the business in delivering business solutions. Liaise with HR Business Partners in other areas of the business in order to work collaboratively on cross business/geographical issues.","line-13":"How to apply (External)","line-14":"Salary: £43,588 - £49,036 Closing date: Tuesday 19 December 2023. - Late applications will not be accepted. Click apply now to apply. Hybrid working opportunity! This role requires working in the office 2/3 days a week, and will require travel to other locations within the North West & Central Region to support the client groups. You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}