{"line-1":"Principal Portfolio Manager","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Role: Principal Portfolio Manager x 2 - We are recruiting two of these positions!Location: London Stratford x 1, Derby x 1 – (Preferred)Salary: £97,850 - £110, 081Type: PermanentNetwork Rail own, repair and develop the railway infrastructure in England Scotland and Wales. Our role is to run a safe, reliable and efficient railway, serving our customers and communities. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.With railway from the borders of Scotland to the nation’s capital, Eastern region is critical to the success of Britain. The region comprises four routes – Anglia, East Coast, East Midlands and North & East, supporting key transport links to and from busy cities including Newcastle, Leeds, Sheffield, Nottingham, Derby, Norwich, Cambridge and London.The Capital Delivery directorate within Eastern Region is trusted to invest billions of pounds of railway funding each year, leading development and delivery infrastructure enhancement and renewals projects across the region.Does this sound like an organisation you’d like to be a part of and a role that fits your profile?Whilst the roles are nominally Derby and Stratford (London) based, our colleagues are encouraged to work flexibly as we know traditional working patterns don’t always fit. We’ll do our best to help and invest in your career with us, whilst you have a healthy work life balance.","line-8":"Brief Description","line-9":"The Capital Delivery Renewals and Minor Enhancements organisation is forecast to deliver £1.7bn of investment in CP7, through its four region-wide delivery teams. Each team is accountable for a portfolio focused on specific engineering disciplines / asset types. Our core purpose is based around specifying efficient, value for money solutions, progressing optimal procurement strategies, and ensuring a proportionate and effective approach to assurance. We are recruiting two key Principal Portfolio Manager roles, one to lead our Buildings Renewals and Enhancements team, and the other leading our Electrification & Plant portfolio. In addition to this functional accountability, these roles will also lead on senior stakeholder relationships in the Route where they are based, hence Stratford (supporting Anglia) and Derby (supporting East Midlands) are our preferred locations. We are looking for a proven senior leader, delivering railway projects in Network Rail or our supply chain. You’ll offer a diverse set of skills and experience, be able to set direction for a large internal team and manage key stakeholder relationships with Network Rail colleagues and with the supply chain.","line-10":"About the role (External)","line-11":"Each role will lead a team of Portfolio Management and Engineering professionals, supported by aligned Commercial and Assurance experts, delivering a wide variety of fast paced schemes across the region. You must have excellent interpersonal / teambuilding skills and be able to demonstrate that they have a customer orientated stakeholder approach. The key challenges for the role over the coming year are: · Leading the transition to new ten-year discipline specific framework contracts with our supply chain. · Providing delivery certainty and defining a bottom up efficiency glidepath to meet our delivery targets. · Leading the evolution of a more collaborative approach with out stakeholders. Ideal Candidate Essential 1. Proven experience in the successful management and assurance of major programmes of work in the construction or rail industries. 2. Proven commercial focus and financially astute (including P&L experience) 3. Detailed knowledge of the principles of investment processes and procedures. 4. Detailed knowledge of the principles of Health & Safety, quality and environment legislation and best practice. 5. Detailed practical knowledge of the Construction (Design and Management) 2015 Regulations. 6. Experience of successful management in a matrix structure. 7. Knowledge and application of the Three Lines of Defence Assurance Model. 8. Demonstrable experience of confidently building strong, diverse internal and external networks to unblock issues and achieve progress 9. Demonstrable experience of promoting team agendas, breaking down barriers and focussing on the best outcomes. 10. Significant experience of creating clear standards, delegation and empowering others. 11. Demonstrable experience that the physical and emotional well-being and safety of others is a key priority, supporting colleagues at all levels to challenge unsafe and unsafe behaviours or risks. 12. Demonstrable ability to differentiate between strategic and operational issues, collaborating with a range of external stakeholders and colleagues. 13. Knowledge of/experience in the UK railway industry It is advantageous if you have… · Knowledge of the PACE Framework · Excellent communication skills with demonstrable delivery of leadership and behavioural change within a large, complex organisation. · Highly collaborative and adept at developing lasting and productive stakeholder relationships · Ability to inspire and influence others · Hold a degree or equivalent in a relevant subject area and/or are a Chartered member of a relevant professional institution.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £97,850 - £110,081Closing date: 21st December 2023. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more informationAre you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here.Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles."}