{"line-1":"Shift Station Manager","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"OE Kent London Bridge - Non Qual Exp (752709) G5","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"The Shift Station Manager manages the day to day performance of the Station team within set resources and budgets, in accordance with the company processes and objectives. They professionally deliver excellent and consistent customer service - providing an operationally safe, secure and quality station environment for all station stakeholders including TOCs, tenants, passengers, station users and retailers. Please Note: This role requires the incumbent to hold National Security Vetting / have passed a Counter Terrorism check. The successful candidate will not be permitted to start in the role until they have this clearance.","line-10":"About the role (External)","line-11":"Key Accountabilities1. Manage and lead the direction of the station team in the delivery of a safe station environment, compliant with appropriate operational and safety standards, to provide excellent customer service. Act as a role model and mentor, progressing agreed development plans through continual monitoring and review to enhance team performance.2. Implement and lead station emergency and evacuation plans as required and manage the security of identified risk areas, checking inspections are completed and recorded. Manage and direct resources in response to all accidents and incidents affecting the station environment.3. Monitor and maintain station services and amenities in accordance with the terms of the Station Access Agreements (SAAs), in partnership with TOC’s and retail outlets.4. Liaise with internal and external stakeholders and customer including route teams, TOC’s and FOC’s, to develop and maintain effective relationships in order to increase the overall customer satisfaction at the station.5. Manage employee rosters and resources on a day to day and long term basis, delivering resource contingency plans as necessary within budget and procurement rules.6. Manage the programme delivery for station checks including contractor compliance and train despatch, in accordance with relevant company standards and procedures. Implement the National Railway Security Programme and Station Security Plan to deliver the legislative requirements and maintain relevant records and implement plans to prevent criminal activity and improve safety within the station.7. Conduct the required risk assessments that are mandated through legislation and company standards. Review and approve contractor risk assessments and method statements for compliance with standards.8. Implement and comply with the relevant industry and company standards and procedures including health, safety and environmental policies and procedures. Management and deliver the competency assessment processes. Comply with Network Rail’s.9. Carry out non-technical checks of works in progress checking that Landlord’s Approval Conditions are adhered to and that non compliances are reported and managed effectively. Job Skills, Experience and Qualifications Essential· Ability to lead, manage and develop people*· Ability to attain rules and regulations level 2 competency*· Ability to gain appropriate assessor competence*· Ability to gain Station Incident Officer*· Ability to gain safety management qualification IOSH/NEBOSH*· Able to demonstrate decision making skills and assertiveness · Understanding of customer needs and requirements· Able to demonstrate organising and planning skills· Previous safety management experience· Ability to attain Person Responsible for Fire Safety*· Attain First Aid at Work* Desirable· Understanding financial systems and budgets· Commercial awareness· IT skills in relation to report writing, corporate IM packages· General understanding in business improvement processes· General understanding of railway industry structure and responsibility· Ability to engage in employee relation issues· Previous customer service experience· Experience in accident investigation * denotes post holder must attain relevant competency prior to carrying out activity","line-12":"How to apply (External)","line-13":"Salary £34,050-£38,305 Been referred by a friend, then please complete this form Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 8th December 2023 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. Click ‘apply now’ to apply. - We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Drugs and Alcohol Standard: All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}