{"line-1":"Senior Project Engineer","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"AM Regional Buildings & Civils Engineer (570521) G1","line-6":"About Network Rail","line-7":"Key Vacancy Information: Job Title: Senior Project Engineer (Process & Assurance) Role Type: Full Time, Permanent Location: York George Stephenson House Closing date: 19th December 2023 Salary: salary starting at £55,596 and increasing to £62,546 (plus Employee Healthcare) Annual Leave: 28 days + bank holidays Hours: 35 per week *Employees will be entitled to a 75% discount off leisure, this includes all Advance, off peak and super off peak tickets* About Network Rail: Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it. We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out. We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! https://www.youtube.com/watch?v=nLZ7OYSoQVU Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.","line-8":"Brief Description","line-9":"As part of the Regional Engineering function, you will actively support the delivery of the Safety and Assurance Accountability of the DEAM function. This will require you to take an active role in conducting second line assurance of engineering activities within the Structures discipline across all functions (where required). You will seek opportunities within engineering controls, standards, and procedures to bring about improvements in safety, quality and cost effectiveness of design, maintenance, construction, commissioning amongst other technical activities on relevant projects and initiatives within the region.","line-10":"About the role (External)","line-11":"Key Accountabilities –1. Undertake second line assurance (including audits) of engineering activities within the regional asset portfolio to assess compliance with Rail Group and Network Rail company standards and effectiveness of project and engineering control procedures.2. Identify opportunities and support the implementation of improvements in engineering controls, standards, and procedures applicable to the structures discipline.3. Support the mentoring and competence development of engineering resources working on projects within the discipline and provide functional guidance, direction and deliver briefings.4. Drive the embedment of industry practice within the structures discipline.5. Undertake assurance on the application of relevant techniques and procedures of quantified and qualitative risk assessment.6. Undertake assurance on environmental aspects of projects in accordance with Network Rail environmental policies.7. Conduct audits on contractors to monitor safety, quality of designs, maintenance, construction testing and commissioning and the adequacy of management systems.8. Provide technical advice by undertaking or support accident and incident investigations with the view to enable the monitoring, implementation, and embedment of arising actions and closure of any recommendations.9. Support the setting of policy and standards, and process updates within the Structures discipline by proactive research and respond to changes in internal and external requirements and practice that may impact the discipline.10. Assist the Principal Engineer with the implementation and management of competence and training within the discipline.11. Act as Delivery Manager for specific projects of portfolio of projects and deliver to cost, quality and time.12. Support technical inputs into enhancement of existing standards, specifications, and system risk management by undertaking engineering analysis to support derogations and risk assessment techniques, where non-compliances are identified.13. Support the development of discipline strategies around capability, assurance, and technology with support from industry partners and relevant stakeholders.14. Proactively research and respond to changes in the internal and external requirements and practice which impact upon policy and standards.15. Support Engineering Verification activities.16. Integrate and co-ordinate activity across different engineering disciplines and contribute to the development of engineers within the practice. Essential· Significant experience in the structures engineering discipline, ideally with involvement in construction and design projects across multi discipline areas· Technical qualifications to at least HNC level or equivalent in a relevant subject· Membership of a relevant professional institution· Broad technical engineering experience· Experience of contracting· Project or financial planning and management experience.· Knowledge of structuring safety cases in support of projects· An understanding of safety management systems, quality assurance and risk assessment techniques· Understanding of the arrangements required for the independent assessment of works· Experience of undertaking engineering quality assurance.· Accident or incident investigation experience. Desirable· Chartered status of equivalent in a relevant engineering discipline· Membership of a relevant professional institution· Experience of applying structured continuous improvement techniques· Proven ability in managing commercial, contractual, and financial issues.· Knowledge of the railway industry and understanding of the railway infrastructure.· Experience of applying structured continuous improvement techniques (for e.g. Six Sigma Yellow Belt)","line-12":"How to apply (External)","line-13":"External how to apply: Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We are a Disability Confident Leader employer! We will interview all disabled applicants who meet the essential criteria. We positively embrace flexible working, recognising that employees may wish to balance work with their family and home life. Network Rail Benefits – To find out about what benefits we offer, click here Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information. Please ensure you have the appropriate Right to Work status when applying for this role.” Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness of our safety vision. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3,333 (to a maximum amount of £2,500). You will also be entitled to 28 days annual leave Salary: starting at £55,596 and increasing to £62,546 per annum. *Employees will be entitled to a 75% discount off leisure travel, this includes all Advance, off peak and super off peak tickets* Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Closing date 19th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}