{"line-1":"Project Manager (Works Delivery)","line-2":"Location","line-3":"Peterborough, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out. We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Project Manager (Works Delivery) [Track] to join our team to project manage Works Delivery work across the full portfolio of Network Rails Works Delivery renewals, inspection and maintenance programmes. To be accountable to the Route for leading their teams to achieve safe, compliant and cost effective delivery of all projects within programmes, meeting client requirements. Role and Responsibilities may include but are not limited to: 1. Accountable for delivery of a portfolio of projects in a safe & environmentally responsible manner to time, cost and quality, in accordance with the Governance of Railway Investment Projects (GRIP), applicable Network Rail company standards, current legislation and procedures including HMRI guidance where appropriate.2. Lead, inspire, direct and develop specialist teams to deliver successful projects to meet route objectives for internal and external stakeholders.3. Direct and co-ordinate multi-disciplinary teams including commercial, programme controls, engineering, and others to identify cost effective solutions to client requirements, establish a robust baseline plan and manage and maintain the plan to project completion.4. Lead the identification and monitoring of project risks (threats and opportunities), and the associated planning and implementation of mitigation. Respond to previously unidentified issues that affect the programme and implement change control in collaboration with clients and contractors in accordance with NR processes.5. Responsible for the management of resource planning for current and projected work banks, including identification and management of critical resource requirements for direct labour, contingent and specialist resource, in accordance with Network Rails policies. 6. Engage with and lead stakeholder relationships including internal and external parties, taking account of their levels of influence and particular interests.7. Establish and maintain governance arrangements for the delivery of projects, defining clear roles, responsibilities and accountabilities that align with organisational practice. Managing project reviews at appropriate points throughout the project lifecycle which will inform governance decisions of projects by providing evaluations of progress, performance, risk, contingency and continuing relevance.8. Accountable for the management and implementation of Construction Design Management (CDM) requirements associated with programmes to deliver compliance to regulations management and management of the Works Delivery Principal Contractors License. 9. Manage and update business cases that justify projects in terms of benefits, costs and risks in collaboration with clients and support project Sponsor in preparing and maintaining project definitions. 10. Lead & undertake accident investigations when remitted to by the relevant designated competent person.","line-10":"About the role (External)","line-11":"Essential · Educated to degree level in a relevant discipline or equivalent demonstrable experience · Member of the Association for Project Management or equivalent, holding or working towards chartered status or equivalent · In depth knowledge and previous experience of the application of Construction Design Management (CDM) regulations · Excellent and demonstrable stakeholder engagement and communication skills all levels. This should include customers; 3rd party representatives, delivery teams, other business & functional leaders. · Successful relevant experience in a project environment including demonstrable experience in team leadership, planning, contracting and delivery of projects · Successful record of project budget management and ability to understand and interpret commercial and financial landscapes (budgets, forecasts, actual status) · Previous experience of inspiring and leading multi-disciplinary teams to successfully deliver projects · Successful experience in managing ambiguity in a project environment with strong evaluation and decision-making skills · Demonstrable safety management practice in project delivery · Detailed knowledge of Health and Safety legislation and best practice · Successful experience in Accident Investigation Desirable · Demonstrable experience in the Rail Industry Sector (including application of GRIP) · Detailed knowledge of Investment, Commercial and Procurement regulations and practices · Formal qualifications in risk identification and assessment · You will be a team player and a self-starter with willingness to learn, challenge and get involved · Knowledge of Network Rail’s assets and how they are managed","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary and benefits: • Salary of £55,596 - £62,546 (Band 3.C) depending on skills, qualifications and experience • 28 days annual leave entitlement plus bank holidays • My benefits – Our discounted online shopping site • A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits • Subsidies of up to 75% on rail and underground season tickets • A choice of contributory pension schemes • 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 19 December 2023 and late applications will not be considered ** Oh, and by the way… We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you! We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications. Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. If you like the sound of all that, we’d love it if you could submit your application online."}