{"line-1":"Timetable Simulation Team Leader","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"System Operator","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you!","line-8":"Brief Description","line-9":"About the function System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? We are looking for an individual who knows what it takes to develop and promote great performing teams that are great places to work. You will possess excellent communication skills and be able to prioritise and delegate workload to a team of Timetable Simulation Analysts, supporting the teams’ Portfolio Managers and Project Managers with the correct analyst, at the right time to deliver our teams strategic aims. In addition, you will understand how best to develop your team members and foster a culture of continuous improvement and personal development. It is not essential that you have experience in using simulation toolkits (as training will be provided), but it is essential that you have an aptitude for solving problems and can work within a small team environment that influences the end-to-end timetable planning process.","line-10":"About the role (External)","line-11":"What does the average day look like? On a typical day you will undertake line management and resource management for the Simulation Portfolio. To do this you will measure and manage the effective performance of the team, so that best practice disciplines including one-to-ones, team meetings, development plans and honest feedback are all delivered appropriately and with sufficient frequency. You will also support the Timetable Simulation Portfolio Manager in managing relationships with internal and external stakeholders including making presentations and briefings. What essential skills and experiences are required? • A good understanding of transport modelling theory/method, data collection, analytical techniques & appraisal methods. • Proven ability of building team capability through development and implementation of project disciplines. • Proven experience in successful delivery of multiple projects. • Proven successful experience in complex demand prioritisation. • Proven ability to engage, influence and build collaborative relationships with customers, and stakeholders at all levels. • Proven experience in managing and developing high-performing teams. For a full list of the key accountabilities and essential/ desirable criteria, please click apply now and you will be redirected to the Network Rail Careers website where you will be able to find this role where the job description will be attached.","line-12":"How to apply (External)","line-13":"How to apply Duration: Permanent Location: This role is based at QMK. For roles based in the Quadrant:MK, you must live within 75/90 minutes Band & Salary: 3B £46,701 - £52,538 Closing date: 12th Dec 23. On occasions, we may need to close the advert early based upon application volumes. Late applications may not be accepted. Next Steps: Interviews will be held W/C 18th Dec 23 About our people and the recruitment process… We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. We will interview all disabled applicants who meet the essential criteria. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our Safety Vision Visit Evenbreak’s Career Hive should you need accessibility support to apply or should you require any reasonable adjustments/modifications, please contact RecruitmentSupport@networkrail.co.uk and have your IRC number ready as this will be required. A message from our Chief Executive, Andrew Haines: ‘Our passengers and freight customers are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more! We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here. What can we offer you in return? We have a range of benefits including: 🌞 Generous annual leave (28 days plus statutory days), with the option to buy/sell days. Defined benefit pension scheme 🚂 75% subsidy on train tickets. 🎟️ Interest-free travel loan for train and car park season tickets. 🎁 Discounts at stations with your Network Rail pass. 🌍 Flexible/hybrid working arrangements. 🕊️ Volunteer leave to make a positive impact. Plus more…. BPSS As an arm’s length department of the UK Government, Network Rail is required to comply with a well-established pre-employment vetting process for all prospective employees. Baseline Personnel Security Standard (BPSS) checks require prospective employees of Network Rail to meet the following requirements. • Provide eligibility to work in the UK and identity documentation • Complete a satisfactory 3-year employment history check • Complete a satisfactory unspent criminal conviction disclosure check for more information regarding BPSS pre-employment related checks, please visit the UK Government website for further information - UK Government - BPSS Checks Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or another factor. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced."}