{"line-1":"Workplace Adjustments Manager","line-2":"Location","line-3":"Milton Keynes, GB","line-4":"Department Name","line-5":"human resources","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟 Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us! We're dedicated to building an equitable, diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Equity, Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Join our Equity, Diversity and Inclusion team in a brand new and pivotal role where you’ll champion an inclusive work environment! As a key player, you’ll be dedicated to supporting employees, HR colleagues, and managers in implementing our workplace adjustment policy and procedures. We’re on the lookout for someone passionate about driving continuous improvement in the workplace adjustments process and system. Your role will involve managing governance and mitigating risks associated with workplace adjustments, along with supporting stakeholders at all levels of the business implement adjustments that can remove barriers for our colleagues. If you’re committed to fostering an environment where everyone can thrive, and you're ready to make a positive impact, we invite you to be a part of our team.","line-10":"About the role (External)","line-11":"What does the average day look like? As a Workplace Adjustments Manager, you’ll be the go-to subject matter expert, ensuring Network Rail remains at the forefront of industry best practices and legal compliance. Serving as a point of escalation for complex cases, you’ll collaborate with key stakeholders to swiftly remove barriers, enabling timely support for our colleagues while ensuring legal compliance. Your expertise extends to managing the relationship with our case management system supplier, ensuring seamless operations and continuous improvement. Leading a cross-functional working group, you’ll drive enhancements to our approach, making workplace adjustments more efficient and user-friendly. Your role also involves leading training initiatives, empowering HR and line managers to confidently apply our policies and processes. Through effective communication with stakeholders at all levels, you’ll influence positive actions, contributing to the ongoing success of our workplace adjustments program. What essential skills and experiences are required? We’re seeking a dedicated individual with a proven track record in monitoring, measuring, and reporting on quality measures and performance metrics, showcasing expertise in data analysis and Excel. Your commitment to disability inclusion is paramount, backed by a solid understanding of the Equality Act 2010 and the Public Sector Equality Duty. With a keen awareness of the challenges faced by disabled individuals, you bring valuable stakeholder and relationship management skills in complex working environments. Your experience includes driving continuous improvement across business processes, systems, and the application of workplace adjustment policies. In addition, your contract management prowess, excellent communication skills, and ability to navigate sensitive conversations make you a standout candidate. Your knowledge spans relevant legislation in Occupational Health, HR, Risk Management, and Health and Safety, ensuring an integrated approach to our inclusive workplace. For a full list of the key accountabilities and criteria’s, please click apply. You will then be directed to the Network Rail Careers page where you can locate the job description..","line-12":"How to apply (External)","line-13":"Key Vacancy Information Duration: 12-month Fixed Term Contract with the potential to become permanent This role is a full-time opportunity, but flexible working patterns will be considered. Location: We can be flexible with a base at a Network Rail office/ centre For roles based at The Quadrant you must live withing 75 mins. Closing date: 11th January 2023. On occasions, we may need to close the advert early based upon application volumes. Late applications may not be accepted. Interviews will be held W/C 22nd Jan 24 & W/C 29th Jan 24, depending on business requirements. Band & Salary: Band 4C £43,588 - £49,037. Depending on experience. We're an inclusive employer of choice, Disability Confident Leader employer, encourage people to work flexibly and we welcome applications from everyone. “We’re delighted to have been named as one of The Times Top 50 Employers for Gender Equality 2023.” 🌞 Generous annual leave (28 days plus statutory days), with the option to buy/sell days. Defined benefit pension scheme 🚂 75% subsidy on train tickets. 🎟️ Interest-free travel loan for train and car park season tickets. 🎁 Discounts at stations with your Network Rail pass. 🌍 Flexible/hybrid working arrangements. 🕊️ Volunteer leave to make a positive impact. Plus more…. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. We're an inclusive employer of choice, Disability Confident Leader employer, encourage people to work flexibly and we welcome applications from everyone. If you have any questions about this role or if you have an HR related questions or require any reasonable adjustments/modifications, please contact IREC Support (Irecsupport@networkrail.co.uk ). You must have the vacancy/IREC number ready as you will be asked for this."}