{"line-1":"Programme Manager - IP","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"IN TRU - Central Delivery (457330) G2","line-6":"About Network Rail","line-7":"Key InformationRole: Programme ManagerSalary: £71,163 per annum to £80,060 per annumCar Allowance: £6,000 per annumLocation: LeedsContract Type: Permanent28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak tickets. Employees will also be entitled to 75% discount on season tickets. Network Rail Benefits – To find out about what benefits we offer, click here🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"As a Programme Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have a unique role which will manage the development and delivery of a civils programme of work to agreed scope, time, and cost. Day-to-day, you'll operate effectively working within and managing the civil engineering spoke of the programme so knowledge of other functional disciplines, in particular a civils background would be advantageous. You will lead the project through ES4, delivery to project close out by safely managing construction to design and value engineering.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are: 1. Lead and direct the Programme team to achieve business and functional objectives and meet key performance measures. 2. Manage development of individuals and the engagement of the team working within a hub and spoke contracting model. 3. Manage the arrangements for staff safety and competence. 4. Agree remit and success criteria with Sponsor. 5. Manage the production of project management plans. 6. Manage the deployment of resources. 7. Check work is completed to standards. 8. Check that safety, compliance, performance and business processes are followed. 9. Monitor delivery, productivity and efficiency against the programme. 10. Deliver regular progress reports including risks and issues to Sponsors. 11. Produce periodic Business Review Report. We need you to have: · Knowledge of programme management processes and techniques · Knowledge of maintenance management, processes and techniques · Knowledge of health and safety management and compliance management processes · Knowledge of business management processes and techniques · Knowledge of relevant standards and procedures · Knowledge of operational railway environment · Knowledge of other functional disciplines · Knowledge of CDM Regulations · Good interpersonal, influencing, communication and organisation skills It would be advantageous if you have: · Degree qualification · Membership of a professional body · Knowledge of coaching techniqueskes sense to anyone reading it. Make sure the content is accessible to everyone.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. Salary: starting at £71,163 and increasing to £80,060 per annum. Car Allowance: £6,000 per annum Closing date: 20th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}