{"line-1":"Route Control Manager (ICC)","line-2":"Location","line-3":"Manchester, GB","line-4":"Department Name","line-5":"Route Businesses","line-6":"About Network Rail","line-7":"Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions. And we do it in millions of different ways. This is an exciting time to join Network Rail. We’re passionate about great service and commit to our service equation vision by “putting passengers first”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves - what can we do to put our passengers and freight users at the centre of everything we do? Take a look here! You will be part of the NW&C Region which consist of three routes: · North West Route, covering Manchester, Liverpool, Lancashire and Cumbria. · Central Route, covering the West Midlands and Chiltern areas. · West Coast South Route, covering the south of Crewe to London Euston. · There is also a Regional Team which supports Regional Major Programmes & Professional services. We value the commitments you may have outside of work and will consider flexible working applications. If we can make it work – we will! We're proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here.","line-8":"Brief Description","line-9":"To manage the delivery of the daily train plan within the ICC to meet the differing needs of rail industry customers. Maintain relationships with train operators and other key industry partners to minimise the impact of any disruption to both the timetable and passenger journeys and other customer operations. Please note security vetting clearance is required prior to starting the role.","line-10":"About the role (External)","line-11":"Every day will be different, but you can expect to be involved in the following activities:1. Lead the safe delivery of the daily train plan both during normal running and disruptive events and in the management of Very Short Term Planning activity.2. In the event of a major incident or severe disruption to the service, act as Gold Command to provide strategic direction to control and other response personnel and set up and manage the major incident room.3. Lead the management of safety of the line incidents in accordance with safety standards and statutory requirements.4. Lead the control team dissemination of safety critical and other information, and introduce and maintain a system of recording operational safety and performance incident information in accordance with the relevant company standards, procedures and statutory requirements, to provide safety, performance and management reporting information at the required frequencies.5. Manage the development and application of appropriate contingency plans in times of disruption, to minimise delays and cancellations to customers.6. Lead incident reviews giving appropriate consideration to customer needs, Network Rail and train operators positions and establish a system to monitor and review the implementation of recommendations and the effect on future performance.7. Lead the development of process integration within the control environment, to develop more effective approaches to management of the train plan, incidents and provision of customer information.8. Contribute to development and maintenance of up to date operational and safety policies and procedures, relating to train service delivery, control of operations and control personnel. 9. Manage the integrity of sensitive operational and security documentation. In order to be successful in this role, we would like you to have/to be: · Experience of leading teams within a control, logistics or operations environment· Experience of strategic decision-making· Good negotiating skills and ability to make objective decisions· Able to manage conflict, influence others and work under pressure· Knowledge of Network Rail and Train Operating Companies within the Route and the key aspects of their business· Knowledge of Train Operator performance regime and targets· Understanding of operational rules and regulations· Good geographical knowledge of applicable Route We would also like but it isn’t crucial to have/to be: · Previous experience of working within a safety critical communications environment· Geographical knowledge of adjoining Routes","line-12":"How to apply (External)","line-13":"We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business. Click here for more information. Want to find out about what fantastic benefits we offer? Find out here Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information. Salary: Band 3C - Starting at £53,202 and increasing to £59,853 Closing date: 18th December 2023. Late applications will not be accepted. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a diverse interview panel wherever possible."}