{"line-1":"Project Manager - IP","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"IN TRU - Digital Railway (457340) G2","line-6":"About Network Rail","line-7":"***All recruitment for this role (internal and external) is taking place on Tribepad. Please do not apply via Oracle. For your application to be considered, please apply via: https://careershub.networkrail.co.uk/members/?j=2578***Key InformationRole: Project Manager (IP) Salary: £55,596 to £62,546 per annumGrade: 3.CLocation: York George Stephenson House 28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel, this includes off peak and super off-peak tickets Network Rail Benefits – To find out about what benefits we offer, click hereWe're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!https://youtu.be/nLZ7OYSoQVUOver the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry.In being a part of Network Rail, you’re not only part of an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.https://network-rail.wistia.com/medias/e9gfrx2przWe have an exciting opportunity to join Transpennine Route Upgrade as Project Manager (IP)! Transpennine Route UpgradeThe Transpennine Route Upgrade (TRU) is a Programme of activities that is improving the railway between York and Manchester via Leeds and Huddersfield.​​​Stretching across the North of England, this key 76-mile Transpennine railway serves 23 stations, crosses over and dips under 285 bridges and viaducts, passes through six miles of tunnels, and crosses over 29 level crossings.Proposed improvements as will deliver a hard-working, reliable railway for passengers, allowing for trains with more seats, more services and faster journey times.​ For more information visit www.theTRUpgrade.co.uk","line-8":"Brief Description","line-9":"Part of TRU is the exciting introduction of the new train control technology that needs a dedicated project management team to deliver several technical interventions across the TRU route. The role will need an enthusiastic and dynamic leader that has a strong Project Management background along with the ability to converse with stakeholders at all levels.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are:1. Accountable for delivery of complex projects or a portfolio of lower complexity projects in a safe & environmentally responsible manner to time, cost and quality, in accordance with the Project Acceleration in a Controlled Environment (PACE), applicable Network Rail company standards, current legislation and procedures including HMRI guidance where appropriate.2. Support the project Sponsor in preparing and maintaining definitions of the project requirements.3. Lead and develop multi-disciplinary teams including commercial, programme controls, engineering, and others to identify solutions to client requirements and establish a robust baseline plan.4. Empower and inspire others to deliver successful projects5. Identify and monitor project risks (threats and opportunities), plan and implement mitigations to them, and respond to other issues that affect the project6. Implement and manage resource allocation plans needed for delivery of the project including identification and management of critical resource requirements. Secure resources needed for projects from internal and external sources.7. Engage with and lead stakeholder relationships including internal and external parties, taking account of their levels of influence and particular interests.8. Establish and maintain governance arrangements for the delivery of projects, defining clear roles, responsibilities and accountabilities that align with organisational practice. Managing project reviews at appropriate points throughout the project lifecycle which will inform governance decisions of projects by providing evaluations of progress, performance, risk, contingency and continuing relevance.9. Establish, and implement where necessary, protocols to change the scope of projects and updating configuration documents as required.10. Manage and update business cases that justify projects in terms of benefits, costs and risksWe need you to have:· Educated to degree level in a relevant discipline or equivalent demonstrable experience.· Membership (or working towards membership) of the Association for Project Management.· Registered PRINCE2 / APM / MSP Practitioner or equivalent.· Excellent stakeholder engagement and communication skills all levels. This should include Customers; 3rd party representatives, other business & functional leaders and key support personnel.· Successful relevant experience in a complex project environment including demonstrable experience in team management, planning, contracting and delivery of projects.· Successful record of project budget management and ability to understand and interpret commercial and financial landscapes (budgets, forecasts, actual status).· Experience in managing ambiguity in a project environment with strong evaluation and decision-making skills.· Demonstrable Project safety management practice and knowledge of Health and Safety legislation and best practice.· Experience with safety cases in support of projects.It would be advantageous if you have:· Demonstrable experience in the Rail Industry Sector (including application of GRIP, Construction Design Management (CDM) and the Common Safety Method (CSM).· Detailed Knowledge of Network Rail’s Investment, Commercial and Procurement regulations and practices.· Knowledge of structuring safety cases in support of projects.· Formal qualifications in risk identification and assessment.· You will be a team player and a self-starter with willingness to learn, challenge and get involved.· Knowledge of Network Rail’s assets and how they are managed.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } ***All recruitment for this role (internal and external) is taking place on Tribepad. Please do not apply via Oracle. For your application to be considered, please apply via: https://careershub.networkrail.co.uk/members/?j=2578***We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. Salary: starting at £55,596 and increasing to £62,546 per annum. Location: Base location of York George Stephenson House Closing date: 13th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}