{"line-1":"Section Administrator [Off Track]","line-2":"Location","line-3":"Preston, GB","line-4":"Department Name","line-5":"North West & Central","line-6":"About Network Rail","line-7":"We're proud to be recognised by Glassdoor as one of the Top 50 Best Places to Work in 2021. Find out more from our people here. Network Rail operates and maintains the railway infrastructure 24/7 365 days a year. We do work that matters to millions. And we do it in millions of different ways. We’re passionate about great service and commit to our service equation vision by “putting passengers first”. Performance, safety and getting the fundamental basics right, is something we strive for as well as asking ourselves - what can we do to put our passengers and freight users at the centre of everything we do? You will be part of the NW&C Region which consist of three routes: · North West Route, covering Manchester, Liverpool, Lancashire and Cumbria. · Central Route, covering the West Midlands and Chiltern areas. · West Coast South Route, covering the south of Crewe to London Euston. There is also a Regional Team which supports Regional programmes & Professional services. To find out more about us - Take a look here! We value the commitments you may have outside of work and will consider flexible working applications. If we can make it work – we will! Please click here for more information.","line-8":"Brief Description","line-9":"What will you be doing?Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands.","line-10":"About the role (External)","line-11":"1. Administration of rosters and timesheets.2. Accurately update systems, databases and records as required including opening/closing works orders where directed.3. Support the administration of the Assessment in The Line process.4. Set up and maintain efficient filing systems for the Section(s) paying particular attention to confidentiality where necessary and also those documents deemed to be safety critical.5. Undertake general office administration duties for the Section Manager using a range of knowledge and skills to provide effective support.6. Provide support and assistance to other Section Administrator positions as directed. In order to be successful in this role, we would like you to have/to be:· Experience of clerical support and office management· Excellent time manager· Knowledge of relevant IT systems· Ability to work on own initiative· Excellent interpersonal, communication and organisation skills We would also like but it isn’t crucial to have/to be:· Knowledge of operational railway environment","line-12":"How to apply (External)","line-13":"We are a Disability Confident Leader and want to make the most of the skills and talents disabled people bring to the workplace - skills and talents we need in our business Click here for more information Salary and benefits: · Salary: Starting at £21,000 Pro-rata annual leave entitlement (28 days) My benefits – our discounted online shopping site A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits Subsidies of up to 75% on rail and underground season tickets 75% discount on leisure travel A choice of contributory pension schemes 2 weeks paid reserve leave for our Armed Forces community Want to find out about what fantastic benefits we offer? Find out here Network Rail adheres to a structured pay framework, any salary offered will be within the pay range advertised. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Closing date: 28th December 2023. Late applications may not be accepted. Click ‘apply now’ to apply. Safe behaviour is a requirement of working for Network Rail. Applicants should be able to demonstrate their awareness of our safety vision We will endeavour to offer a diverse interview panel wherever possible."}