{"line-1":"Section Administrator [Track] - Cricklewood Depot","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands.","line-10":"About the role (External)","line-11":"Key Accountabilities:1. Administration of rosters and timesheets.2. Accurately update systems, databases and records as required including opening/closing works orders where directed.3. Support the administration of the Assessment in The Line process.4. Set up and maintain efficient filing systems for the Section(s) paying particular attention to confidentiality where necessary and also those documents deemed to be safety critical.5. Undertake general office administration duties for the Section Manager using a range of knowledge and skills to provide effective support.6. Provide support and assistance to other Section Administrator positions as directed.Job Skills, Experience and Qualifications:Essential· Experience of clerical support and office management· Excellent time manager· Knowledge of relevant IT systems· Ability to work on own initiative· Excellent interpersonal, communication and organisation skills Desirable· Knowledge of operational railway environment","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: Circa £22,620Closing date: 21st December 2023 - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}