{"line-1":"Strategic Planner x 2","line-2":"Location","line-3":"Swindon, GB","line-4":"Department Name","line-5":"Wales & Western Region","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network.Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. When you're part of our team, you matter to us, and you matter to millions. Watch our video to find out more!The Wales & Western region includes more than 2,700 miles of railway and we serve communities and businesses of Wales, the Thames Valley, West of England, and the Southwest Peninsula. Our ambition to be responsive to passengers and freight users drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing.About our people and the recruitment process - We’re an inclusive employer of choice and we welcome applications from everyone! As a Network Rail employee, you will enjoy a wide range of benefits! · Privileged staff travel - Leisure travel discount of 75% on all leisure travel and includes family members. · A subsidy of up to 75% on rail and underground season tickets if you travel to work on the train.· GWR ticket alliance – Heavily discounted all day passes for you and up to 5 friends and family to use across the GWR network (20 passes per year)· Benefits package including healthcare offers, a cycle to work scheme, discounted healthcare club membership, and a discounted offers and benefits including childcare, healthcare and online shopping site.· A range of Pension schemes to choose from· Effectively manage work-life balance with a 35hrs per week contract, hybrid working, and enhanced family friendly support. · 5 days paid volunteering leave.· 2 weeks paid reserve leave for the Armed Forces community.· In Wales and Western region, you will have the opportunity to join PROUD, our reward and recognition scheme where you can say thanks and recognise colleagues across the region who have demonstrated outstanding values and behaviours.To find out more about the benefits at Network Rail, click here. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"This role is at the heart of working with customers and stakeholders to plan for the future of our railway in the west, so that it continues to deliver what our passengers, freight users, and communities need. As Strategic Planner for your dedicated section of the route you will have the opportunity to work with a diverse and motivated group of internal and external stakeholders to identify and develop improvement strategies. You will have the opportunity to get intimately involved in new stations aspirations and potential service improvements, helping to advise on which and how to progress. You will also get to grapple with the big challenges including decarbonisation and levelling up – helping to set out how our railway can support the society we want to live in the short, middle, and long term. You will come to develop an excellent understanding of the areas we serve through your ability to build productive relationships across the board. You will be a key contact for influential external stakeholders including Subnational Transport Bodies and other strategic transport planning partners, helping them achieve their goals. You will be supported by a welcoming and inclusive strategic planning team, and become part of the wider Wales & Western Investment team, where you will work closely with sponsors to make sure that the strategic benefits you identify are translated into deliverable outcomes. You will find opportunities to grow both within the strategic planning team and in the wider investment team, and you will find that the breadth the role brings stands you in good stead for your next move. This is a fascinating and critical time for strategic rail planning, and you will have a real opportunity to shape the system for decades to come. Please note there are 2 job opportunities available","line-10":"About the role (External)","line-11":"Your Main Responsibilities will be to:1. Facilitation of cross-functional input to the development of route plans.2. Develop route plans for specified simple routes and contribute to development route plans for more complex routes, both from internal perspective (i.e. Operating Route / Area) and external perspective (i.e. by strategic route), based on needs and priorities of stakeholders to make sure that they are being met (e.g. regulatory outputs and customer commitments). 3. Undertake analysis work for capacity studies, and develop train service specifications for assessment by the Strategic Access Planning Unit (SAP).4. Work with the Senior Route Planner to undertake business appraisal of complex projects and route strategies. Identify industry benefits of rail capacity changes, journey time improvements etc. Specify and obtain demand forecasts.5. Work with sponsors of major asset renewal and enhancement schemes to develop in alignment with Route Strategies and the Capacity Utilisation study and develop, where appropriate, combined renewals and enhancement strategies. 6. Prepare reports on route plans, customer reasonable requirements (CRR) and Business plans.7. Assist with the Route’s input to the Business Plan, in particular the presentation of Route Plan material.8. Assist in identifying the needs and priorities of stakeholders and monitor to ensure that they are being met. Participate in liaison with internal and external parties. You will ideally have Degree or degree equivalent qualificationKnowledge of Rail Industry and Network Rail’s contractual commitments to customers and suppliersAnalytical skills and numeracyGood interpersonal and communication skills· Commercial and financial awareness, including understanding economic trade-off analysis· Knowledge of rail industry and commercial framework What could set you apartGood knowledge of the customers and assets of the routeKnowledge of estimating techniques, risk analysis and economic models and toolsKnowledge of project development and delivery processesKnowledge of Network Rail’s sponsorship and Investment processes and proceduresNot sure if you meet all the requirements? Let us decide.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582 to £40.029 per annum. Closing date: 18th December 2023. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. We are working in conjunction with the Cultural Fusion team. If you would like support with your application or interview please contact Wales&WesternCulturalFusion@networkrail.co.uk or visit the connect page: Wales and Western Cultural Fusion (sharepoint.com). For all other support please contact your HR Business Partner. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}