{"line-1":"Operative - Works Delivery Signalling x 2","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"CP WD S&T Sussex (Direct) (870143) G1","line-6":"About Network Rail","line-7":"Join Network Rail - Where your Work Matters Every Day! Looking for a meaningful career? Network Rail is the place to be. As an Operative, you’ll embark on a rewarding journey with us, playing a crucial role in running a safe, reliable, and efficient railway that serves communities and connects people and goods. Our vision is clear – Putting Passengers First. We’re committed to being a company that prioritises passengers and freight users, ensuring exceptional engagement, efficiency, and dependability. We strive to be industry leaders, a company that our employees are proud to work for. At Network Rail people matter. We value diversity and are dedicated to creating an even more inclusive organisation that better reflects the communities we service by 2024. By putting passengers first, our strategy ensures a more accessible and inclusive experience for all.","line-8":"Brief Description","line-9":"An introduction to WessexWe run one of the busiest parts of Britain's railway, with 212 million passenger journeys across our network every year. Waterloo station is the busiest in the country with around 330,000 passengers a day – equal to four full capacity crowds at the Twickenham stadium. ​ Our purpose is to connect people, businesses and communities, to support economic growth for all. I firmly believe it is only when we put passengers and freight at the heart of our operations, will we ensure our customers safely get to where they want to go on time, whilst keeping them informed and minimising service impacts during any potential disruption. We serve the South and the South West of Britain connecting cities and towns from our three managed stations at Waterloo, Guildford and Clapham Junction to places such as Bournemouth and Southampton. Our Infrastructure Maintenance Depots are based across the Wessex Route, from Central London, Woking, Portsmouth, Bournemouth, Salisbury & Yeovil. We are currently recruiting for the following locations: Woking, Guildford & FelthamWant to learn more about what it’s like working in our maintenance teams, please click here https://www.networkrail.co.uk/stories/whats-it-like-to-work-in-maintenance-engineering","line-10":"About the role (External)","line-11":"Operatives specialise in a range of disciplines but for this role you’ll become a specialist in Works Delivery (Signalling)Our Operatives work outside in all conditions, at all times of the year, day or night. You’ll be involved in demanding manual work, often with the need to transport kit across tricky terrain. Being safety focused, respectful of rules and a team player will be critical as you’ll often be working next to moving trains travelling at high speed.You matter to your teamThe team depends on you. You’re the one who shows up first and leaves last, who makes sure the van and equipment are checked and ready for every shift, and who drives the team from site to site. Every day you’ll support your team in maintaining equipment and will provide lookout duties to keep the whole team safe.You matter to usYour commitment to self-development and continuous learning is hugely important in this role and we'll provide you with all the training to develop both technical skills and non-technical skills. If you’re joining us from another industry, the structured training will give you the skills and confidence to move into a rewarding career in rail. Today’s operatives are tomorrow’s Technicians and Team Leaders, and we offer a clear career path for you.Your skills matterOur Operatives play a key role in our maintenance teams. You don’t necessarily need rail experience, but you do need to show how your transferrable skills meet the following: Teamworking - our maintenance teams depend on each other and you’ll be able to work closely with the team to deliver safe and efficient work delivery.Communication - you’ll have good communication skills so you can work safely and effectively.Proactive planning - being punctual, having the van and equipment ready and anticipating the needs of the team are essential to keeping our passengers and freight moving.Working under pressure - working outdoors in all conditions, and with trains passing close by means you’ll need to remain calm under pressure.Following rules and instructions - it is important that you understand and respect the rules, but also feel confident to challenge if you see a situation is unsafe.Willingness to learn - you’ll consistently develop your skills and competencies relevant to your discipline, keeping up to date with new standards, procedures, and instructions. It matters that this is the right role for you. Here’s some additional information which might help you. Shifts Operative roles involve a changing shift pattern including days, nights, and weekends.Outdoor working - Our Operatives work outside in all weathers and so you’ll be comfortable working in different conditions.· Safe working - offers of employment are subject to drug and alcohol testing and passing of the relevant medical assessment and BPSS pre-employment checks. This will include a hearing and eyesight examination.Driving - As an Operative you’ll also need a driving licence (category B) so you can drive Network Rail vehicles.Commute times – You’ll also need to be within a 60-minute commute of the location that you’re applying for. Essential Criteria· Experience of working in an environment where safety is vital· Willing and able to work shifts, including days, nights and weekends· A team player· Keen to develop new skills· Good communication skills, both in person and in writing· Meet the required benchmark for application screening questions (all applicants)","line-12":"How to apply (External)","line-13":"As part of your initial application, all applicants are required to answer a series of Yes/No questions, relevant to the role they are applying for. In addition, applicants are required to complete 2 more detailed questions relating to your interest and knowledge of the role, relevant skills, experience, and behaviours that we are looking for. You should limit these responses to a maximum of 200 words so make every word count! Remember to read all the questions carefully and take your time when thinking about your responses. Salary The salary offered will be dependent on the specialism you are offered IMC25 £34,244 We can offer a rewarding career and excellent benefits, including: · 28 days annual leave (plus bank holidays) · Bonus scheme · Excellent choice of pension schemes · 75% subsidy on rail season tickets (including London Underground) · 75% off leisure rail travel for you and your family · ‘my benefits’ – our discounted online shopping site · Training, development and employee assistance programme available · Two weeks paid reserve leave for our armed forces community · 5 days paid volunteering leave Been referred by a friend, then please complete this form Closing date: 7th December 2023 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Drugs and Alcohol Standard: All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}