{"line-1":"Customer Service Assistant","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"OE Kent London Bridge - Non Qual Exp (752709) G5","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To provide a customer focused presence within the station on a day to day basis to deliver a first class and safe station environment for Train Operating Companies (TOCs), passengers and retailers.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Provide a highly visible point of contact for station users providing customer service to all, including visitors, contractors, retailers, TOC’s and customers travelling throughout the station. 2. Undertake regular station checks including contractor compliance, security, safety and equipment in accordance with relevant company standards and procedures, completing the relevant paperwork for audit purposes. 3. Respond to and record emergencies and incidents involving the general public and industry partners, as required. 4. Provide a point of contact for the reporting of faults within the station, maintaining appropriate records, reviewing and closing actions as required. 5. Actively assist and provide information to customers travelling throughout the station. 6. Check contractors have relevant risk assessments and method statements prior to issuing Permit to Work. 7. In liaison with customers, external authorities and regulators, implement plans to prevent and manage criminal activity on the station, including discouraging and preventing unauthorised persons from entering or remaining on the station. 8. Provide a proactive role in dealing with hazards or unsafe conditions, checking that all such occurrences are reported correctly. 9. Fulfil allocated duties as prescribed within Emergency Plans. Job Skills, Experience and Qualifications: Essential · Command of English language, both written and oral · Experience of working in a customer facing environment · Confidence to deal with different types of situations assertively · Experience of working effectively as part of a team Desirable · Educated to GCSE or equivalent in English and maths","line-12":"How to apply (External)","line-13":"Salary £24440+ Location allowance Been referred by a friend, then please complete this form Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 15th December 2023 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Drugs and Alcohol Standard: All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}