{"line-1":"Train Delay Attributor - York IECC (x3 Roles)","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Your decisions make all the difference...As a train delay attributor, you’ll be passionate about providing great customer service, so when trains are delayed passengers, train and freight operating companies are fully informed of the situation in a timely manner. Our attribution team monitors real time train operations and allocates reasons for any delays.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.","line-10":"About the role (External)","line-11":"Your investigative skills matter. As a train delay attributor you’ll record, report and support solutions around train delays onyour part of the rail network, helping to keep millions moving every day. You’ll have a keen eye for detail as you’re working with delay data, and you’ll also be able to develop a good rapport with a wide range of people across your part of the network as you work to find out the root cause of each delay. You’ll also be able to deal with competing deadlines, confirming responsibility of each delay with both accuracy and pace. And if you make the grade then you can look forward to a rewarding and fulfilling career with acompany that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. When delays happen, you’ll build an accurate picture of the reasons behind them. Using data and working with our signaller community and other colleagues across the railway you’ll get to the heart of each delay. Having recognised the situation, you will then use this to create accurate reports and attribute the reasons for the delays. If train reporting procedures fail, you’ll make a difference, from advising managers to agreeing the use of alternate train time information. Your skills matter You don’t need rail experience but you do need to show how your transferrable skills meet the following. Data skills - You'll need strong analytical skills and be confident in working with data.People skills - You’ll be able to build strong working relationships and manage different stake holder requirements.Agility – With many competing deadlines and the demand for quick and accurate resolutions, you’ll be experienced in managing your time with agility and flexibility.IT skills – You’ll be using bespoke IT systems and Windows based applications and so you’ll be confident in using technology.Confident decision making – making accurate and informed decisions is key in this role and you’ll be confident in standing by the decisions you make.Operations knowledge- The ability to develop a good understanding of railway and infrastructure operations and have a good knowledge of your local area are important for this role.Presentation skills – Reporting is a key part of the Train Delay Attributor role and so you’ll be able to get your message across clearly, accurately and conciselyShift working – this role involves shift working and to you’ll be willing and able to work on a shift basis. This role involves days, nights and weekend working and the job is safety critical. Offers of employment are subject to drug and alcohol testing and passing of the relevant medical assessment and BPSS pre-employment checks. This will include a hearing and eyesight examination.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £41,883x3 Roles available Closing date:12th December 2023 - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}