{"line-1":"Section Planner - 12 month secondment","line-2":"Location","line-3":"Bickley, GB","line-4":"Department Name","line-5":"OE Telecoms Kent Direct (920201) G1","line-6":"About Network Rail","line-7":"At Network Rail, we’re part of a large family serving millions of passengers and freight users throughout the UK every day. Our service impacts millions of people and we strive to become more efficient as we enhance, maintain, and operate our network. We provide rapid access along busy commuter routes to our seven cities, servicing the varied needs of our business and leisure commuter services, including cross border services and rural services. We have up to 50 freight services operating every day and we are steadily building capacity for this to grow. Our ambition to be responsive to passengers and freight users, drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues, and protecting safety and wellbeing. Our colleagues are encouraged to work flexibly as we know that busy lives don’t always fit around a traditional working pattern, if you need flexibility to complete your role just let us know and we will do our upmost to help you to invest in your career with us while balancing other aspects of your life. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here.","line-8":"Brief Description","line-9":"Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.","line-10":"About the role (External)","line-11":"· Plan and optimise all agreed work activities for the section.· Accurately update systems, databases and records as required.· Produce Safe System of Work plans.· Submit green zone access and isolation requests.· Produce draft quarterly plans.· Manage weekly Plan-Do-Review meetings.· Represent Section Managers at planning meetings.· Collate and maintain infrastructure maintenance records.· Administration of rosters and timesheets.· Support the administration of the Assessment in The Line process.· Set up and maintain efficient filing systems for the Section(s) paying particular attention to confidentiality where necessary and also those documents deemed to be safety critical.· Undertake general office administration duties for the Section Manager using a range of knowledge and skills to provide effective support. Job Skills, Experience and Qualifications:Essential · Work Plan production and resource optimisation skills· Scheduling profile in work planning/scheduling system· Core Planning Skills Level 2· Knowledge of access and possession processes and systems· Safe System of Work Planning Process and System· Good interpersonal, communication and organisational skills· Experience of clerical support and office management· Excellent time manager· Knowledge of relevant IT systems· Ability to work on own initiative Desirable · Knowledge of operational railway environment","line-12":"How to apply (External)","line-13":"Salary: Circa £32,000 Closing date: 14th December 2023 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Click ‘apply now’ to apply. Been referred by a friend, then please complete this form The important stuff In return, we can offer a rewarding career and excellent benefits, including: · 28 days annual leave (plus bank holidays) · Bonus scheme · Excellent choice of pension schemes · 75% subsidy on rail season tickets (including London Underground) · 75% off leisure rail travel for you and your family · ‘my benefits’ – our discounted online shopping site · Training, development and employee assistance programme available · Two weeks paid reserve leave for our armed forces community · 5 days paid volunteering leave Been referred by a friend, then please complete this form We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Note – Drugs and Alcohol Standard All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role (a role which requires PTS certification or a Key Safety role on all Network Rail Managed Infrastructure) will be enforced."}