{"line-1":"Senior Ecologist","line-2":"Location","line-3":"Glasgow, GB","line-4":"Department Name","line-5":"CC Programme Manager Perth Indirect (862090) G3","line-6":"About Network Rail","line-7":"At Network Rail, our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. Watch our video to find out more! Scotland's Railway is part of this large family and it covers a large geographical area from the Borders to Thurso at the far tip of the North East of Scotland, accounting for almost 20 per cent of the UK rail network. We provide rapid access along busy commuter routes to our seven cities, servicing the varied needs of our business and leisure commuter services, including cross border services and rural services. We have up to 50 freight services operating every day and we are steadily building capacity for this to grow. Our ambition to be responsive to passengers and freight users, drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues and protecting safety and wellbeing. Our colleagues are encouraged to work flexibly as we know that busy lives don’t always fit around a traditional working pattern, if you need flexibility to complete your role just let us know and we will do our upmost to help you to invest in your career with us while balancing other aspects of your life. We're also a Disability Confident Leader employer and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"We are in search of a dedicated individual to take the reins in providing unparalleled support to Scotland’s Railway’s internal and external delivery teams. In this role, you will not only lead the provision of Ecological expertise, but also offer crucial guidance to seamlessly integrate Network Rail standards, policies and strategies with environmental best practice, legal requirements and emerging innovation. Your role will be instrumental in ensuring the delivery of cost effective projects, against a robust ecological specification, showcasing your commitment to professional stewardship of our lineside environment and the biodiversity it contains. Join us in driving continuous improvement of our Environmental Management Systems and the Ecology discipline and be a key player in shaping a sustainable future.","line-10":"About the role (External)","line-11":"We are in search of a dedicated individual to take the reins in providing unparalleled support to Scotland’s Railway’s internal and external delivery teams. In this role, you will not only lead the provision of Ecological expertise, but also offer crucial guidance to seamlessly integrate Network Rail standards, policies and strategies with environmental best practice, legal requirements and emerging innovation. Your role will be instrumental in ensuring the delivery of cost effective projects, against a robust ecological specification, showcasing your commitment to professional stewardship of our lineside environment and the biodiversity it contains. Join us in driving continuous improvement of our Environmental Management Systems and the Ecology discipline and be a key player in shaping a sustainable future. Key Accountabilities · Lead and direct a team of Ecologists to undertake a range of projects that directly influence biodiversity and habitat management on the railway and adjacent land. · Oversee and provide specialist ecological advice and guidance to managers, engineers, planners and others associated with railway inspection, maintenance and renewal operations, plus offsetting and biodiversity enhancement schemes. · Liaise with senior managers to establish the remit for, programme and deliver the Scotland-wide habitat condition survey and maintain the habitat management plan database. · Lead the provision of weekly and periodic project updates and deliver progress reports including safety, finance, risks and issues, to the programme management team. · Write clear, concise surveys, map target notes, and have the ability to compile ecological scoping documents in line with relevant Network Rail and external environmental standards in a format suitable for the Contracts & Procurement tendering purposes. · Liaise with supply chain partners and internal delivery teams on ecological work prescriptions, site checks, resolution of challenges and implementation of best practice. · Liaise with the Arboricultural team on project surveys and site specific scoping to agree appropriate solutions to comply with railway requirements, current legislation and best practice. · Develop innovations to yield efficiencies and improve railway habitats and biodiversity. · Build external relationships and act as a professional figurehead for Ecology provision and expertise with statutory bodies, regulators and stakeholders. Essential · Full/associate/graduate membership of Chartered Institute of Ecology and Environmental Management (CIEEM) (depending on experience) · Experience in delivering projects to a specified timescales and within agreed budget parameters · Experience in managing teams to deliver within prescribed timescales · Experience in interpreting and presenting gathered survey data and delivering Ecologist reports that fulfil the varied remits · Knowledge of rail maintenance delivery process and completing rare species surveys · Good interpersonal, influencing, communication and organisation skills and be a task orientated leader · Full understanding of UK and European wildlife legislation and best practice guidance experience · Comprehensive field experience with ability to identify Ecological constraints during site visits · A relevant higher degree in Ecology, Zoology, Biological Sciences, or other relevant Environmental Sciences · In-depth experience of Ecologist practices within the railway environment is essential Desirable · Working knowledge of CDM Regulations · Knowledge and experience of operational railway environment · Knowledge of ISO 14001 Environmental Management Standard · Experience attending client meetings and working with multi-disciplinary teams · Full UK driving licence · A good working knowledge of Network Rail IT systems and mapping tools · Previous professional Ecology experience. · Individual’s Protected Species Licences (NatureScot / Natural England / Natural Resources Wales). · Proven record of relevant CPD events attended.#LI-SY1","line-12":"How to apply (External)","line-13":"Salary: ££46,701 - £52,539 Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 21/12/2023. Late applications will not be accepted. Please note we will be in touch with candidates successfully shortlisted for interview at the beginning of January. Click ‘apply now’ to apply. We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}