{"line-1":"Project Engineer","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out. We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Project Engineer [E&P] to join our team to manage design and construction activities for allocated projects. Role and Responsibilities may include but are not limited to: 1. Implement Network Rail systems and procedures to maintain a cost effective, high quality, safe and environmentally responsible approach to design, construction, commissioning and other technical activities on relevant projects, compliant with all relevant legislation. Liaise with regulators and others as appropriate. 2. Engineer Projects to the standards and specification of Network Rail, allocated design and construction contracts include reference to and are compliant with appropriate Railway Group and Network Rail Company standards, formal specifications and procedures. 3. Manage all engineering activities so that they result in schemes that are affordable and meet programme requirements in a safe and environmentally responsible manner for time, cost and quality. 4. Maintain the use of relevant techniques and procedures of quantified and qualitative risk assessment and HAZOP analysis to allocated projects and manage the environmental aspects of allocated projects in accordance with Network Rail’s environmental policy. 5. Monitor design and specialist consultants and contractors. 6. Provide project management advice in respect of all construction activities, including testing and commissioning and site supervision. Manage the design and/or construction elements of relevant projects meet the requirements of current legislation, including construction design management (CDM) regulations. 7. Internal and contractor’s design/construction/specialists personnel are competent. 8. Undertake reviews of design and/or construction activities. Arrange audits of contractors monitoring safety, environment and quality of design, construction, testing and commissioning and management systems is adequate. 9. Carry out the duties of designated project engineer (DPE) for specific projects. 10. Identify and share best practice across the various project teams.","line-10":"About the role (External)","line-11":"Essential · Relevant experience in engineering disciplines, ideally with involvement in construction and design projects across multi discipline areas. · Technical qualifications to HNC/HND or equivalent GNVQ level. · Knowledge of quality assurance. · An understanding of the arrangements required for the independent assessment of work. · CDM, risk assessment, engineering management competency. Desirable · Membership of a relevant professional body with chartered status and/or educated to degree level. · Knowledge of structuring safety cases in support of projects. · An appreciation of environmental issues in engineering works. · Six Sigma Yellow Belt. · Project safety management experience · Yellow book course.","line-12":"How to apply (External)","line-13":"Salary and benefits: • Salary of £43,588 - £49,037 (Band 4.C) depending on skills, qualifications and experience • 28 days annual leave entitlement plus bank holidays • My benefits – Our discounted online shopping site • A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits • Subsidies of up to 75% on rail and underground season tickets • A choice of contributory pension schemes • 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 19 December 2023 and late applications will not be considered ** Oh, and by the way… We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you! We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications. Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. If you like the sound of all that, we’d love it if you could submit your application online."}