{"line-1":"Senior Programme Manager - IP","line-2":"Location","line-3":"Manchester, GB","line-4":"Department Name","line-5":"IN TRU - Project Integration (457120) G2","line-6":"About Network Rail","line-7":"Key InformationRole: Senior Programme Manager (IP)Salary: £85,395 per annum to £96,070 per annumCar Allowance: £6,000 per annumLocation: ManchesterContract Type: Permanent28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak tickets. Employees will also be entitled to 75% discount on season tickets.Network Rail Benefits – To find out about what benefits we offer, click hereOur colleagues are encouraged to work flexibly as we know traditional working patterns don’t always fit, we’ll do our best to help and invest in your career with us, whilst you have a healthy work life balance. About Network RailOur passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry.In being a part of Network Rail, you’re not only part of an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers.https://network-rail.wistia.com/medias/e9gfrx2prz We have an exciting opportunity to join Transpennine Route Upgrade as Senior Programme Manager (IP).Transpennine Route UpgradeThe Transpennine Route Upgrade (TRU) is a Programme of activities that is improving the railway between York and Manchester via Leeds and Huddersfield.​​​Stretching across the North of England, this key 76-mile Transpennine railway serves 23 stations, crosses over and dips under 285 bridges and viaducts, passes through six miles of tunnels, and crosses over 29 level crossings.Proposed improvements as will deliver a hard-working, reliable railway for passengers, allowing for trains with more seats, more services and faster journey times.​ For more information visit www.theTRUpgrade.co.uk","line-8":"Brief Description","line-9":"To develop and deliver a programme of work in a safe and environmentally responsible manner to cost, time and quality in line with Company Standards procedures, PACE, P3M and corporate governance.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are: 1. Lead a Programme team to deliver the programme objectives. 2. Achieve the efficiency savings as agreed with the Programme Integration Director. 3. Develop an appropriate strategy for the development and delivery of the Programme work scope. 4. Deputise for the Programme Integration Director 5. Manage / deliver the TRU development portfolio (circa £0.5bn) identifying delivery mechanism within the programme to integrate these works efficiently. 6. Lead cross TRU programme integration and lead the resolution of conflicts 7. Identify priority opportunities within the programme and lead promotion and sharing of best practice between programmes. 8. Develop and improve relationships with key stakeholders and suppliers. 9. Develop and manage the Programme Integration and development team, monitoring adequate resources available to deliver a flexible, competent, skilled and effective workforce at all times. 10. Manage configuration control of core system documents ensuring consistency in programme level baselines 11. Lead compliance in corporate health, safety, quality and environment processes for the Programme. 12. Direct the timely assignment of, and thereafter, discharge of, Construction Design Management (CDM) duties for all development projects in the Programme. 13. Undertake audit of programme and project documentation, activities, processes and systems. Lead the communication of key issues for the function. 14. Comply with the Investment Competence Framework. We need you to have: · Member of a relevant professional body with chartered status and/or educated to degree level. · Relevant experience in the successful management of major programmes of work in the construction and/or rail industries. · Strong commercial focus and financially astute. · Knowledge of the principles of investment processes and procedures. · Knowledge of the principles of Health & Safety, quality and environment legislation and best practice. · Excellent communication with demonstrable delivery of leadership and behavioural change within a large organisation. It would be advantageous if you have: · Six Sigma Champion. · Knowledge of/experience in the UK railway industry · Successfully completed MSP (Managing Successful Projects) to practitioner level","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } External how to apply: We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. Salary: starting at £85,395 to £96,070 per annum. Car allowance: £6,000 per annum. Closing date: 11th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}