{"line-1":"Assistant Commercial Manager - C&P","line-2":"Location","line-3":"Leeds, GB","line-4":"Department Name","line-5":"IN TRU - Central Delivery (457330) G2","line-6":"About Network Rail","line-7":"***All applications, Internal and External will need to be made via Tribepad. Any applications made in Oracle unfortunately will not be considered. Please apply via: https://careershub.networkrail.co.uk/members/?j=2590****Key InformationRole: Assistant Commercial Manager Salary: Circa £27,820 per annum, dependent on experienceLocation: LeedsContract Type: Permanent28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak tickets. Employees will also be entitled to 75% discount on season tickets.Network Rail Benefits – To find out about what benefits we offer, click here🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"As an Assistant Commercial Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have an interesting and varied role, providing commercial support as required in accordance with established Network Rail policy. Day-to-day, you'll operate effectively in multi-disciplined teams, supporting both the Commercial Manager and project team. You will assist the Commercial Manager in pre-contract activities and evaluating and agreeing the value of payments and variations for a variety of works throughout the Route.","line-10":"About the role (External)","line-11":"We need savvy, commercial team players to join our Transpennine Upgrade Team. You will be capable of working collaboratively with our stakeholders to deliver on time with a key eye for detail. If you are a highly motivated individual with a passion for success, driving growth and improvement, and embodying our core values, we would love to hear from you.Some of the key accountabilities of this role are:1. Assist in the measurement and evaluation of the commercial value of payments, monitoring the correct certification of works prior to authorisation in accordance with contractual obligations.2. Assist with the reporting on all commercial aspects of allocated projects.3. Assist in the preparation of contract specification and pre-tender documentation.4. Assist with the general procurement/commercial management on a variety of contract categories.5. Ability to self-manage own workload and communicate with various stakeholders across the portfolio. 6. Proven communication and diplomacy skills with the ability to quickly adapt within a fast-paced environment.We need you to have:· Ability to work to deadlines· Good problem solving skills· Basic level of commercial awareness· Basic negotiation skills with ability to influence decision making· Computer literate including ability to utilise in-house and external software It would be advantageous if you have:· Able to effectively communicate at the appropriate levels, both internally and externally· Membership of an appropriate professional organisation, or working towards membership· Experience of using electronic sourcing and/or procurement systems.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } ***All applications, Internal and External will need to be made via Tribepad. Any applications made in Oracle unfortunately will not be considered. Please apply via: https://careershub.networkrail.co.uk/members/?j=2590****We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk. Network Rail Benefits - To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. This vacancy is Band 5, salary: Circa £27,820 per annum, dependent on experience. Closing date: 20th December 2023. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}