{"line-1":"Senior Arboriculturist","line-2":"Location","line-3":"Glasgow, GB","line-4":"Department Name","line-5":"CC Programme Manager Perth Indirect (862090) G3","line-6":"About Network Rail","line-7":"At Network Rail, our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We’re an organisation where people matter. Watch our video to find out more! Scotland's Railway is part of this large family and it covers a large geographical area from the Borders to Thurso at the far tip of the North East of Scotland, accounting for almost 20 per cent of the UK rail network. We provide rapid access along busy commuter routes to our seven cities, servicing the varied needs of our business and leisure commuter services, including cross border services and rural services. We have up to 50 freight services operating every day and we are steadily building capacity for this to grow. Our ambition to be responsive to passengers and freight users, drives us every day and we're empowered to do the right thing for those who use the rail network. We actively challenge unsafe practices and take responsibility for addressing risks, resolving issues and protecting safety and wellbeing. Our colleagues are encouraged to work flexibly as we know that busy lives don’t always fit around a traditional working pattern, if you need flexibility to complete your role just let us know and we will do our upmost to help you to invest in your career with us while balancing other aspects of your life. We're also a Disability Confident Leader employer and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"We are in search of a dynamic individual to take the reins in providing unparalleled support to Scotland’s Railway’s internal and external delivery teams. In this role, you will not only lead the provision of Arboricultural expertise, but also offer crucial guidance to seamlessly integrate Network Rail standards, policy and strategies with industry best practice, the law and emerging innovation. Your role will be instrumental in ensuring the delivery of cost effective projects, against a robust specification, showcasing your commitment to professional stewardship of our national railway tree inventory. Join us in driving continuous improvement in tree and lineside management and be a key player in shaping a sustainable future.","line-10":"About the role (External)","line-11":"Key Accountabilities · Lead and direct a team of Arborists to undertake a range of railway tree and vegetation management projects. · Oversee and provide specialist arboricultural advice and guidance to railway managers, engineers, operations, seasonal teams, planners and others associated with the undertaking and completion of tree surveys, tree planting schemes, and tree management decisions. · Liaise with senior managers to establish the remit for, programme and deliver the Scotland-wide tree condition survey / database, Ash Dieback Action Plan and autumn season risk assessments. · Lead the provision of weekly and periodic project updates and deliver progress reports including safety, finance, risks and issues, to the programme management team. · Write clear, concise surveys, map target notes, and have the ability to compile tree and vegetation management scoping documents in line with relevant Network Rail and industry standards, in a format suitable for the Contracts & Procurement tendering purposes. · Liaise with supply chain partners and internal delivery teams on tree specific work prescriptions, site checks, arboricultural best practice and safe tree work practices. · Liaise with the Ecology team on project surveys and agree appropriate tree and site specific prescriptions or strategies to comply with current legislation and best practice. · Develop innovations to yield site safety, efficiency and train service performance improvements. · Build external relationships and act as a professional arboricultural figurehead for Scotland’s Railway with statutory bodies, local authorities and stakeholders. Essential · Experience in delivering projects to a specified timescales and within agreed budget parameters · Experience in managing teams to deliver within prescribed timescales · Experience in interpreting and presenting gathered survey data and delivering Arboriculture reports that fulfil the varied remits · Knowledge of rail maintenance delivery process and techniques for vegetation removal · Good interpersonal, influencing, communication and organisation skills and be a task orientated leader · Comprehensive field experience · A relevant qualification in arboriculture i.e. National Certificate of Arboriculture or Royal Forestry Society Diploma or Level 3 City & Guilds · In-depth experience of Arboricultural practice within the railway environment is essential · Demonstrable knowledge of the identification and implications of structural weakness, decay, pest diseases and the effects of tree root systems on rail infrastructure and adjoining land · Working knowledge of CDM Regulations Desirable · Knowledge and experience of operational railway environment · Knowledge of ISO 14001 Environmental Management Standard · Membership of a relevant professional body · Experience attending client meetings and working with multi-disciplinary teams · Full UK driving licence · A good working knowledge of Network Rail IT systems and mapping tools · Undergraduate or Masters degree level in Arboriculture or Forestry. · ICF Chartered Arboriculturist or Forester. · ISA Master Arborist. · VETcert Veteran Tree Certification. · Competency certification to allow safe working at height from ropes. · Personal Track Safety Competency holder.#LI-SY1","line-12":"How to apply (External)","line-13":"Salary: ££46,701 - £52,539 Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 21/12/2023. Late applications will not be accepted. Please note we will be in touch with candidates successfully shortlisted for interview at the beginning of January. Click ‘apply now’ to apply. We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs and Alcohol Standard: Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application."}