{"line-1":"Supervisor (B&C) - Derby Mercia House","line-2":"Location","line-3":"Derby, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Manage, direct, organise and motivate the teams so that work is undertaken safely, efficiently and to the relevant standards. Undertake and direct inspection, faulting, maintenance and renewal work as allocated.","line-10":"About the role (External)","line-11":"Duties and Responsibilities: 1. Establish and maintain appropriate safety arrangements for staff under your control including Contractors.2. Carry out work safely and in accordance with the safe systems of work procedures, method statements or other relevant instructions.3. Undertake work and associated duties in accordance with standards as directed.4. Undertake and direct work activities in a safe and efficient manner and in accordance with all relevant standards.5. Supervise and check the quality of work undertaken and confirm assets are compliant to standards.6. Deliver and maintain an effective service to customers and key stakeholders.7. Prepare work and resource specifications, scopes of work, and method statements including Safe System of Work Plans.8. Check that the staff under your control have the appropriate and valid competencies.9. Check that vehicles, plant, tools, equipment and materials under your control are fit for use and are used/stored and disposed of correctly. 10. Manage the allocation of resources.11. Accurately report all work completed/not completed and produce/maintain records as required.12. Assist in the monitoring and review of staff competence and welfare.13. Contribute to your own development and that of others.14. Manage the development of individuals and the engagement of the team15. Adhere to company policies and procedures.Experience, skills, knowledge, competencies and qualifications: Essential· Trained and where appropriate, qualified in the relevant trade.· Experience of arranging and implementing safe systems of work.· Experience of organising and controlling the safe and efficient delivery of work.· Experience and ability to lead, motivate and direct a multi-skilled team.· Able to demonstrate, promote and embed safe working behaviours within the team.· Able to · Able to communicate effectively verbally and in writing.· Experience in the servicing and repair of either building fabric or building plant and equipment.· Knowledge of relevant standards, procedures and instructions.· Hold and retain competencies relevant to this post, required by business need.· Able and willing to drive vehicles as required by business need.· Computer literate.Desirable· Membership of CITB Construction Skill Certification Scheme.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: TBCClosing date: 19th December 2023 - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}