{"line-1":"Communications Manager","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"Southern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Network Rail’s Southern region works with train operators to serve passengers and freight customers from Devon in the west, to Kent in the east, and the huge commuter markets of South London. Our railway links major towns and cities and serves channel routes to Europe, as well as Gatwick and Southampton airports. The region is also responsible for some of the busiest stations in the country including Waterloo, London Bridge, Victoria, as well as Cannon Street, Clapham Junction, Charing Cross and Guildford.We operate the busiest and most congested rail lines in the country and are dedicated to putting passengers first. Key to this is effective communications and showing people that we care, highlighting the work we do to enable safe and unincumbered travel. At the heart of our work is the communities we serve and if you join us, you will support the delivery of this important mission.About the roleWe are looking for a Project Communications Manager to join our team in Wessex route, part of the Southern region at Network Rail. We’re investing heavily to renew older parts of our railway, so that passengers can travel without delays. To complete our upgrades, we need to close sections of the railway from time to time, and it’s essential we communicate this clearly, concisely and in good time.Our ideal candidate will have a proven track record in delivering campaigns and be able to manage and deliver consistent and effective communications strategies for our key projects. You will be great at building relationships. Internally you will work closely with our project managers to untangle and explain the complex work they’re delivering, so that everyone understands the benefits of our projects. Externally you will work across the industry with train operating companies to deliver a clear and consistent message, with advice on alternative travel options. We are looking for someone comfortable dealing with agencies, you will know instinctively what messaging will work as we try to modify the travel plans of our passengers and will enjoy promoting our work via traditional and social media. Securing the support of the communities we serve is critical to enabling us to close the railway and managing the resulting disruption, without tarnishing our reputation. You will need to be able to identify opportunities to win the hearts and minds of influential stakeholders so that our project teams can deliver their work. Based in Blackfriars, London, you will report to the Senior Communications Manager as part of the External Affairs team delivering project communications services to the Communications Directorate.","line-10":"About the role (External)","line-11":"Key Accountabilities:1. Develop and implement communications strategy on projects which present reputational risks or opportunities for the business.2. Produce and manage detailed communications plans, detailing activities and resources necessary for implementation and providing recommendations for continuous improvement / best practice.3. Interface with key external audiences (across community relations, media and public affairs) so that these relationships are appropriately managed, in consultation with relevant external communications teams in Government and Corporate Affairs.4. Where required, provide direct management and development of a team including carrying out regular 121’s, appraisals, objective setting and performance monitoring.5. Build relationships and provide direction / influence to senior project managers and external industry parties / funding organisations where appropriate.6. Provide guidance on all external communications activity undertaken by project personnel including Project/ Programme Director / Project Managers/ Scheme Sponsors, delivering consistency with the approved G&CA communications strategy and in accordance with Network Rail’s corporate policies.7. Assist with delivery of Network Rail’s corporate internal communications programme and act as a conduit for material/information for corporate comms channels.8. Check that all branding used on the project complies with Network Rail’s corporate policy on branding, visual identity and image.9. Produce regular reports on all communications activities on the project, including budget. Job Skills, Experience and Qualifications:Essential· Significant experience within corporate communications· Proven track record in public relations activity in a high profile organisation· Excellent writing skills and ability to think strategically· Excellent influencing skills and ability to build relationships with internal and external stakeholders· Thorough knowledge of the media and how it operates Desirable· Educated to degree level· Experience of working within an agency environment","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary and Benefits: Salary £35,582 to £40,029pa dependent on skills and experience of successful candidate.A London weighting of £3,270pa28 days annual leave entitlement 5 Volunteer days per annumMy benefits – our discounted online shopping siteA range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefitsSubsidies of up to 75% on rail and underground season tickets75% discount on leisure travel A choice of contributory pension schemes2 weeks paid reserve leave for our Armed Forces communityLocation: Blackfriars, LondonType: PermanentClosing date: 11th December 2023 - Late applications will not be accepted. Please note, interviews will be taking place w.c. 18th December 2023Been referred by a friend, then please complete this formClick apply now to apply.Remote working opportunity! This role requires working in the office 3 days a week Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information#LI-DB1"}