{"line-1":"Station Control Assistant","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"London Euston Managed Station","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To provide a comprehensive monitoring and control of the stations’ systems, providing accurate information to all interested parties as appropriate.Please Note: This role requires the incumbent to hold security vetting, no start date or hire should be progressed until the required vetting clearance has been obtained. For further information, please contact NationalSecurityVetting@Networkrail.co.uk (Delete before advertising)","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Provide regular updates on train and station services to all station users using the information systems available.2. Update station staff and Train Operating Companies (TOCs) on potential service disruption.3. Provide public safety and security information to all station users on a regular basis.4. Operate and maintain station systems and equipment including fire panels, CCTV, car park equipment and customer help points.5. Report equipment faults to the appropriate system owner/maintainer in a timely manner, maintaining a record of each fault occurrence.6. Liaise with Signalling Centres and TOCs regarding train services, maintaining a log of occurrences.7. Assist the station team and perform other duties in light of operational requirements.8. Fulfil allocated duties as prescribed within Emergency Plans.Job Skills, Experience and Qualifications: Essential· Command of English language, both written and oral with a clear and concise speaking voice· Experience of working in a customer facing environment· Experience of working effectively as part of a team· Experience of processing and prioritising complex information in a time-pressured environment Desirable· Ability to demonstrate a proactive concern for accuracy and clarity· Understanding of train operating companies services and UK railway geography","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £26,440.00 - £35,189.00 dependent on experience.Closing date: 7th December 2023 - Late applications will not be accepted. Click apply now to apply.What does our recruitment process look like? Once you have applied, our Recruitment Specialist will look at your CV.If your experience matches what we're looking for, you'll be invited to an interview.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}