{"line-1":"Technician [Signalling Maintenance] - Doncaster Mallard House","line-2":"Location","line-3":"Doncaster, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"You’ll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you’ll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you’ve even considered a career in rail. We’re focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contractWe have multiple opportunities available.","line-10":"About the role (External)","line-11":"Technicians specialise in a range of disciplines and for this role you’ll become a specialist in Signalling & Telecoms. You’ll be working with equipment including signals that control when trains can run, level crossings, and points systems. With your willingness to learn, you’ll develop a huge range of technical skills across a range of manual, electrical and digital equipment.Our technicians work outside in all conditions, at all times of the year, day or night. You could be involved in demanding manual work, often with the need to transport kit, across tricky terrain. Being safety focused, respectful of rules and a team player will be critical as you’ll often be working next to moving trains travelling at highspeed.You matter to your teamA natural team player,you’ll also be able to lead the team when asked by the team leader. You’ll use your skills to deliver work safely and will check the team has the right competencies to meet our strict safety standards. You’ll also be a role model for safe working behaviours and be confident to challenge any potential risks to safety, so that everyone gets home safe every day. You matter to usToday’s technicians can go onto become tomorrow’s team leaders. Your commitment to self-development and continuous learning is hugely important in this role and we'll provide you with all the training to develop both technical and non-technical skills. If you’re joining us from another industry, the structured training will give you the skills andconfidence to move into a rewarding career in rail. Your skills matterOur technicians play a vital role in our maintenance teams. You don’t necessarily need rail experience, but you do need to show how your transferrable skills meet the following:Leadership – You’re able to lead, motivate and direct a team for safe and efficient work delivery.Effective communicator – You’ll need strong communication skills and be able to deliver clear instructions to the team and other colleagues.Technical skills –You’ll have knowledge and experience of inspection, faulting, maintenance and renewal techniques in the discipline that you are applying for.Safety – You consistently role model safe behaviours, can arrange and implement safe systems of work, and are confident to challenge if you think a situation is unsafe.Problem solver – You’ll be persistent in finding safe and effective solutions. You’ll consistently develop your skills and competencies relevant to your discipline, keeping up to date with new standards, procedures and instructions. To issues you find out in your working environment.Willingness to learn – You’ll consistently develop your skills and competencies relevant to your discipline, keeping up to date with new standards, procedures and instructions.Relevant qualification – You’ll ideally hold an NVQ Level 1 or 2 linked to the discipline you are applying for. Or you have achieved an equivalent level of relevant experience. It matters that this is the right role for you. Here’s some additional information which might help you. Shifts – Technician roles involve a changing shift pattern including days, nights and weekends.Outdoor working - Our technicians work outside in all weathers and so you’ll be comfortable working in different conditions.Safe working - Offers of employment are subject to drug and alcohol testing and passing of the relevant medical assessment and BPSS pre-employment checks. This will include a hearing and eyesight examination.Driving - As a technician you’ll also need a driving licence (category B) so you can drive Network Rail vehicles.Commute times - You’ll also need to be within a 60-minute commute of the location that you’re applying for.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £40,638Closing date: 27th December 2023 - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}