{"line-1":"Planning Assistant (Access)","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it. We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out. We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Planning Assistant (Access) to join our team to assist and support in the optimisation and integration of access into the Route engineering access plan. To work cross-functionally, liaising with all work requesters, customers and stakeholders to build and optimise the engineering access plan through worksite integration. This is a 12 month fixed term contract opportunity. Role and Responsibilities may include but are not limited to: 1. Support the Planning Team to deliver all activities associated with planning for possessions, worksites, line blockages, TSR’s, On Track Machines and Engineering Trains in accordance with all relevant standards. 2. Process and support Route access requirements and successfully integrate within the engineering access plan. 3. Attendance, and when required co-chairing possession planning meetings including producing, checking, validating publications and updates as necessary. 4. Assist and support with the creation of materials and documentation to aid the operational delivery of the engineering access plan. 5. Engage with Route wide stakeholders and customers and support with the coordination of their access requirements. 6. Assist and support with the identification and implementation of quality and efficiency improvements.","line-10":"About the role (External)","line-11":"ABOUT THE ROLE (INTERNAL & EXTERNAL): Essential · Able to work under pressure. · Able to prioritise and organise workload to ensure that deadlines are met. · Able to demonstrate the ability to organise effectively. · Displays a good attention to detail. · Displays good communication skills and a customer focussed approach within a team or as an individual. · Willing to learn to document all aspects of Access Planning requirements. · Good understanding of IT and operating of systems. Desirable · Knowledge of relevant railway geography and network capability. · Knowledge of relevant train services and network capacity. · Knowledge of relevant planning systems.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary and benefits: • Salary Circa £27,820 (Band 5) depending on skills, qualifications and experience • 28 days annual leave entitlement plus bank holidays • My benefits – Our discounted online shopping site • A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits • Subsidies of up to 75% on rail and underground season tickets • A choice of contributory pension schemes • 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 2 January 2024 and late applications will not be considered ** ** This is a 12 month fixed term contract opportunity ** Oh, and by the way… We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you! We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications. Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. If you like the sound of all that, we’d love it if you could submit your application online."}