{"line-1":"Service Delivery Supervisor - York - multiple opportunities available","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"OA OM York ROC - EC (107025) G4","line-6":"About Network Rail","line-7":"🌟 Join Our Team at Network Rail! 🌟Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out.We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation!<iframe width=\"642\" height=\"361\" src=\"https://www.youtube.com/embed/nLZ7OYSoQVU\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe> Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us.We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry.In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"The East Coast Route is pioneering new methods to better deliver for our customers. We want to introduce you to an exciting opportunity to be part of the leadership of our pioneering Service Delivery Centre (SDC) in York ROC. The Service Delivery Centre is the hub of digital rollout of new signalling technologies as part of the East Coast Digital Programme. To compliment the use of new signalling tools, new ways of working will benefit from signallers, controllers and other supporting roles working side-by-side to deliver a high-performing railway for all our rail users. We are seeking a new link of Service Delivery Supervisors for the York area of the SDC to provide to join us in a role that is vital to our success. Working closely with Industry stakeholders, you will be the key liaison and decision-maker to ensure the capacity of York Station platforms are maximised for the benefit of all passengers. You’ll have a keen customer focus to balance the needs of passengers in Station operations together with protecting performance to deliver on-time services in and out of York. You’ll be enthusiastic and keen to grasp new technologies. This role will be supported by new, proactive railway traffic management tools to enable you to deliver results, day in, day out. If required, you’ll be trained as a competent signaller and given additional training to be able to support and lead your York signalling team in safely running the daily timetable to time. Role and Responsibilities may include but are not limited to: 1. Provide strong leadership and accountability for York Station operations delivery. 2. Lead all Industry stakeholders at York Station to ensure trains are platformed efficiently to maximise performance and passenger satisfaction. 3. Provide instruction and guidance to signalling team in liaison with the Train Running Controller (TRC) so that trains over the route infrastructure are run safely and efficiently and a safe and punctual train service is provided. 4. Implement pro-active train regulating decisions, communicating with Signallers and Control as necessary, using service information and Traffic Management systems, interpreting incoming information to identify potential disruption and initiate early action to minimise train delays. 5. During disruptive events, utilise Traffic Management systems to evaluate the train plan and develop service recovery plans with Control to mitigate safety risk and maximise performance. 6. Identify possible solutions to timetable irregularities and proactively work with Train Planning and Siemens to improve the robustness of the train plan. 7. Operate and assist on signalling workstations as required and where competent to do so to provide operational support during times of high workload and/or in times of exceptional circumstances. Liaise with Electrical Control Room Operators and Signallers to assist in implementing block(s) to electric traction and emergency switch offs as required and as directed, to maintain a safe environment for workforce, customers and passengers.","line-10":"About the role (External)","line-11":"HOW TO APPLY-EXTERNAL Salary and benefits:• Salary of £54,844 (SUP.10)• 28 days annual leave entitlement plus bank holidays• My benefits – Our discounted online shopping site• A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits• Subsidies of up to 75% on rail and underground season tickets• A choice of contributory pension schemes• 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 29th December 2023 and late applications will not be considered **#There are multiple roles available. Oh, and by the way…We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you!We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications.Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history.If you like the sound of all that, we’d love it if you could submit your application online.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: Grade 10 - £54,844multiple opportunities availableClosing date: 29th December 2023. - Late applications will not be accepted. For further information, please contact Louie Richards Local Operations ManagerDrugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}