{"line-1":"Scheme Project Manager","line-2":"Location","line-3":"Blackfriars, GB","line-4":"Department Name","line-5":"southern region","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"An opportunity has arisen within the Wessex Maintenance Modernisation (Work-bank Strategy) team. The focus of the role is on the optimisation and alignment of the Ellipse work-banks across all disciplines. The role will require advances knowledge of Microsoft Excel functionality and an understanding of the requirements for safe delivery of infrastructure maintenance tasks. The role will assist with the management of the project through various stages of the life cycle and to support and assist delivering the overall project portfolio managed by the maintenance modernisation programme team.","line-10":"About the role (External)","line-11":"1. Deliver individual projects or parts of projects in a safe & environmentally responsible manner to time, cost, and quality, in accordance with the Guide to Railway Investment Projects (GRIP), applicable Network Rail company standards, current legislation and procedures including HMRI guidance where appropriate. 2. Provide a professional, consistent, and effective project management service including the use of performance indicators and project reporting systems in accordance with Railway Group and Network Rail’s company standards and guidelines. 3. Manage the development and delivery of change projects in compliance with company processes and procedures. 4. Manage tactical change and risks within the project life cycle for allocated schemes. 5. Assist or lead in the provision of a safe working environment in the execution of managed work. 6. Comply with the Investment Competence Framework. 7. Manage the production of project management plans 8. Manage project budgets within agreed targets 9. Deliver regular progress reports on change projects, including relevant risks and issues, to the Programme Manager (Change). 10. Promote and monitor the use of efficiency improvement methods. 11. Disseminate lessons learnt. Job Skills, Experience and Qualifications Essential · Successful relevant experience including project management. · Educated to HNC/HND or similar standard. · Good interpersonal and communication skills. · Project safety management experience · Knowledge of Oracle Projects and advanced Microsoft Excel knowledge · Knowledge of safety, quality, and environmental procedures. · Knowledge of commercial and financial procedures. Desirable · Membership (or working towards membership) of the Association for Project Management or other professional body. · A degree or equivalent. · Six Sigma Yellow Belt.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £35,582- £40,029 Been referred by a friend, then please complete this form Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre –employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employee’s unspent criminal convictions and undertake 3year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual 75% subsidy on season tickets costing up to £3000 (to a maximum amount of £2,250). Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. Closing date: 29th December 2023, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes. information"}