{"line-1":"Roster Clerk- Liverpool St IECC- 2 x Permanent roles available, 1 x 14 Month Fixed Term Contract","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"MC West Anglia Resourcing Manager (101310) G1","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To produce cost effective and efficient rosters for nominated employees compliant with the relevant operational standards in line with current rostering principles and competency requirements. Monitor the competency database to manage future safety critical competency expiries.","line-10":"About the role (External)","line-11":"Key Accountabilities: 1. Compile and publish rosters using the Corporate Rostering Tool in accordance with National Rostering Principles, company policies and standards. 2. Prepare rosters for employees undertaking weekly / daily rostered duties. Covering sickness, annual leave, training, briefing and special arrangements. Liaise with local managers to crosscheck roster data. 3. Manage short notice roster alterations liaising with all affected employees and line managers, including gaining verbal confirmation where necessary. Respond to and resolve any queries relating to roster issues. 4. Compile and control leave records, including input to the production of annual leave rosters. 5. Make roster arrangements for medical examinations and interviews. 6. Make roster arrangements for safety critical competence expiries, training plans, training courses and briefings. 7. Monitor and maintain competency data so that no base roster shifts are left uncovered due to expired competencies. 8. Carry out pre and post payroll interface checks to validate roster data. Submit late notice roster changes to payroll. 9. Gather and analyse fatigue data and highlight issues to the relevant line manager. 10. Provide information and data to support the routes reporting requirements. Job Skills, Experience and Qualifications: Essential · Excellent knowledge of national rostering principles · Previous successful experience in prioritising workloads and delivering to deadlines · Ability to demonstrate excellent interpersonal and communication skills · Previous successful experience of analysing data and producing reports · Understanding of conditions of service applicable to rostering · Understanding of roster systems · Demonstrable ability to accurately manage data and attention to detail · Previous successful experience of working in a team and engaging with virtual team members · Able to demonstrate good general IT skills Desirable · Understanding of pay arrangements for rostered staff · Geographical knowledge of the route · Knowledge of the UK rail industry","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Band 5 - Salary 26-29k (plus an inner London allowance of £3,270 per annum pro rata)Please note that this role will only be offered with a salary that is within the advertised range stated hereClosing date: 28th December 2023. Late applications will not be accepted. Click ‘apply now’ or click here for details of how to apply. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information We positively embrace flexible working recognising that employees may wish to balance work and family/home life. For further information please contact Dawn Davenport (Resourcing Manager) on Dawn.Davenport@networkrail.co.uk"}