{"line-1":"Construction Manager - IP","line-2":"Location","line-3":"York, GB","line-4":"Department Name","line-5":"IN TRU - Engineering (457140) G2","line-6":"About Network Rail","line-7":"***Thank you for your interest in this role. Please only apply for this role via Tribepad for all internal and external applicants. Unfortunately, We cannot accept applications via Oracle. Tribepad link: https://careershub.networkrail.co.uk/members/?j=2608*** Key InformationSalary: £43,588 to £49,037 per annumLocation: York George Stephenson House or Manchester Square One28 days annual leave + bank holidaysEmployees will be entitled to a 75% discount off leisure travel this includes off peak and super off-peak ticketsNetwork Rail Benefits – To find out about what benefits we offer, click here Our colleagues are encouraged to work flexibly as we know traditional working patterns don’t always fit, we’ll do our best to help and invest in your career with us, whilst you have a healthy work life balance. 🌟 Join Our Team at Network Rail! 🌟Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.The Transpennine Route Upgrade (TRU) is a major multi-billion-pound railway programme in the North of England between Manchester, Huddersfield, Leeds and York. It will transform journeys across the North, better connecting towns and cities through more frequent, faster, greener trains, running on a better, cleaner and more reliable railway.TRU will bring passengers:· More trains to choose from and more seats· Faster journeys so you can travel to your favourite towns and cities more quickly. · More reliable journeys with trains that run on-time· Better stations · Greener travel, reducing our carbon footprint and improving air quality​​​Stretching across the North of England, this key 70-mile rail artery serves 23 stations, crosses over and dips under 285 bridges and viaducts, passes through six miles of tunnels, and crosses over 29 level crossings. For more information visit www.theTRUpgrade.co.uk","line-8":"Brief Description","line-9":"Act as Network Rail’s Construction quality representative to monitor so that the contractor’s site activities are conducted in a safe and efficient manner with minimum impact on the environment and operational railway, and the work is of a high standard and in accordance with the relevant specifications and latest practices. Audit Alliance and supplier partners to ensure quality is maintained and act as an independent compliance and process overseer.","line-10":"About the role (External)","line-11":"Some of the key accountabilities of this role are: 1. Audit and monitor so that site activities comply with the Guide to Railway Investment Projects (GRIP) and or PACE, relevant rules, regulations, Railway Group and Network Rail’s company standards and all applicable procedures and legislation. 2. Review and audit the contractor’s work package plan and site-specific risk assessments and task briefs. 3. Audit and monitor by liaison with appropriate Network Rail personnel whether arrangements for access, possession, storage, worksites etc. have been made to facilitate the efficient completion of work. 4. Monitor by a programme of regular pre-arranged audits and inspections the quality of the contractor’s work. Where remedial actions are required monitor so that non-conformance reports raised are closed out in an auditable manner. Monitor and audit changes as appropriate. 5. Inspect and audit completed works and survey for the readiness of portions of the work for inspection and for the recording of the outcome and the control of any remedial works required. 6. Audit, by close liaison with the contractor, that Quality is jointly inspected at an early opportunity. Ensure by Inspection/Audit the detailed workmanship standards for consistent application to the whole of the works. 7. Monitor the contractor’s management of site works with site meetings at which details of the locations of, nature of, and number of staff to be employed upon each element of the work. 8. Monitor progress of the works by audit, site visits and inspections, comparing work in progress with contract documentation, and information given at site meetings with the overall contract programme. 9. Maintain audit schedule, complete site diary as appropriate, produce high quality feedback quickly and monitor feedback. 10. Encourage an awareness of the importance of HSQE and good workmanship by regular communication with all contractors’ staff 11. Audit, monitor and assess the competence of contractors staff prior to and during all phases of work. 12. Check whether the Alliance or supplier complies with Network Rail policy in accident/incident reporting and investigation and assist with conducting investigations. 13. Provides functional support to Principal Construction Manager, Engineering teams and operations as directed. 14. Ensure efficiencies are being maintained whilst looking for high quality and additional efficiencies. We need you to have: · Relevant successful construction experience in railway industry. · Environmental awareness. · Driver for behavioural change. · Good communication skills. · Commercial awareness. · Ability to manage a principal contractor and their subcontractors. · CSCS/CITB scheme/Nebosh certificate. It would be advantageous if you have: · Safety management awareness/training. · Audit training","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } ***Thank you for your interest in this role. Please only apply for this role via Tribepad for all internal and external applicants. Unfortunately, We cannot accept applications via Oracle. Tribepad link: https://careershub.networkrail.co.uk/members/?j=2608*** We are an inclusive employer of choice, Disability Confident Leader! We encourage people to work flexibly and welcome applications from everyone Click here for more information. Visit Evenbreak’s Career Hive should you need accessibility support to apply. Should you require any reasonable adjustments/modifications, please contact EasternResourcing@networkrail.co.uk. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Drugs & Alcohol test: All prospective candidates offered a conditional role will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. You should be able to demonstrate your personal commitment to safety and awareness in your application. Salary: starting at £43,588 and increasing to £49,037 per annum. Closing date: 5th January 2024. Late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}