{"line-1":"Mobile Operations Manager SUP Grade 7","line-2":"Location","line-3":"Havant, GB","line-4":"Department Name","line-5":"SH Outer Response MOMs (103411) G1","line-6":"About Network Rail","line-7":"Our passengers and freight users are at the heart of everything we do. We help connect people to their friends and families and get goods to their destination safely and efficiently. We're an organisation where people matter. Watch our video to find out more!We're continuing to build a diverse organisation which is representative of the people we serve. We want to harness the skills and expertise of our people and attract the best talent, to enable a safe and accessible railway for everyone. To learn why inclusion is important to us, please click here.About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"Deliver prompt and effective response to all real time Railway Operations and front line response activities.","line-10":"About the role (External)","line-11":"In this crucial frontline role, you’ll be responsible for delivering prompt and effective responses to any accidents and incidents on a section of the railway. Wherever you’re needed, you’ll make a positive impact, helping us to fix issues. Through careful investigation and reporting, you’ll also make sure we understand how to prevent similar events in the future. You may be required to take on the role of Rail Incident Officer. This would see you overseeing the establishment of a command structure, and leading the co-ordination of infrastructure and service restoration activities. Naturally, we’ll also expect you to carry out a broad range of operational support duties – from performance monitoring and weather related contingency planning, through to audit and engineering work, stores ordering and vehicle monitoring. Essential Criteria· Rail Incident Officer and Personal Track Safety training· The ability to learn, understand and implement rules and regulations · Excellent communication skills, both in person and in writing· Strong, logical decision making skills · A full driving licence· Self-motivated and assertive· Highly organised and able to prioritise duties effectively This role involves days, nights and weekend working, and is a safety critical role so subject to drug and alcohol testing and passing of the relevant medical assessment. You may also be required to carry out signalling duties as part of your MOM role, and therefore may be invited to undertake a signalling assessment as part of your application. The successful applicant will be required to attend a 7 week training course as part of your induction.","line-12":"How to apply (External)","line-13":"Salary £47,863 Been referred by a friend, then please complete this form Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 5th January 2024 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. Click ‘apply now’ to apply. - We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Drugs and Alcohol Standard: All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}