{"line-1":"Project Engineer - Signalling","line-2":"Location","line-3":"Doncaster, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Vacancy: Project Engineer [Signalling]Location: Doncaster, London Stratford, York , Peterborough, Derby (with travel on business purposes as required).Salary: £43,588 to £54,484Role Type: PermanentAt Network rail you will have a clear development path, access to training and can enjoy a range of employee benefits, such as; up to 28 days annual leave, 75% of Leisure Travel and Season Ticket for travel, a range of pension options, flexible and agile working arrangements, healthcare, discounts on shopping, gym memberships and much more. Network Rail Benefits - To find out about what benefits we offer, click here","line-8":"Brief Description","line-9":"As a Signalling Project Engineer, you will be an integral part of a multidisciplinary engineering team responsible for delivering projects within the CRSA portfolio. Your role will encompass the assurance of design and/or construction activities for assigned projects, ensuring strict adherence to the guidelines outlined in relevant legislation, Group and company standards, as well as Network Rail procedures within the CRSA program.In addition, you will play a vital role in collaborating closely with CREs (Contractors Responsible Engineers), CEMs (Contractors Engineering Managers), Project Managers, and various internal and external stakeholders. This position will require flexibility, including working from other offices when necessary.It's important to note that this role is specific to signalling, and thus, prior experience in signalling, preferably in maintenance, construction, testing, and/or design, is essential. You will be expected to work across multiple projects in the portfolio, so a solid understanding of relevant standards, particularly NR/L2/INI/02009, is crucial.As a Signalling Project Engineer, you will be an integral part of a multidisciplinary engineering team responsible for delivering projects within the CRSA portfolio. Your role will encompass the assurance of design and/or construction activities for assigned projects, ensuring strict adherence to the guidelines outlined in relevant legislation, Group and company standards, as well as Network Rail procedures within the CRSA program.In addition, you will play a vital role in collaborating closely with CREs (Contractors Responsible Engineers), CEMs (Contractors Engineering Managers), Project Managers, and various internal and external stakeholders. This position will require flexibility, including working from other offices when necessary.It's important to note that this role is specific to signalling, and thus, prior experience in signalling, preferably in maintenance, construction, testing, and/or design, is essential. You will be expected to work across multiple projects in the portfolio, so a solid understanding of relevant standards, particularly NR/L2/INI/02009, is crucial.","line-10":"As a Signalling Project Engineer, you will be an integral part of a multidisciplinary engineering team responsible for delivering projects within the CRSA portfolio. Your role will encompass the assurance of design and/or construction activities for assigned projects, ensuring strict adherence to the guidelines outlined in relevant legislation, Group and company standards, as well as Network Rail procedures within the CRSA program.In addition, you will play a vital role in collaborating closely with CREs (Contractors Responsible Engineers), CEMs (Contractors Engineering Managers), Project Managers, and various internal and external stakeholders. This position will require flexibility, including working from other offices when necessary.It's important to note that this role is specific to signalling, and thus, prior experience in signalling, preferably in maintenance, construction, testing, and/or design, is essential. You will be expected to work across multiple projects in the portfolio, so a solid understanding of relevant standards, particularly NR/L2/INI/02009, is crucial.","line-11":"About the role (External)","line-12":"Implement Network Rail systems and procedures to ensure a cost-effective, high-quality, safe, and environmentally responsible approach to design, construction, commissioning, and other technical activities on relevant projects. This should be done while ensuring compliance with all relevant legislation and involving appropriate communication with regulators and other relevant stakeholders.Oversee the specific projects managed by Capital Delivery to ensure they adhere to Network Rail's standards and specifications. Ensure that allocated design and construction contracts incorporate references to and comply with the relevant Railway Group and Network Rail Company standards, formal specifications, and procedures.Effectively manage all engineering activities to ensure they result in schemes that are not only financially viable but also meet program requirements in a manner that prioritises safety and environmental responsibility. This includes strict adherence to project timelines, budgets, and quality standards.Uphold the use of appropriate techniques and procedures for both quantified and qualitative risk assessments and HAZOP analysis for allocated projects. Additionally, oversee the environmental aspects of these projects in accordance with Network Rail's environmental policy.Continuously monitor the performance of design and specialist consultants as well as contractors involved in the projects.Provide expert project management advice for all construction activities, encompassing testing, commissioning, and site supervision. Ensure that the design and construction elements of relevant projects meet the requirements of current legislation, including adherence to construction design management (CDM) regulations.Vigilantly monitor the competency of contractors' design, construction, and specialist personnelConduct thorough reviews of design and construction activities and arrange for audits of contractors to assess the adequacy of safety, environmental, and quality management systems throughout the design, construction, testing, and commissioning phases.Undertake the responsibilities of the Designated Project Engineer (DPE) for specific projects, ensuring compliance with all relevant standards and regulations.Actively identify and promote best practices across various project teams to facilitate continuous improvement and knowledge sharing.Job Skills, Experience and QualificationsEssentialProven and successful record as a Signalling Engineer, ideally with hands-on involvement in construction, testing, and design projects across various disciplines.Proficiency in quality assurance practices.Understanding of the procedures necessary for the independent assessment of work.Competence in CDM (Construction Design and Management), risk assessment, and conducting internal and external audits.Familiarity with the IDC/IDR Process.Understanding of the MSRP process and its associated requirements.Outstanding communication skills, vital for effective teamwork and seamless collaboration across various facets of the organisation.DesirableMembership in a relevant professional body with chartered status and/or education to a degree level or possession of an IRSE (Institution of Railway Signal Engineers) License.Familiarity with structuring safety cases to support projects.An understanding and awareness of environmental considerations in engineering projects.Previous experience in project safety management.Acquainted with the intricacies of the SWTH Testing process.Familiarity with the Signal Sighting process.","line-13":"How to apply (External)","line-14":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: £43,588 to £54,484Closing date: 14th January 2024. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more informationSalary: £43,588 to £54,484Closing date: 14th January 2024. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information","line-15":"Salary: £43,588 to £54,484Closing date: 14th January 2024. - Late applications will not be accepted.Click apply now to apply.Drugs and Alcohol Standard:Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced.You can visit Evenbreaks Career Hive for advice on accessibility support if you're unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application.Network Rail Benefits - To find out about what benefits we offer, click hereAll offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information"}