{"line-1":"Level Crossing Manager","line-2":"Location","line-3":"Doncaster, GB","line-4":"Department Name","line-5":"Eastern Region","line-6":"About Network Rail","line-7":"Network Rail has played a key role in keeping the country moving during the coronavirus pandemic – and we will play an equally important part in rebuilding from it.We get people where they need to be, whether they are commuting to work, visiting friends or family, or going for a night out. We make millions of lives better every day and have a vital job in driving the economy and prosperity of the nation! Over the coming years we will be building and improving crucial rail links between the country’s biggest cities, making our services faster, more comfortable and more reliable for the people who rely on us. We’re also changing our organisation to put the passenger at the heart of everything we do, to make our people even prouder to work for us and to be recognised as a true leader in our industry. In joining Network Rail, you’re not only joining an organisation with a vital role to play for the country, but also a team of more than 40,000 people, and a business dedicated to being one of Britain’s best employers. Does this sound like a team you'd love to be a part of?","line-8":"Brief Description","line-9":"BRIEF DESCRIPTION: There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Route Level Crossing Manager to join our East Coast Safety team. The East Coast Safety Team provides specialist advise andcheck out the full job description support to the East Coast Route on all aspects of health, safety and wellbeing, including public safety at level crossings. This covers all teams within the Route from Kings Cross station to the boarders of Scotland along the East Coast mainline. The level crossings team are responsible for inspecting and undertaking comprehensive risk assessments for the 350 crossings on the Route. The team is led by the Route Level Crossing Manager with Level Crossing Managers and an Assistant Level Crossing Manager making up the full team. The team is based across the route as the role involves visiting each crossing on a regular basis, but comes together to peer review reports and work together to tackle areas of concern. It’s not essential to have a background in level crossings, as specialist training and mentorship will be provided and you will be trained to undertake level crossing risk assessments and inspections but could also be supporting the RLCM with the prioritisation of improvements and working with projects to provide level crossing expertise. With relevant experience, you could also be supporting and mentoring other LCM’s helping them maintain relevant competencies. Check out the full job description attached. Role and Responsibilities may include but are not limited to: 1. Undertake, and review quantitative and qualitative risk assessments in accordance with relevant level crossings standards determining and implementing appropriate risk mitigation supported by cost benefit analysis. 2. Undertake level crossing inspection, faulting and maintenance, accurately report all work completed/not completed. 3. Review and evaluate planning applications where level crossings are, or may be, affected. Arrange for the drafting of level crossing orders required for modernisation, renewal or change to enable compliance with level crossing Legal Orders. 4. Identify and progress closure or implement other necessary control measures to reduce level crossing risk as low as reasonably practicable. 5. Lead operational input to level crossing renewal / modernisation / closure projects for inclusion in the business plan, taking into account operating requirements and risk mitigation factors. 6. Produce / maintain records as required. 7. Provide support to route safety meetings, including OPSRAM and TCRAG, as required. 8. Carry out work safely and in accordance with the safe systems of work procedures, method statements or other relevant instructions, adhering to company policies and procedures. 9. Manage the process for vehicles, plant, tools, equipment and materials under your control to be fit for use and to be used / stored and disposed of correctly.","line-10":"About the role (External)","line-11":"Are you? - Keen to learn all about level crossings and improve public safety. - Organised with experience in project management - Able to effectively build relationships and influence multiple stakeholders - Excellent communication skills, both written and verbal - Able and willing to drive on company business - Able and willing to be out and about supporting the team and visiting and our crossings along the East Coast - Ability to hold track safety competencies. Do you have? - Railway knowledge and experience - Project management qualification - Experience in coaching, training, assessing or developing individuals - Any experience in public inquiries, risk assessments, health and safety or working in roles that influence public behaviour","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary and benefits: • Salary of £35,582 - £40,029 (Band 4.B) depending on skills, qualifications and experience • 28 days annual leave entitlement plus bank holidays • My benefits – Our discounted online shopping site • A range of discounted offers including, childcare vouchers, healthcare offers – cycle to work, healthcare club discounted membership and other benefits • Subsidies of up to 75% on rail and underground season tickets • A choice of contributory pension schemes • 2 weeks paid reserve leave for our Armed Forces community **Please note that the advert closes on the 1 January 2024 and late applications will not be considered ** Oh, and by the way… We care deeply about welcoming people no matter where they’re from, how old they are or what disability they may have. We encourage applications from every age, race, ethnicity, disability, gender, gender identity, religion, culture, sexual orientation, national origin, marital status, pregnancy, maternity or caring responsibility. We want our employees to bring their whole self to work and that starts with you! We will interview all disabled applicants who meet the essential skills and experience detailed above. Network Rail positively embraces flexible working, recognising that employees may wish to balance work and family/home life. We will consider all flexible working applications. Network Rail is required to comply with UK Government standards when carrying out pre-employment checks for all new starters; this includes a basic criminal record check. In addition to the basic criminal record check, in accordance with the UK Government we are also required to verify your identity, right to work in the UK and previous three years employment history. If you like the sound of all that, we’d love it if you could submit your application online."}