{"line-1":"Senior Finance Business Partner (Senior Analyst)","line-2":"Location","line-3":"Basingstoke, GB","line-4":"Department Name","line-5":"southern region","line-6":"About Network Rail","line-7":" Join Our Team at Network Rail! Are you ready to make a difference in people's lives? At Network Rail, we connect passengers and freight customers, ensuring safe and efficient transportation across the country. We're an organisation where people truly matter, and when you join us, you matter to us and millions of others. Click here to watch our inspiring video to learn more about us!We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.","line-8":"Brief Description","line-9":"To work as an integral member of supported business senior leadership team, to proactively identify, plan and meet the analytical needs of the business in order to improve business performance, in coordination with other members of the wider business and operational teams as required. To positively support Senior Leaders with decision support tools, analytics and insight to enable the best business outcomes are delivered.","line-10":"About the role (External)","line-11":"1. Develop and deliver excellent analysis and insight to multiple areas of the region and routes (performance, infrastructure, safety, planning, etc) to support senior leader business improvement decisions. 2. Develop, deliver and continually improve regular and ad-hoc reports for the provision of visibility of KPIs, trends, risks and opportunities across the region and routes. 3. Consolidate, critically review and provide operational or technical advice and guidance on periodic (weekly/daily) results and forecasts to identify and monitor risks, opportunities and efficiencies to enable best business outcomes. 4. Provide robust technical, operational and professional reports, analyses and insight to enable the business to make effective business decisions. 5. Develop, understand and influence the relevant drivers of the business area to deliver to the regular reporting plans and manage to the overall impact of effective decision making. 6. Support, influence and challenge senior leaders in understanding the impact of their period results in order to manage their business more effectively and manage within operational or practicable limits. 7. Analyse the data appropriate to the business areas and with senior leaders understand the overall plan to provide advice and new initiatives to save costs and be more efficient as an organisation. 8. Drive the adaption and development of reporting requirements to deliver key KPIS and for the function, highlighting any significant issues and trends with financial and other business results to aid decision makers to make efficiencies. 9. Lead in reporting and analysis key meetings on operational/train service/infrastructure/safety/financial performance to provide professional analytical advice and guidance to drive business decisions, minimise risk and deliver good corporate governance. 10. Develop, drive and implement investment decisions and new business activities, working collaboratively with senior leaders to explore new opportunities and drive business performance. Job Skills, Experience and Qualifications Essential 路 Membership (or working towards membership) of a relevant accounting body (CIMA/ACCA/ICAEW) or equivalent experience 路 Excellent stakeholder engagement and communication skills all levels. This should include Customers; 3rd party representatives, other business & functional leaders and key support personnel. 路 Successful relevant experience working in a complex financial environment including demonstrable experience in managing business risks, professional financial control and forward planning. 路 Demonstrable record of budget management, governance and ability to understand and interpret commercial and financial landscapes (budgets, forecasts, actual status). 路 Significant experience in managing ambiguity in a financial environment with strong evaluation and decision-making skills. 路 Excellent technical Financial and Accounting knowledge and application of that knowledge in a complex and commercial environment. 路 Educated to degree level in a relevant discipline, for example accounting and finance, business management or equivalent demonstrable experience in finance Desirable 路 Full membership of relevant post graduate professional body (CIMA/ACCA/ICAEW) 路 Experience of Oracle based systems 路 Substantial experience within multiple finance disciplines 路 Knowledge and technical expertise of Government accounting and relevant financial governance 路 Understanding of project management principles and experience of managing complex projects to successful conclusion.","line-12":"How to apply (External)","line-13":"html * { font-size: 10pt !important; font-family: Arial, sans-serif !important; } Salary: 拢55,596 - 拢 拢62,546 Been referred by a friend, then please complete this form Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employees unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual subsidy on season tickets. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. Closing date 28th December 2023:, late applications will not be accepted. We retain the right to close the advert before the listed closing date based on application volumes."}