{"line-1":"Technician x 2 (Signalling Maintenance)","line-2":"Location","line-3":"London, GB","line-4":"Department Name","line-5":"CV SM(S), Waterloo, Direct (880512) G1","line-6":"About Network Rail","line-7":"Are you looking to join an organisation where you do meaningful work every day? As a Technician you’ll be starting a rewarding career with Network Rail. Our role is to run a safe, reliable and efficient railway, serving customers and communities. We exist to get people and goods where they need to be and to support our country’s economic prosperity. We're undertaking an ambitious change. Our vision is Putting Passengers First – we’re a company that is on the side of passengers and freight users; that is easy to engage with and is an efficient and dependable partner; a company people are proud to work for; instinctively recognised as an industry leader. We’re an organisation where people matter. We matter to millions. Everyone matters is our diversity strategy. By 2024 we will be an even more open, diverse and inclusive organisation that is better at reflecting the communities that we serve. By putting our passengers first, our strategy will help us to provide a more accessible and more inclusive experience for you. We want to help deliver a railway which is safe, reliable, affordable and that provides great customer service to everyone. For more information about Network Rail click here","line-8":"Brief Description","line-9":"Working in all weathers on the frontline, you’ll carry out everything from maintenance to faulting. What’s more, you’ll develop your management skills by deputising for the Team Leader. You’ll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you’ll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you’ve even considered a career in rail. We’re focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.","line-10":"About the role (External)","line-11":"Our Technicians provide the essential link between the Team Leader and the team’s Operatives. Our Technicians work outside in all conditions, at all times of the year, day or night. You could be involved in demanding manual work, often with the need to transport kit across tricky terrain. Being safety focused, respectful of rules and a team player will be critical as you’ll often be working next to moving trains travelling at high speed.You matter to your teamA natural team player, you’ll also be able to lead the team when asked by the team leader. You’ll use your skills to deliver work safely and will check the team has the right competencies to meet our strict safety standards. You’ll also be a role model for safe working behaviours and be confident to challenge any potential risks to safety, so that everyone gets home safe every day. You matter to usToday’s Technicians can go onto become tomorrow’s Team Leaders.Your commitment to self-development and continuous learning is hugely important in this role and we'll provide you with all the training to develop both technical and non-technical skills. If you’re joining us from another industry, the structured training will give you the skills and confidence to move into a rewarding career in rail.Your skills matterOur Technicians play a vital role in our maintenance teams. You don’t necessarily need rail experience, but you do need to show how your transferrable skills meet the following:· Leadership – You’re able to lead, motivate and direct a team for safe and efficient work delivery.· Effective communicator – You’ll need strong communication skills and be able to deliver clear instructions to the team and other colleagues.· Technical skills –You’ll have knowledge and experience of inspection, faulting, maintenance and renewal techniques in the discipline that you are applying for.· Safety – You consistently role model safe behaviours, can arrange and implement safe systems of work, and are confident to challenge if you think a situation is unsafe.· Problem solver – You’ll be persistent in finding safe and effective solutions. You’ll consistently develop your skills and competencies relevant to your discipline, keeping up to date with new standards, procedures and instructions to issues you find in your working environment.· Willingness to learn – You’ll consistently develop your skills and competencies relevant to your discipline, keeping up to date with new standards, procedures and instructions.· Relevant qualification – You’ll ideally hold an NVQ Level 1 or 2 linked to the discipline you are applying for. Or you have achieved an equivalent level of relevant experience. It matters that this is the right role for you. Here’s some additional information which might help you. · Shifts – the Technician role involves a changing shift pattern including days, nights and weekends.· Outdoor working - Our Technicians work outside in all weathers and so you’ll be comfortable working in different conditions.· Safe working - Offers of employment are subject to drug and alcohol testing and passing of the relevant medical assessment (if not already held). This will include a hearing and eyesight examination. If you’re an external candidate – you will also be required to undergo BPSS pre-employment checks.· Driving - As a technician you’ll also need a driving licence (category B) so you can drive Network Rail vehicles.· Commute times - You’ll also need to be within a 60-minute commute of the location that you’re applying for. Essential Criteria· Experience of arranging and implementing safe systems of work· Knowledge of how to organise and control the safe and efficient delivery of work· Strong communication skills, both in person and in writing· Knowledge of discipline-specific maintenance, inspection, faulting and renewal techniques· Willing and able to work shifts in all weathers","line-12":"How to apply (External)","line-13":"Salary £ 40639 Been referred by a friend, then please complete this form Network Rail Benefits – To find out about what benefits we offer, click here Closing date: 5th January 2024 Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. Please note the recruitment process for this role is a Competency based interview. Click ‘apply now’ to apply. - We're dedicated to creating an inclusive environment and we welcome applications from everyone! Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. Network Rail Benefits – To find out about what benefits we offer, click here All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application. Drugs and Alcohol Standard: All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced"}