"{\"description\":\"Business Solutions Manager - 2 roles in Milton Keynes, GB. Department: Finance. About Network Rail: Network Rail is dedicated to building a diverse and inclusive organization that reflects the passengers we serve. They are committed to becoming an open, diverse, and inclusive workplace and are looking for 2 individuals to join their team as Business Solutions Managers.\",\"howToApply\":\"To apply for this position, visit the Network Rail external site and click apply to see the attached Network Rail Job Description for a full list of key accountabilities and essential/desirable criteria.\",\"aboutTheRole\":{\"essential\":[\"Demonstrates strong business/commercial approach and understanding of business management process and capability.\",\"Strong ability to manage a variety of stakeholders at all levels of the business.\",\"Clear understanding of coaching ability and/or demonstrable experience.\",\"Strong communication skills including workshop facilitation.\",\"Proven ability to review and edit requirements, specifications, and processes, and recommend solutions.\",\"Good knowledge of project management, risk management, assurance review, change and improvement process, tools, and techniques.\",\"Proven track record of defining and delivering business processes at an enterprise level.\",\"Ability to tailor presentation styles to suit audience levels.\",\"An ability to work autonomously under pressure in a rapidly evolving environment.\",\"Proficient use Microsoft Office, including Word, Excel and PowerPoint.\",\"Comfortable to challenge with evidence as appropriate.\"],\"desirable\":[\"Experience in delivering strategic change projects/programmes in matrix organisations.\",\"Advising senior business leadership.\",\"Ability to review and edit requirements, specifications, and processes, and recommend solutions.\",\"Clear understanding of coaching and/or demonstrable experience.\",\"Excellence in facilitation of small or medium size workshops.\",\"Defining and delivering business processes at an enterprise level.\",\"Comfortable to challenge with evidence as appropriate.\",\"Formal qualification in Coaching (ILM, ECA).\",\"Formal qualifications in Agile, ISEB, Business Improvement, and/or Project Management would be of interest.\",\"Professional qualifications such as ACMA, CQI desirable.\",\"Detailed understanding of the railway industry, its key business processes and interfaces.\"],\"keyAccountabilities\":[\"Facilitating and shaping solutions, developing strong business cases for change and improvement, and coaching leaders.\",\"Advocating for and improving the core process for the way we manage our business including the 'Managing Change and Improvement' framework (process and policy).\",\"Facilitating business opportunity development to enable stronger processes and controls, better understanding of emerging risks, and driving the way we manage our business to be more predictive, preventative and less reactive.\"]}}"