"{\"description\":\"Are you ready to make a difference in people's lives? At Network Rail, we connect people and goods with where they need to be. We want to build a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we aim to make the most of the skills and expertise of our talented workforce. Together, we intend to create a safe and accessible railway for everyone. We're an inclusive employer of choice and we welcome applications from everyone. We encourage our colleagues to work flexibly and invest in their careers with us while maintaining a healthy work-life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply, and interview for roles.\",\"howToApply\":\"Duration: Permanent. Closing date: 16th November. Interviews will be held W/C TBC. Band & Salary: Band 4B - \\n£35,582 - \\n£40,029. If you have any questions about this role, or if you have an HR related questions or require any reasonable adjustments/modifications, please contact Recruitment Support: Recruitmentsupport@Networkrail.co.uk\",\"aboutTheRole\":{\"essential\":[\"Excellent written communications skills \",\"Up-to-date knowledge of modern communication methodologies \",\"Comprehensive knowledge of research, insight and evaluation \",\"Excellent verbal communication and interpersonal skills \",\"Solid digital skills\",\"proven ability to use, and influence others to try new channels and tools \",\"Ability to take complex information and create clear messages relevant to the audience \",\"Excellent organisation, planning and management skills \",\"Ability to create strategic campaign plans and processes\"],\"desirable\":[],\"keyAccountabilities\":[\"You will be responsible for delivering high-quality communications, advising senior stakeholders and colleagues on internal and external communications matters and supporting the development and implementation of communication plans\"]}}"