"{\"description\":\"Operative [Track Maintenance] \\n12 months FTC, fast track programme to Technician\",\"howToApply\":\"    Salary: IMC Terms and Conditions. Some on-call may be required at times. Network Rail Benefits –To find out about what benefits we offer, click here. Closing date: 23rd November 2023. This is a 12-month fixed term contract to complete the training and give you an opportunity to secure a permanent Technician at the conclusion of this contract. Please get your application in as soon as possible, we may close the advert before the listed closing date if we receive enough applications. Late applications will not be accepted. The assessment process will consist of a competency and technical interview. Click ‘apply now’ to apply. Our Drugs and Alcohol Standard has changed. All prospective candidates will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5-year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. We are an equal opportunity employer and value diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Click here for more information. Diversity and inclusion are more than just buzz words for us. We’re constantly striving to make sure we provide a welcoming and safe environment for everyone. We recognise that certain groups are under-represented within our team and we’re working closely with our regional diversity and inclusion networks to make sure we support these groups as best as we can. Network Rail is a Disability Confident Leader and we’ll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles. You can visit Evenbreak’s Career Hive for advice on accessibility support if you’re unsure of the options available. Should you require any reasonable adjustments/modifications, please add a note to your application. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Click here for more information Keeping people safe on the railway is at the heart of everything we do. Safe behaviour is therefore a requirement of working for Network Rail. You should demonstrate your personal dedication to safety on your application.\",\"aboutTheRole\":{\"essential\":[\"Outdoor working\",\"Driving licence\",\"Willingness to learn\",\"Shift work\",\"Communication\",\"Working under pressure\",\"Teamworking\",\"Following rules and instructions\",\"Proactive planning\"],\"desirable\":[],\"keyAccountabilities\":[\"Maintaining, inspecting, and repairing the track network\",\"Providing lookout duties to keep the whole team safe\",\"Supporting maintenance teams in maintaining equipment\"]}}"