"{\"description\":\"Senior Development Manager role located in London, GB within the OA Route Business Development department. The role involves supporting the development of the eastern section of East West Rail between Bedford and Cambridge, working with internal and external stakeholders to establish parameters of scope and delivery options, and managing the discharge of duties assigned by the CDM Co-ordinator. Essential qualifications include the ability to articulate complex business problems, commercial acumen, and proven influencing skills, while desirable qualifications include degree level education, experience in negotiating contracts, and significant management roles in a commercial environment.\",\"howToApply\":\"Network Rail welcomes applications regardless of age, disability, marital status, pregnancy or maternity, race, religion, sexual orientation, gender, employment status, or irrelevant factors. The company embraces flexible working and offers various benefits, including a generous annual leave package and a bonus scheme. Basic pre-employment checks, a drugs and alcohol test, and verification of right to work in the UK are required for new starters. The role requires a personal commitment to safety, and employees are entitled to a 75% discount off leisure travel. The closing date for applications is 1st December 2023.\",\"aboutTheRole\":{\"essential\":[\"Ability to articulate complex business problems into contractible work packages\",\"Commercially astute, persuasive, and customer focused\",\"Proven ability to write coherently; conveying report/investment information in a concise manner\",\"Proven influencing and negotiating skills\"],\"desirable\":[\"Qualified to degree level or equivalent\",\"Experience of converting risk into a commercial requirement and overlaying contractual agreements with this\",\"Experience of negotiating contracts to finalization and able to demonstrate significant commercial success\",\"Experience of leading a successful team\"],\"keyAccountabilities\":[\"Client the development of interventions, as part of the funding and commitment process, to the extent necessary to gain funding from, and be accountable within the company governance processes.\",\"Work with internal and external stakeholders to establish parameters of scope, baseline conditions and delivery options which optimize value for money and consider the whole life cost, using a systems approach.\",\"Manage the process of identifying and quantifying risk associated with the developed interventions, and, in line with the identified strategy, build these requirements into the procurement and contracting strategy decision-making process.\",\"Consider other company and industry requirements including risk, selection criteria, system integration, project interdependencies, asset protection and payment regime that are necessary to form part of the output specification.\",\"Control the approval and escalation of any scope, value or cost changes after the contract has been awarded for the duration of the project/programme lifecycle. Manage the assurance and coordination of activity to support the scheme or portfolio throughout its lifecycle.\",\"Build and manage relationships (internally & externally) through effective stakeholder management to balance the requirements of the Government, Network Rail and the industry as a whole.\",\"Facilitate the discharge of the duties assigned by the CDM Co-ordinator [Network Rail Infrastructure Ltd] as detailed within the Construction, Design and Management Regulations 2007.\"]}}"