"{\n  \"description\": \"Resourcing Business Partner Support & HR Business Partner Support - talent pool - Milton Keynes/Birmingham/Manchester\",\n  \"howToApply\": \"Please note this is an active talent pool for both permanent and FTC opportunities. It is regularly being monitored and you will be contacted when a vacancy opens. Your application will be kept for up to 6 months. Salary Starting £25,000 up to £29,000 depending on experience\",\n  \"aboutTheRole\": {\n    \"essential\": [\n      \"Demonstrates strong customer service skills.\",\n      \"High level of accuracy and attention to detail.\",\n      \"Strong written and verbal communication skills.\",\n      \"Experience of working within a large, complex and fast moving organisation.\",\n      \"IT literate, strong excel, word and PowerPoint knowledge.\",\n      \"Resilient, Adaptable and Flexible.\",\n      \"Experience of event coordination and facilitation.\",\n      \"Strong relationship building skills.\"\n    ],\n    \"desirable\": [\n      \"Experience of working as part of a team in a client-focused environment to meet challenging deadlines in a volume-oriented HR/resourcing/recruiting environment\",\n      \"Experience of supporting the delivery of HR initiatives and projects.\"\n    ],\n    \"keyAccountabilities\": [\n      \"Managing the end to end offer process, identifying opportunities for improvement, driving change and collaboration through the right channels\",\n      \"Prioritize workload effectively, maintaining constant and open communications with the Resourcing Business Partner\",\n      \"Provide pro-active and specialist advice on relevant recruitment and selection activities including advertising, interview scheduling and management of offers.\",\n      \"Work with Resourcing Business Partner and internal clients to clarify and define resource requirements and advise on appropriate resourcing solutions.\",\n      \"Promote consistency and fairness in the recruitment & selection process by providing guidance to managers on structured interviewing techniques, criteria and capability based selection and general support, throughout the entire recruitment project life cycle to offer and acceptance stage.\",\n      \"Develop and sustain effective working relationships with both internal (e.g. HRSS) and external customers & suppliers.\",\n      \"Data cleansing of system information\",\n      \"Work with other resourcing colleagues to provide recruitment support in times of higher work volumes in specific client areas and on ad hoc projects when required\"\n    ]\n  }\n}"