"{\"description\":\"Lead and direct the stores management team within the Delivery Unit. Provide plant and materials to delivery unit teams to support all work activities.\",\"howToApply\":\"Closing date: 23rd November 2023 - Late applications will not be accepted. Click apply now to apply. Once you have applied, our Recruitment Specialist will look at your CV. If your experience matches what we're looking for, you'll be invited to an interview. Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. All offers of employment are conditional upon satisfactory completion of pre-employment checks.\",\"aboutTheRole\":{\"essential\":[\"Knowledge of plant and tools specification\",\"Practical competence in loading and lifting operations and equipment\",\"Knowledge of relevant standards and procedures\",\"Knowledge of relevant Company IT systems\",\"Good communication and organisation skills\"],\"desirable\":[\"Knowledge of operational railway\",\"Knowledge of maintenance delivery processes and techniques\"],\"keyAccountabilities\":[\"Lead and direct the stores management team to achieve Key Performance measures.\",\"Manage development and engagement of the team and individuals.\",\"Manage staff safety and competence arrangements.\",\"Assist the Logistics Co-ordinator to establish efficient quantities of plant and materials.\",\"Operate an efficient goods receipt and returns process. Maintain accurate inventory records of stocks booked in and out of stores.\",\"Order stock and material replenishment via corporate processes and systems.\",\"Conduct stock-taking checks and assist with stock audits. Monitor and amend stock profiles and levels as demand requires.\",\"Operate out-based Minor Stocking Points.\",\"Maintain safe and tidy stores areas\",\"Prepare and make available plant and materials to delivery unit teams.\",\"Collaborate with technical support units to comply with equipment calibration requirements.\",\"Quarantine small plant, tools and equipment out of test date.\",\"Check small plant, tools and equipment are fit for purpose. Quarantine plant, tools and equipment that is not fit for purpose and arrange replacement.\"]}}"