"{\"description\":\"Operative [Track Maintenance] at Didcot, GB in the Wales & Western Region department.\",\"howToApply\":\"Please apply by clicking the 'apply now' button and ensure your application is submitted before the closing date - 21st November 2023. Late applications will not be accepted. The assessment process will consist of a competency and technical interview. All candidates are required to undergo and pass a drugs and alcohol test as part of the application process. Network Rail is an equal opportunity employer and values diversity. We do not discriminate based on race, religion, national origin, gender, sexual orientation, age, marital status, or disability status. Diversity and inclusion are important to us, and we strive to provide a welcoming and safe environment for everyone. Network Rail is a Disability Confident Leader and will try our best to adapt the process and offer reasonable alternative options to support people with disabilities access, apply, and interview for roles. All offers of employment are conditional upon satisfactory completion of pre-employment checks. Safe behaviour is a requirement of working for Network Rail, so it is important to demonstrate your personal dedication to safety on your application.\",\"aboutTheRole\":{\"essential\":[\"You'll help keep our nation moving every single day by playing a critical part in the daily upkeep of the rail network.\",\"As an operative, you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.\",\"Operatives can specialize in a range of disciplines but for this role, you'll specialize in Track Maintenance.\",\"You'll be responsible for maintaining, inspecting, and repairing the track network to keep the railway safe and efficient.\",\"The role involves demanding manual work, often with the need to transport kit across tricky terrain.\",\"Operative roles involve a changing shift pattern including days, nights, and weekends.\",\"All operatives work outside in all weathers, and safe working is subject to drug and alcohol testing and passing relevant medical assessments and BPSS pre-employment checks.\",\"You'll need a driving licence (category B) to drive Network Rail vehicles and be within a 60-minute commute of the location you're applying for.\"],\"desirable\":[],\"keyAccountabilities\":[\"A safer and more reliable and punctual service for passengers and employees through quicker fault fixes by more agile multi-disciplined response teams.\",\"Individual rostering enabling the right number of people to fix a fault.\",\"Multi-skilling to invest in the knowledge and skills of our people for better fault resolution.\",\"Accelerated and improved technology deployment with labor and life-saving technology ready to be rolled out.\"]},\"location\":\"Didcot, GB\"}"