"{\"description\":\"Team Leader [Signalling Maintenance] role at Skipton Railway Stn in the Eastern Region. The role involves directing, organising, and motivating a high performing team in inspection, faulting, maintenance, and renewal activities. The successful candidate will be responsible for establishing safety arrangements, ensuring compliance, and compiling vital reports. Essential criteria include experience in organising and controlling work delivery, excellent communication skills, knowledge of maintenance techniques, and strong leadership. Desirable criteria include relevant qualifications and willingness to drive vehicles as required. The role involves days, nights, and weekend working, and is safety critical with drug and alcohol testing.\",\"howToApply\":\"To apply for this role, candidates are required to submit their applications by the closing date of 21st November 2023. Late applications will not be accepted. After applying, candidates whose experience matches the requirements will be invited for an interview or assessment. Successful candidates will undergo drug and alcohol testing before receiving a job offer. Candidates requiring accessibility support can visit Evenbreaks Career Hive for advice. Note: All offers of employment are conditional upon satisfactory completion of pre-employment checks. Visit the provided link for more information about Network Rail benefits and recruitment process.\",\"aboutTheRole\":{\"essential\":[\"Experience of organising and controlling the safe and efficient delivery of work\",\"Excellent communication skills, both in person and in writing\",\"Knowledge of discipline-specific maintenance, inspection, faulting and renewal techniques\",\"Knowledge of relevant standards, procedures and instructions\",\"A clear and inspirational leader with a strong sense of direction\"],\"desirable\":[\"Hold or be working towards an NVQ level 2 or 3 (or equivalent) in a relevant subject or have attained the appropriate level of knowledge gained through equivalent relevant experience\",\"Able and willing to drive vehicles as required by business need\"],\"keyAccountabilities\":[\"Establish safety arrangements and ensure compliance\",\"Direct, organise, and motivate a high performing team\",\"Control and check the quality of work and the competence of your people\",\"Compile vital reports\"]}}"