"{\"description\":\"Planning Specialist (Access) x2, Cardiff, GB\",\"howToApply\":\"To apply, click 'apply now' and follow the instructions on the application page.\",\"aboutTheRole\":{\"essential\":[\"Support the Planning Team to deliver all activities associated with planning for possessions, worksites, line blockages, TSR's, On Track Machines and Engineering Trains in accordance with all relevant standards.\",\"Process and support Route access requirements and successfully integrate within the engineering access plan.\",\"Attendance, and when required co-chairing possession planning meetings including producing, checking, validating publications and updates as necessary.\",\"Assist and support with the creation of materials and documentation to aid the operational delivery of the engineering access plan.\",\"Engage with Route wide stakeholders and customers and support with the coordination of their access requirements.\",\"Assist and support with the identification and implementation of quality and efficiency improvements.\"],\"desirable\":[\"Able to work under pressure.\",\"Able to prioritise and organise workload to ensure that deadlines are met.\",\"Able to demonstrate the ability to organise effectively.\",\"Displays a good attention to detail.\",\"Displays good communication skills and a customer focussed approach within a team or as an individual.\",\"Willing to learn to document all aspects of Access Planning requirements.\",\"Good understanding of IT and operating of systems.\",\"Knowledge of relevant railway geography and network capability.\",\"Knowledge of relevant train services and network capacity.\",\"Knowledge of relevant planning systems.\"],\"keyAccountabilities\":[\"Supporting the Planning Team in the delivery of all activities associated with the planning for possessions, worksites, line blockages, TSR's, On Track Machines and Engineering Trains in accordance with all relevant standards.\",\"Processing and supporting Route access requirements and successfully integrating them within the engineering access plan.\",\"Attending, and when required, co-chairing possession planning meetings including producing, checking, validating publications and updates as necessary.\",\"Assisting and supporting in the creation of materials and documentation to aid the operational delivery of the engineering access plan.\",\"Engaging with Route wide stakeholders and customers and supporting with the coordination of their access requirements.\",\"Assisting and supporting in the identification and implementation of quality and efficiency improvements.\"]}}"