"{\n  \"description\": \"Lead and direct the Infrastructure Maintenance delivery team in the inspection and maintenance of functional assets to standards and within budget.\",\n  \"howToApply\": \"Salary: £55596- £62546. Drugs and Alcohol Standard: Our Drugs and Alcohol Standard is changing as of 16.01.2023. All prospective candidates who have not been offered a conditional role by 16.01.2023 will be required to undergo and pass a drugs and alcohol test. Your application will be rescinded if you record a positive test. All positive drugs and alcohol test results for prospective candidates will be securely held on Sentinel database and a 5 year suspension from applying for a safety critical role, a role which requires PTS certification or a Key Safety role on Network Rail Managed Infrastructure will be enforced. Network Rail adheres to pre-employment Baseline Personal Security Standard (BPSS), this is government standard for pre-employment vetting. BPSS government standard pre-employment vetting requires Network Rail to screen a potential employee’s unspent criminal convictions and undertake 3 year career checks. Employment at Network Rail is subject to employees meeting the BPSS government standard pre-employment vetting. Network Rail welcomes applications regardless of age, disability, marital status (including civil partnerships), pregnancy or maternity, race, religion or belief, sexual orientation, transgender status, sex (or gender), employment status, trade union affiliation, or other irrelevant factor. We will interview all disabled applicants who meet the essential criteria. Keeping people safe on the railway is at the heart of everything we do, safe behaviour is therefore a requirement of working for Network Rail. Applicants should demonstrate their personal commitment to safety in their application. Network Rail can offer you a rewarding career with competitive pay and excellent benefits including a choice of contributory pension schemes, a generous annual leave package, a bonus scheme and an annual subsidy on season tickets. Network Rail positively embraces flexible working recognising that employees may wish to balance work and family/home life. Closing date: 29th November 2023, late applications will not be accepted.  We retain the right to close the advert before the listed closing date based on application volumes.\",\n  \"aboutTheRole\": {\n    \"essential\": [\n      \"Relevant technical competence\",\n      \"Experience in maintenance management, processes, and techniques\",\n      \"Knowledge of safety and compliance management processes\",\n      \"Detailed knowledge of relevant standards and procedures\",\n      \"Knowledge of operational railway environment\",\n      \"Knowledge of other functional disciplines\",\n      \"IRSE Licence holder (Signalling only)\",\n      \"Local Accident & Incident Investigation\",\n      \"Good interpersonal, influencing, communication, and organisation skills\"\n    ],\n    \"desirable\": [\n      \"Incorporated Engineer\",\n      \"Membership of professional body\"\n    ],\n    \"keyAccountabilities\": [\n      \"Lead and direct the Infrastructure Maintenance team to achieve business and functional objectives and meet key performance measures.\",\n      \"Manage development of individuals and the engagement of the team.\",\n      \"Manage the arrangements for staff safety and competence.\",\n      \"Identify and implement safety, asset performance, reliability, productivity, and efficiency improvement initiatives.\",\n      \"Manage the inspection and maintenance of assets to standards.\",\n      \"Manage the prioritization of work and delivery to plan.\",\n      \"Check that safety, assurance, compliance, performance, and business processes are followed.\",\n      \"Identify and submit non-compliances for approval and take appropriate action where required.\",\n      \"Manage the process to handover and accept back assets being renewed, installed, or modified by projects.\",\n      \"Restore to normal operation after completion of testing/investigation, equipment that has failed, been subject to an allegation or has been renewed as a part of a maintenance delivered renewal program.\",\n      \"Develop and agree annual maintenance, inspection and testing programs and resource levels.\",\n      \"Develop and authorize quarterly work plans and resource levels.\",\n      \"Identify and propose asset renewals.\",\n      \"Review and approve method statements and/or plans for design and/or work activities as required.\",\n      \"Undertake investigations and report on accidents/incidents.\",\n      \"Undertake an agreed program of safety tours, staff surveillance, work quality and asset condition checks.\"\n    ]\n  }\n}"