"{\"description\":\"Programme Procurement Manager at Network Rail\",\"howToApply\":\"**Thank you for your interest in this role. Please note all recruitment for this role (internal and external candidates) will be progressed via Tribepad. For your application to be considered, please only apply via https://careershub.networkrail.co.uk/members/?j=2549**\",\"aboutTheRole\":{\"essential\":[\"Strong commercial aptitude with high personal and professional standards and be able to act as role model to inspire others\",\"The ability to balance stakeholder expectations against the needs and capabilities of the business and suppliers\",\"Membership of relevant professional institution\",\"Thorough knowledge of contract requirements safety and environment\"],\"desirable\":[\"Wide and successful management background either in rail or construction industry with extensive experience at a senior level of procurement and contracting\",\"Educated to degree level\",\"Experience of contracts and procurement processes and procedures within Network Rail\",\"Six Sigma Yellow Belt\"],\"keyAccountabilities\":[\"Recognised for their Sourcing expertise, providing specialist Sourcing advice. Introduce innovation, expertise and ideas to deliver Sourcing led competitive advantage.\",\"Lead negotiation of complex, and high value contracts, achieving best value. Prepare and execute the corresponding contracts.\",\"Develop, implement and maintain detailed procurement and contracting strategies for the TRU programme managing all risk, legislative and regulatory requirements.\",\"Identification of cost reduction and efficiency opportunities including contributing to continuous improvement initiatives and the establishment of tools to benchmark programme efficiencies.\",\"Influence and liaise with other Industry and National programmes to manage consistency in commercial approach to supply market.\",\"Conduct regular competitor and supplier market watch assessments in the delivery of the optimal Total Cost of Ownership.\",\"Develop appropriate processes and systems to regularly measure and monitor supplier performance.\",\"Contribute to the development and implementation of best practice systems and processes for the effective, efficient and consistent management of procurement and supply chain activities.\",\"Prepare robust tender documents structuring the pricing document to facilitate cost analysis feedback for high value/high risk contracts and manage the whole tender process.\",\"Challenge demand and aggregation of requirements of customers and stakeholders to maximise overall value, whilst aligning to customers’ and stakeholders’ objectives and priorities.\",\"Lead and contribute to the development of the Sourcing team to maximise value for the organisation by supporting and providing guidance to peers and input into training requirements and fostering team work.\"]}}"