[
  {
    "jobId": "2272585",
    "title": "Section Planner [Track] - Gateshead Raven House",
    "location": {
      "city": "Gateshead",
      "postcode": "NE8 2TD",
      "lat": 54.962649,
      "lng": -1.609413
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272585&p_spid=7572044&refsh=0"
  },
  {
    "jobId": "2271343",
    "title": "Asset Engineer",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "As an Asset Engineer (Structures Assessment) within the Eastern Region assessment team, you will provide asset management and structural engineering support to the region and wider Network Rail. The role includes the management, technical approval and assurance of structural assessment deliverables within the North and East Route. The role is responsible for safely managing the capability of structural assets (mostly underline and overline bridges) for the Structures and Buildings teams, ensuring compliance to Network Rail standards.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-11",
      "end": "2024-01-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271343&p_spid=7564801&refsh=0"
  },
  {
    "jobId": "2272471",
    "title": "Section Manager [Track] - Newport",
    "location": {
      "city": "Newport",
      "postcode": "NP20 3BG",
      "lat": 51.568575,
      "lng": -3.009009
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. You will be accountable for managing a section of the rail network. You'll manage and develop a large maintenance team, and drive safety and efficiency across diverse works.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272471&p_spid=7572030&refsh=0"
  },
  {
    "jobId": "2272248",
    "title": "Project Manager",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "Who are we looking for? Join our dynamic team as a Project Manager and lead the way in delivering exciting projects that make a real impact! We have a fantastic Permanent opportunity based in Milton Keynes, where you'll take charge of ensuring our projects are delivered safely, on time, and within budget.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-11",
      "end": "2024-01-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272248&p_spid=7571907&refsh=0"
  },
  {
    "jobId": "2272924",
    "title": "CAD Technician",
    "location": {
      "city": "Stockport",
      "postcode": "SK4 3GL",
      "lat": 53.407273,
      "lng": -2.202068
    },
    "salary": {
      "min": 27820,
      "max": 30000
    },
    "description": "The Internal Design Team (IDT) is expanding to meet demand brought about by our continued success in project delivery and is looking for talented people from all backgrounds to join our journey and move us forward. Our team deals with a wide range of engineering projects such as structural repair works, retaining structures, sea defences, bridge refurbishments and geotechnical works such as embankment regrades and slopes analysis. We also operate on large scale schemes such as our award-winning work on Liverpool High Neck Tunnel and our refurbishments of Ribblehead and Sankey viaduct to name but a few. We are again happy to be looking for another candidate to join our diversely capable team for a bright and fulfilling career in civil engineering with a focus on safety and look forward to hearing from you. As a CAD technician for IDT your duties will include ‘red-line' mark-up drawing amendments, on-site scanning and clerical tasks such as assisting the team with bookings and submitting time sheets. As such experience in Excel is highly advantageous with experience in Access desirable. This would be an excellent opportunity for a recent graduate with possibilities for future development.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2023-12-27"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272924&p_spid=7573961&refsh=0"
  },
  {
    "jobId": "2274375",
    "title": "Training & Competency Specialist",
    "location": {
      "city": "Exeter",
      "postcode": "EX4 3SB",
      "lat": 50.725969,
      "lng": -3.533302
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "The purpose of this role is to undertake assurance, competence and certification of all relevant employees (Signallers and Controllers), and to input to and assist in the development and delivery of training solutions.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274375&p_spid=7583132&refsh=0"
  },
  {
    "jobId": "2268045",
    "title": "Senior Technical Operations Developer (Capacity Planning)",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "About the function… System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? Ideally, we are looking for candidates that have the below;Tech Requirements-C# -SQL-Net Framework/CoreTech Nice To Have-API design and integration -Azure Cloud Platform",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-20",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268045&p_spid=7538153&refsh=0"
  },
  {
    "jobId": "2272779",
    "title": "Technical Lead (Regions)",
    "location": {
      "city": "Bristol",
      "postcode": "BS1 6NL",
      "lat": 51.448536,
      "lng": -2.58708
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Are you someone who likes to see your work make a difference to the people around you? We are seeking an Azure Developer with a strong ability to work directly with users. This role is part of a team that sits within the wider Finance directorate and serves the wider region. The region is shifting to a devolved model where products and solutions can be developed locally and have National interfaces. As part of the role you will: · Undertake the support, maintenance, and development of digital and data products owned and supported by the Region. · Work with suppliers to deliver Possession Optimisation, a key priority within the first 12 months that is revolutionising how Engineering Access is planned and delivered through digital and data-driven tools. · Coordinate and build coding components that support regional products ensuring that the safety, data protection requirements, and security needs are clearly identified, maintained, and assured. · Develop and support regional upskilling in Digital and Data environments and tools. Through your technical expertise in Microsoft Azure back-end or front-end coding, you will work with the Region's teams building relationships with key internal customers helping to support and enhance performance Digital and Data Products across a range of measures. A strong ability to work directly with users is required to understand their needs and translate them into technical requirements. The location is stated as Bristol, however, the job location is flexible for hybrid working within the Wales & Western Geographic Region. Our internal customers work all over the Region so travel will be required to attend offices, delivery units, and trackside. Application Process: As part of the interview, there will be a technical element where you will be asked to show and explain the coding and display of products you have created and how they enable business value.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2024-01-15"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272779&p_spid=7573916&refsh=0"
  },
  {
    "jobId": "2274551",
    "title": "Route Level Crossing Manager",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Route Level Crossing Manager to join our East Coast Safety team. The East Coast Safety Team provides specialist advise and support to the East Coast Route on all aspects of health, safety and wellbeing, including public safety at level crossings. This covers all teams within the Route from Kings Cross station to the boarders of Scotland along the East Coast mainline. The level crossings team are responsible for inspecting and undertaking comprehensive risk assessments for the 350 crossings on the Route. The team is led by the Route Level Crossing Manager with Level Crossing Managers and an Assistant Level Crossing Manager making up the full team. The team is based across the route as the role involves visiting each crossing on a regular basis, but comes together to peer review reports and work together to tackle areas of concern. As Route Level Crossing Manager, you will lead the Route Level Crossing team in the delivery of compliance inspections, operational risk assessments, monitoring of operational interfaces and maintenance of the systems developed to manage and reduce level crossing risk across the Route. Reporting into the Head of Safety, Health, and Environment. As well as supporting the team, the RLCM is also responsible for reviewing and making the case for prioritising specific improvement works with different Route team. This includes working with maintenance, asset management, liabilities and project teams, as well as local authorities. They will be the first point of call for projects and providing evidence for public inquiries into closures. The ability to build and maintain relationships with a range of different internal and external stakeholders and effectively lead and support a team of level crossing managers is important to this key safety role. it's not essential to have a background in level crossings, as specialist training and mentorship will be provided. Check out the full job description attached Role and Responsibilities may include but are not limited to: 1. Act as principal point of contact within the route on all level crossing related issues. 2. Co-ordinate the formulation of the route level crossing risk reduction strategy. 3. Act as the lead for the route on the measurement, assessment and monitoring of level crossing risk including the development of control measures and the monitoring of their application and effectiveness. 4. Lead the delivery of relevant information regarding all level crossing accidents / incidents in an appropriate and consistent format and within appropriate timescales to senior managers and other relevant internal and external organisations. Undertake sampling to identify best practice and areas for improvement. 5. Co-ordinate the facilitation of professional level crossing safety expertise to the level crossing Route Asset Manager and other level crossing safety interface meetings as required. 6. Provide support to route safety meetings, including OPSRAM and TCRAG, as required. 7. Ascertain whether level crossing safety and quality systems are being consistently introduced and that arrangements are in place to undertake sampling of route based level crossing actions and mitigations to identify best practise as well as areas for improvement. 8. Lead the regular review of the route level crossing risk profile providing appropriate actions and close out to address emerging risks and record these within relevant risk registers. 9. Lead the delivery of the programme of measurement activity to support routes in managing level crossing standards and guidance compliance. 10. Support the risk ranking process of level crossing irregular working events. 11. Act as a principle contact on route level crossing issues, building effective relationships with internal and external stakeholders.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274551&p_spid=7582258&refsh=0"
  },
  {
    "jobId": "2273341",
    "title": "Team Organiser",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 25000,
      "max": 30000
    },
    "description": "Occupational Health and Wellbeing at Network Rail This is an exciting time to join our team of Occupational Health professionals, as we have just launched our inhouse service model, delivering flexibly, out of our 22 Occupational Health locations nationwide. It's a great time to join us as we begin our journey to shape the new service for our organisation and the rail industry. The health, safety & wellbeing of our colleagues is of the paramount importance to us, delivering a high-quality occupational health service, and proactively managing our people's immediate and long-term health and wellbeing risks. We're looking for people who are customer focussed, highly motivated, and committed to deliver our new In-House Occupational Health for our 46,000 colleagues, for both clinical and operational roles. We're creating a railway ‘Fit for the Future' so we need a workforce ‘Fit for the future' and you can play a key part in creating a sustainable service for the future. We've a fantastic opportunity for an experienced Team Organiser to support the team in the day-to-day operation and running of the OH In-House Service and support the Head of Delivery in driving the service forward. It would be advantageous if you had experience of working in an Occupational Health or medical environment. The service is currently in the early stages of its launch, the role will require some flexibility and require you to be adaptable to change. Please note for this role you will be required to be on-site for a minimum 3 days per week and may require nationwide travel.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273341&p_spid=7577148&refsh=0"
  },
  {
    "jobId": "2267223",
    "title": "Operative x 3 Roles",
    "location": {
      "city": "Crawley",
      "postcode": "RH10 7AA",
      "lat": 51.117395,
      "lng": -0.160609
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'llhelp keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essentialmaintenance to keep the railway running safely and smoothly for passengers andfreight users.Our operative community comes from a variety of different backgrounds, and thismight be the first time that you've even considered a career in rail. We'refocused on your transferrable skills and behaviours and if you can demonstratethat, then we will provide you with all the necessary training to have youworking safely and competently out on the network.Andif you make the grade then you can look forward to a rewarding and fulfillingcareer with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-09-11",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2267223&p_spid=7534231&refsh=0"
  },
  {
    "jobId": "2273932",
    "title": "Roster Clerk [Maintenance/Works Delivery]",
    "location": {
      "city": "Birmingham",
      "postcode": "B7 4QS",
      "lat": 52.487857,
      "lng": -1.87395
    },
    "salary": {
      "min": 21580,
      "max": null
    },
    "description": "Producing rosters for a wide range of personnel carrying out all kinds of key duties, you will help us deliver a better railway even more efficiently. Our success is rooted in the details you'll consider.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273932&p_spid=7579189&refsh=0"
  },
  {
    "jobId": "2252393",
    "title": "Commercial Manager",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": 43588,
      "max": 49037
    },
    "description": "We have a fantastic opportunity for someone looking to develop their Commercial career path. As a Commercial Manager, you will provide pre and post-contract commercial management for the Maintenance Delivery Units in the Routes. The Maintenance Delivery Units carry out critical maintenance work to keep the railway running, simply put without it, the railway couldn't operate safely. The Maintenance Delivery Units rely on their supply chain to maintain the railway, it is important they are supported and that the supplier contracts they engage with are operated and administered properly to ensure continual service. Its busy, its reactive, its challenging, no two days are the same, but we operate in a hard-working but friendly and approachable culture. For an insight into a typical day as a Commercial Manager, please click the link to read our article: A Day in the Life of a Commercial ManagerWe have two permanent opportunities and one 12-month secondment/FTC opportunity (with the potential to be made permanent). These roles can be based across our North West & Central Region (at our Milton Keynes, Birmingham, or Manchester offices).",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-02-23",
      "end": ""
    },
    "status": "Either",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2252393&p_spid=7426401&refsh=0"
  },
  {
    "jobId": "2272404",
    "title": "Senior Technical Officer [Electrification & Plant] - Doncaster 10 Pound Walk",
    "location": {
      "city": "Doncaster",
      "postcode": "DN4 5HX",
      "lat": 53.512842,
      "lng": -1.130551
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Senior Technical Officer your role is to provide day to day technical support for a wide variety of equipment across a large geographical area. A Senior Technical Officer works both in the office and outdoors on site, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our team members come from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that you are well suited, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-15",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272404&p_spid=7571107&refsh=0"
  },
  {
    "jobId": "2274604",
    "title": "Scheme Project Manager",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "An opportunity has arisen within the Wessex Maintenance Modernisation (Work-bank Strategy) team. The focus of the role is on the optimisation and alignment of the Ellipse work-banks across all disciplines. The role will require advances knowledge of Microsoft Excel functionality and an understanding of the requirements for safe delivery of infrastructure maintenance tasks. The role will assist with the management of the project through various stages of the life cycle and to support and assist delivering the overall project portfolio managed by the maintenance modernisation programme team.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274604&p_spid=7584061&refsh=0"
  },
  {
    "jobId": "2273218",
    "title": "Capital Programme Planning Assurance Manager",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "Network Rail have an opportunity for the right candidate to become part of our Capital Delivery Eastern team as a Capital Programme Planning Assurance Manager This is an exciting unique opportunity for a committed, highly motivated & enthusiastic individual to join our Business Intelligence Planning and Controls team. As Planning Assurance Manager your role will be to manage the supply chain programme assurance and business needs to ensure successful delivery of our projects. You will lead planning assurance activities on behalf of the project team(s) for Major Projects and Programmes across Anglia - including Beaulieu New Station and Cambridge South Infrastructure Enhancement (CSIE). You will ensure programmes comply with company and legislation standards and are compliant with Project Acceleration in a Controlled Environment (PACE). This full time role is based in our Stratford office, with a requirement to work out of this location three days per week minimum.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273218&p_spid=7576075&refsh=0"
  },
  {
    "jobId": "2274631",
    "title": "Team Leader (Welding & Grinding)",
    "location": {
      "city": "Wimbledon",
      "postcode": "SW19 7JY",
      "lat": 51.423121,
      "lng": -0.204287
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Do you have experience in civils work, fencing or drainage? Does your passion lie within tree cutting, forestry, landscaping or arboriculture? If so then we would love to hear from you, we are currently recruiting for a Team Leader to work within our based in Guildford. You will specialists in maintaining, inspecting and repairing the land alongside the track network to keep the railway safe and efficient. This includes vegetation management, drainage, and ancillary structures. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal. To be successful within this role you must have experience or knowledge within any of the following areas' tree cutting, forestry, landscaping arboriculture, civils, drainage, fencing or landscaping.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274631&p_spid=7584088&refsh=0"
  },
  {
    "jobId": "2273883",
    "title": "Works Delivery Manager (B&C)",
    "location": {
      "city": "Carnforth",
      "postcode": "LA5 9NJ",
      "lat": 54.139079,
      "lng": -2.780698
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?Manage and direct the Works Delivery team to deliver inspection, maintenance and renewal of assets to standards. Manage activities within agreed resource levels, budget and unit cost measures to achieve safety, asset performance, cost and quality business targets.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273883&p_spid=7578183&refsh=0"
  },
  {
    "jobId": "2274136",
    "title": "Internal Communications Manager (12 month maternity cover)",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "To manage a portfolio of multi-media internal communication channels. To develop and deliver an integrated programme for internal communication content provision that meets business objectives and is aligned with Network Rail's Internal Communications (IC) strategy. I reoli portffolio o sianeli cyfathrebu mewnol amlgyfrwng. Datblygu a chyflwyno rhaglen integredig ar gyfer darparu cynnwys cynnwys mewnol sy'n cwrdd ag amcanion busnes ac sy'n cyd -fynd â strategaeth Cyfathrebu Mewnol (IC) Network Rail.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-11",
      "end": "2024-01-11"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274136&p_spid=7580093&refsh=0"
  },
  {
    "jobId": "2271885",
    "title": "Compliance Auditor",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "To undertake audits and deliver the Functional Audit Programme, verify the effectiveness of the audit framework and support the delivery of improvements where identified",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271885&p_spid=7569922&refsh=0"
  },
  {
    "jobId": "2273164",
    "title": "Section Administrator [Off Track]",
    "location": {
      "city": "Preston",
      "postcode": "PR1 8BN",
      "lat": 53.756976,
      "lng": -2.706355
    },
    "salary": {
      "min": 21000,
      "max": null
    },
    "description": "What will you be doing?Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273164&p_spid=7575071&refsh=0"
  },
  {
    "jobId": "2273785",
    "title": "Technician [Track Maintenance] - Leicester Depot",
    "location": {
      "city": "Leicester",
      "postcode": "LE2 0AA",
      "lat": 52.636052,
      "lng": -1.117817
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273785&p_spid=7579092&refsh=0"
  },
  {
    "jobId": "2274296",
    "title": "Mobile Operations Manager SUP Grade 7",
    "location": {
      "city": "Havant",
      "postcode": "PO9 2LS",
      "lat": 50.854874,
      "lng": -0.978362
    },
    "salary": {
      "min": 47863,
      "max": 47863
    },
    "description": "Deliver prompt and effective response to all real time Railway Operations and front line response activities.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274296&p_spid=7583103&refsh=0"
  },
  {
    "jobId": "2273572",
    "title": "Operative [Works Delivery Off Track] - Doncaster Marshgate Depot",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273572&p_spid=7578072&refsh=0"
  },
  {
    "jobId": "2270845",
    "title": "Senior Technical Officer [Track]",
    "location": {
      "city": "Liverpool",
      "postcode": "L1 1JT",
      "lat": 53.404361,
      "lng": -2.979554
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?Provide technical support to the Maintenance Engineering team.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270845&p_spid=7561853&refsh=0"
  },
  {
    "jobId": "2274408",
    "title": "Technician x 2 (Signalling Maintenance)",
    "location": {
      "city": "London",
      "postcode": "SE1 7RA",
      "lat": 51.501337,
      "lng": -0.112473
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274408&p_spid=7582165&refsh=0"
  },
  {
    "jobId": "2273576",
    "title": "Senior Technical Officer [Track] - Derby Mercia House",
    "location": {
      "city": "Derby",
      "postcode": "DE21 6EN",
      "lat": 52.922338,
      "lng": -1.451901
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide technical support to the Maintenance Engineering team.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273576&p_spid=7578076&refsh=0"
  },
  {
    "jobId": "2274448",
    "title": "Roster Clerk- Liverpool St IECC- 2 x Permanent roles available, 1 x 14 Month Fixed Term Contract",
    "location": {
      "city": "London",
      "postcode": "EC2A 2AH",
      "lat": 51.522009,
      "lng": -0.085308
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "To produce cost effective and efficient rosters for nominated employees compliant with the relevant operational standards in line with current rostering principles and competency requirements. Monitor the competency database to manage future safety critical competency expiries.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274448&p_spid=7583155&refsh=0"
  },
  {
    "jobId": "2268999",
    "title": "Environment Specialist",
    "location": {
      "city": "Bristol",
      "postcode": "BS1 6NL",
      "lat": 51.448536,
      "lng": -2.58708
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "Do you have a keen interest in environmental challenges and/or a good understanding of the railway? Do you want to help contribute to climate change mitigation? The railway is an enabler for Net Zero and a clean way of travelling and you could be working in an industry that is part of the solution! Assurance plays a big part in our pledge to achieve Net Zero by 2050. This role will support colleagues on environmental management and carry out assurance activities.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-01",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268999&p_spid=7543007&refsh=0"
  },
  {
    "jobId": "2274080",
    "title": "Technician [Track Maintenance] - Selby, Brayton Pway Depot",
    "location": {
      "city": "Selby",
      "postcode": "YO8 9DZ",
      "lat": 53.766847,
      "lng": -1.085941
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274080&p_spid=7579242&refsh=0"
  },
  {
    "jobId": "2269000",
    "title": "Environment Specialist",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "Do you have a keen interest in environmental challenges and/or a good understanding of the railway? Do you want to help contribute to climate change mitigation? The railway is an enabler for Net Zero and a clean way of travelling and you could be working in an industry that is part of the solution!Assurance plays a big part in our pledge to achieve Net Zero by 2050This role will support colleagues on environmental management and carry out assurance activities. Oes gennych chi ddiddordeb brwd mewn heriau amgylcheddol a/neu ddealltwriaeth dda o'r rheilffordd? Ydych chi eisiau helpu i gyfrannu at liniaru newid yn yr hinsawdd? Mae'r rheilffordd yn alluogwr ar gyfer net sero ac yn ffordd lân o deithio a gallech fod yn gweithio mewn diwydiant sy'n rhan o'r datrysiad! Mae sicrwydd yn chwarae rhan fawr yn ein haddewid i gyflawni sero net erbyn 2050 bydd y rôl hon yn cefnogi cydweithwyr ar reolaeth amgylcheddol ac yn cynnal gweithgareddau sicrwydd.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-01",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269000&p_spid=7543008&refsh=0"
  },
  {
    "jobId": "2274277",
    "title": "Technician (Signalling Maintanence) - Shrewsbury Coleham Depot",
    "location": {
      "city": "Shrewsbury",
      "postcode": "SY3 7LJ",
      "lat": 52.703206,
      "lng": -2.744239
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Brief DescriptionYou'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274277&p_spid=7583084&refsh=0"
  },
  {
    "jobId": "2271070",
    "title": "Team Leader [Signalling Maintenance]- Skipton Railway Stn",
    "location": {
      "city": "Skipton",
      "postcode": "BD23 1RT",
      "lat": 53.959382,
      "lng": -2.026044
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271070&p_spid=7560978&refsh=0"
  },
  {
    "jobId": "2273923",
    "title": "Assistant Commercial Manager - C&P",
    "location": {
      "city": "Leeds",
      "postcode": "LS1 4JB",
      "lat": 53.794865,
      "lng": -1.546622
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "As an Assistant Commercial Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have an interesting and varied role, providing commercial support as required in accordance with established Network Rail policy. Day-to-day, you'll operate effectively in multi-disciplined teams, supporting both the Commercial Manager and project team. You will assist the Commercial Manager in pre-contract activities and evaluating and agreeing the value of payments and variations for a variety of works throughout the Route.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273923&p_spid=7579180&refsh=0"
  },
  {
    "jobId": "2274403",
    "title": "Operative [Overhead Line Equipment] - Leeds Holbeck",
    "location": {
      "city": "Leeds",
      "postcode": "LS11 9QG",
      "lat": 53.787498,
      "lng": -1.557755
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2023-12-27"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274403&p_spid=7582160&refsh=0"
  },
  {
    "jobId": "2274278",
    "title": "Operative (Signalling Maintenance) - 12 months FTC, fast track programme to Technician - Shrewsbury Coleham Depot",
    "location": {
      "city": "Shrewsbury",
      "postcode": "SY3 7LJ",
      "lat": 52.703206,
      "lng": -2.744239
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. This is a 12-month fixed term contract to complete the training and give you an opportunity to secure a permanent Technician at the conclusion of this contract.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274278&p_spid=7583085&refsh=0"
  },
  {
    "jobId": "2273924",
    "title": "Senior Commercial Manager - C&P",
    "location": {
      "city": "Leeds",
      "postcode": "LS1 4JB",
      "lat": 53.794865,
      "lng": -1.546622
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "To manage the post contract commercial contract management and support pre-contract activity of all frameworks and contracts related to the programme of works.This is a fantastic opportunity for an experienced Commercial Manager who has extensive experience on large scale complex contracts. You'll need extensive contract management experience coupled with strong leadership skills that can motivate and inspire a diverse team. You'll be a great team manager, but you will also need a head for detail and be commercially astute in order to drive this part of our business forward. As an Senior Commercial Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have an interesting and varied role, providing commercial support as required in accordance with established Network Rail policy.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273924&p_spid=7579181&refsh=0"
  },
  {
    "jobId": "2274588",
    "title": "Team Leader OLE x3",
    "location": {
      "city": "Kettering",
      "postcode": "NN15 7HJ",
      "lat": 52.393812,
      "lng": -0.730835
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-17",
      "end": "2024-01-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274588&p_spid=7582295&refsh=0"
  },
  {
    "jobId": "2271681",
    "title": "Team Leader [Signalling Maintenance] - Bedford (x4 Roles)",
    "location": {
      "city": "Bedford",
      "postcode": "MK40 1DP",
      "lat": 52.133439,
      "lng": -0.474904
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.x4 Roles available*Please note - S&T experience is essential for these roles*",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-03",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271681&p_spid=7568818&refsh=0"
  },
  {
    "jobId": "2274549",
    "title": "Lead Security Assurance Specialist",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "Support the Security Assurance Manager in the provision of cyber security assurance in respect of the application of the NR security assurance framework and regulatory and NR Standards. Support the delivery and continuous improvement of internal control and process to protect the availability, integrity and confidentiality of operational railway assets. This role will be based in and supporting the Eastern Region of Network Rail within the Engineering and Asset Management team. Day to day activities will include: Reviewing and supporting project documentation for cyber related activities. Cyber assessing digital operational equipment project designs for security & compliance. Undertaking assessments of regional operational equipment to review cyber and security risks. Implement and maintain governance and assurance for cyber security within the region. Manage the regions cyber security risk. Undertake any reporting, including regulatory. Develop and implement cyber security awareness campaigns. Support Building Information Modelling (BIM) Security.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274549&p_spid=7582256&refsh=0"
  },
  {
    "jobId": "2274576",
    "title": "Construction Manager - IP",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "Act as Network Rail's Construction quality representative to monitor so that the contractor's site activities are conducted in a safe and efficient manner with minimum impact on the environment and operational railway, and the work is of a high standard and in accordance with the relevant specifications and latest practices. Audit Alliance and supplier partners to ensure quality is maintained and act as an independent compliance and process overseer.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274576&p_spid=7582283&refsh=0"
  },
  {
    "jobId": "2274290",
    "title": "Team Leader - [Off Track Maintenance] - Hereford P/way",
    "location": {
      "city": "Hereford",
      "postcode": "HR1 1BB",
      "lat": 52.061798,
      "lng": -2.711285
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Brief Description You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274290&p_spid=7583097&refsh=0"
  },
  {
    "jobId": "2274398",
    "title": "Team Organiser - London Enterprise House",
    "location": {
      "city": "London",
      "postcode": "W2 6JX",
      "lat": 51.517922,
      "lng": -0.182223
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "To support a senior executive or a complex team, and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274398&p_spid=7582155&refsh=0"
  },
  {
    "jobId": "2271123",
    "title": "Team Leader [Off Track Maintenance] - York Leeman Road",
    "location": {
      "city": "York",
      "postcode": "YO26 4AB",
      "lat": 53.956089,
      "lng": -1.097246
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-10-26",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271123&p_spid=7561981&refsh=0"
  },
  {
    "jobId": "2274179",
    "title": "Technician (Track Maintenance)x2 - Newport Ebbw Junction",
    "location": {
      "city": "Newport",
      "postcode": "NP20 3BG",
      "lat": 51.568575,
      "lng": -3.009009
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274179&p_spid=7582086&refsh=0"
  },
  {
    "jobId": "2274283",
    "title": "Operative [Track Maintenance] x3 - Shrewsbury Coleman Depot",
    "location": {
      "city": "Shrewsbury",
      "postcode": "SY3 7LJ",
      "lat": 52.703206,
      "lng": -2.744239
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274283&p_spid=7583090&refsh=0"
  },
  {
    "jobId": "2274294",
    "title": "Operative - [Off Track] - Llandudno",
    "location": {
      "city": "Llandudno",
      "postcode": "LL31 9LU",
      "lat": 53.284327,
      "lng": -3.812763
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. Do you have experience in arboriculture? If so, please read more",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274294&p_spid=7583101&refsh=0"
  },
  {
    "jobId": "2274345",
    "title": "Team Organiser - Swindon Western House",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "To support a senior executive or a complex team, and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274345&p_spid=7582152&refsh=0"
  },
  {
    "jobId": "2271269",
    "title": "Environment Specialist",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "Do you have a keen interest in environmental challenges and/or a good understanding of the railway? Do you want to help contribute to climate change mitigation? The railway is an enabler for Net Zero and a clean way of travelling and you could be working in an industry that is part of the solution! Assurance plays a big part in our pledge to achieve Net Zero by 2050. This role will support colleagues on environmental management and carry out assurance activities.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-01",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271269&p_spid=7565765&refsh=0"
  },
  {
    "jobId": "2273673",
    "title": "Technician [Signalling Maintenance] - Middlesbrough Compound",
    "location": {
      "city": "Middlesbrough",
      "postcode": "TS1 1JP",
      "lat": 54.578215,
      "lng": -1.230479
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273673&p_spid=7578123&refsh=0"
  },
  {
    "jobId": "2273063",
    "title": "Section Administrator",
    "location": {
      "city": "Eastleigh",
      "postcode": "SO50 6AA",
      "lat": 50.971318,
      "lng": -1.346911
    },
    "salary": {
      "min": 24440,
      "max": 26000
    },
    "description": "Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273063&p_spid=7574000&refsh=0"
  },
  {
    "jobId": "2273573",
    "title": "Operative [Works Delivery Overhead Line Equipment] - Doncaster Marshgate Depot (x2 Roles)",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273573&p_spid=7578073&refsh=0"
  },
  {
    "jobId": "2274510",
    "title": "Senior Finance Business Partner (Senior Analyst)",
    "location": {
      "city": "Basingstoke",
      "postcode": "RG21 4FS",
      "lat": 51.271493,
      "lng": -1.072379
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "To work as an integral member of supported business senior leadership team, to proactively identify, plan and meet the analytical needs of the business in order to improve business performance, in coordination with other members of the wider business and operational teams as required. To positively support Senior Leaders with decision support tools, analytics and insight to enable the best business outcomes are delivered.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274510&p_spid=7582217&refsh=0"
  },
  {
    "jobId": "2273108",
    "title": "Shift Station Manager",
    "location": {
      "city": "London",
      "postcode": "SE1 8SW",
      "lat": 51.502706,
      "lng": -0.113277
    },
    "salary": {
      "min": 34000,
      "max": 38305
    },
    "description": "The Shift Station Manager manages the day to day performance of the Station team within set resources and budgets, in accordance with the company processes and objectives. They professionally deliver excellent and consistent customer service - providing an operationally safe, secure and quality station environment for all station stakeholders including TOCs, tenants, passengers, station users and retailers. Please Note: This role requires the incumbent to hold National Security Vetting / have passed a Counter Terrorism check. The successful candidate will not be permitted to start in the role until they have this clearance.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273108&p_spid=7575053&refsh=0"
  },
  {
    "jobId": "2257774",
    "title": "Technician (Cables)",
    "location": {
      "city": "Wimbledon",
      "postcode": "SW19 3QJ",
      "lat": 51.417246,
      "lng": -0.20818
    },
    "salary": {
      "min": 30522,
      "max": 30522
    },
    "description": "Working in all weathers on the frontline, you'll carry out maintenance to faulting on Telecoms cables, including jointing of copper cables and fibre jointing. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-05-17",
      "end": ""
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2257774&p_spid=7476542&refsh=0"
  },
  {
    "jobId": "2273663",
    "title": "Route Control Manager (ICC)",
    "location": {
      "city": "Manchester",
      "postcode": "M11 2ET",
      "lat": 53.473482,
      "lng": -2.197684
    },
    "salary": {
      "min": 53202,
      "max": 59853
    },
    "description": "To manage the delivery of the daily train plan within the ICC to meet the differing needs of rail industry customers. Maintain relationships with train operators and other key industry partners to minimise the impact of any disruption to both the timetable and passenger journeys and other customer operations. Please note security vetting clearance is required prior to starting the role.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-11",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273663&p_spid=7578113&refsh=0"
  },
  {
    "jobId": "2274295",
    "title": "Local Operations Manager",
    "location": {
      "city": "London",
      "postcode": "SW11 2LG",
      "lat": 51.46487,
      "lng": -0.166293
    },
    "salary": {
      "min": 56784,
      "max": 56784
    },
    "description": "Manage the day to day performance of the local operations team within set resources and budgets, in accordance with company processes and objectives, to provide a professional delivery of operational safety and the train service. Please Note: This post requires Security vetting. Unless already held the successful applicant for this role will be required to clear security vetting before any offer can be progressed.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274295&p_spid=7583102&refsh=0"
  },
  {
    "jobId": "2269063",
    "title": "Signalling Support Technician",
    "location": {
      "city": "Stockport",
      "postcode": "SK3 9PN",
      "lat": 53.396083,
      "lng": -2.166901
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Assist with the provision of technical support to the Engineering team.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269063&p_spid=7544819&refsh=0"
  },
  {
    "jobId": "2273921",
    "title": "Access Co-ordinator - Doncaster 10 Pound Walk",
    "location": {
      "city": "Doncaster",
      "postcode": "DN4 5HX",
      "lat": 53.512842,
      "lng": -1.130551
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "The purpose of this job is to arrange track access to support efficient delivery of maintenance and third party works in accordance with planning timescales.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273921&p_spid=7579178&refsh=0"
  },
  {
    "jobId": "2274071",
    "title": "Control Centre Technician",
    "location": {
      "city": "Crawley",
      "postcode": "RH10 1HW",
      "lat": 51.112355,
      "lng": -0.162994
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "The role is currently based at Three Bridges Rail Operating Centre [TBROC] in Crawley, West Sussex but will be moving to Three Bridges Area Signalling Centre [TBASC] in the near future. They will form part of a small Telecommunications engineering team based on-site at TBROC. Note: There is no on-call commitment and no requirement to go trackside with this role. The role is to primarily provide 1st line fault response, remote monitoring and technical assistance with 3rd line fault investigations.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Either",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274071&p_spid=7579233&refsh=0"
  },
  {
    "jobId": "2274130",
    "title": "Section Planner [Rail Testing & Lubrication] - Swindon Hawksworth Depot",
    "location": {
      "city": "Swindon",
      "postcode": "SN2 1EQ"
    },
    "salary": {
      "min": 21580,
      "max": 46340
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274130&p_spid=7580087&refsh=0"
  },
  {
    "jobId": "2273799",
    "title": "Section Administrator [Track] - Bristol Barton Hill",
    "location": {
      "city": "Bristol",
      "postcode": "BS5 9TX",
      "lat": 51.452607,
      "lng": -2.565645
    },
    "salary": {
      "min": 19802,
      "max": 35189
    },
    "description": "Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273799&p_spid=7579106&refsh=0"
  },
  {
    "jobId": "2273886",
    "title": "Works Delivery Manager (B&C) [Reactive]",
    "location": {
      "city": "Stockport",
      "postcode": "SK3 9PN",
      "lat": 53.396083,
      "lng": -2.166901
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?Manage and direct the Works Delivery team to deliver inspection, maintenance and renewal of assets to standards. Manage activities within agreed resource levels, budget and unit cost measures to achieve safety, asset performance, cost and quality business targets.The successful candidate will lead a Reactive works team undertaking immediate response, make safe and restoration of a range of buildings assets, from stations, office/staff accommodation, and lineside buildings across an area of Lancs and Cumbria or the Greater Manchester areas.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273886&p_spid=7578186&refsh=0"
  },
  {
    "jobId": "2274100",
    "title": "Technician -Signalling Maintenance",
    "location": {
      "city": "London",
      "postcode": "SE1 0NS",
      "lat": 51.504834,
      "lng": -0.101247
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader.Team Leader development opportunities and training will be available for successful candidates in this role. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274100&p_spid=7580057&refsh=0"
  },
  {
    "jobId": "2273693",
    "title": "Senior Project Engineer",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "As part of the Regional Engineering function, you will actively support the delivery of the Safety and Assurance Accountability of the DEAM function. This will require you to take an active role in conducting second line assurance of engineering activities within the Structures discipline across all functions (where required). You will seek opportunities within engineering controls, standards, and procedures to bring about improvements in safety, quality and cost effectiveness of design, maintenance, construction, commissioning amongst other technical activities on relevant projects and initiatives within the region.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273693&p_spid=7578143&refsh=0"
  },
  {
    "jobId": "2273654",
    "title": "Strategic Planner x 2",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "This role is at the heart of working with customers and stakeholders to plan for the future of our railway in the west, so that it continues to deliver what our passengers, freight users, and communities need. As Strategic Planner for your dedicated section of the route you will have the opportunity to work with a diverse and motivated group of internal and external stakeholders to identify and develop improvement strategies. You will have the opportunity to get intimately involved in new stations aspirations and potential service improvements, helping to advise on which and how to progress. You will also get to grapple with the big challenges including decarbonisation and levelling up – helping to set out how our railway can support the society we want to live in the short, middle, and long term. You will come to develop an excellent understanding of the areas we serve through your ability to build productive relationships across the board. You will be a key contact for influential external stakeholders including Subnational Transport Bodies and other strategic transport planning partners, helping them achieve their goals. You will be supported by a welcoming and inclusive strategic planning team, and become part of the wider Wales & Western Investment team, where you will work closely with sponsors to make sure that the strategic benefits you identify are translated into deliverable outcomes. You will find opportunities to grow both within the strategic planning team and in the wider investment team, and you will find that the breadth the role brings stands you in good stead for your next move. This is a fascinating and critical time for strategic rail planning, and you will have a real opportunity to shape the system for decades to come. Please note there are 2 job opportunities available",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273654&p_spid=7578104&refsh=0"
  },
  {
    "jobId": "2273694",
    "title": "Senior Project Engineer",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "As part of the Regional Engineering function, you will actively support the delivery of the Safety and Assurance Accountability of the DEAM function. This will require you to take an active role in conducting second line assurance of engineering activities within the Structures discipline across all functions (where required). You will seek opportunities within engineering controls, standards, and procedures to bring about improvements in safety, quality and cost effectiveness of design, maintenance, construction, commissioning amongst other technical activities on relevant projects and initiatives within the region.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273694&p_spid=7578144&refsh=0"
  },
  {
    "jobId": "2274411",
    "title": "Technician - Signalling Maintenance",
    "location": {
      "city": "London",
      "postcode": "SE1 0NS",
      "lat": 51.504834,
      "lng": -0.101247
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274411&p_spid=7582168&refsh=0"
  },
  {
    "jobId": "2274154",
    "title": "Asset Engineer",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "Manage the maintenance and renewal of the route Managed Station assets [Building Fabric] to deliver Network Rail's goals. Provide engineering expertise on Managed Station building fabric maintenance, renewal and enhancement matters.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-11",
      "end": "2023-12-25"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274154&p_spid=7582061&refsh=0"
  },
  {
    "jobId": "2273870",
    "title": "Team Leader [Overhead Line Equipment]",
    "location": {
      "city": "Manchester",
      "postcode": "M12 4HR",
      "lat": 53.461533,
      "lng": -2.199797
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273870&p_spid=7578170&refsh=0"
  },
  {
    "jobId": "2274194",
    "title": "Personal Assistant - Cardiff St Patrick's House",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide an efficient and effective personal support service to the Director and their team to support the delivery of their objectives",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274194&p_spid=7582101&refsh=0"
  },
  {
    "jobId": "2273399",
    "title": "Safety Improvement Specialist",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "🌟 Join Our Team as a Safety Improvement Specialist in Milton Keynes! 🌟 Are you passionate about making a real impact on safety, health, environment, and sustainability? We're on the lookout for an enthusiastic individual to join us in a permanent role and play a pivotal part in shaping the future of our organization. 🌐 Who Are We Looking For? We're in search of a dynamic Safety Improvement Specialist who thrives on influencing positive change. Based in Milton Keynes, you'll be the driving force behind local and national safety improvement programs. Your role is crucial in leading initiatives that not only enhance safety standards but also contribute to the broader health goals.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-12",
      "end": "2024-01-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273399&p_spid=7577156&refsh=0"
  },
  {
    "jobId": "2259560",
    "title": "Team Leader (Signalling Maintenance) - x 4",
    "location": {
      "city": "London",
      "postcode": "SE14 5UQ",
      "lat": 51.475386,
      "lng": -0.041874
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-08-17",
      "end": "2023-12-28"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2259560&p_spid=7495614&refsh=0"
  },
  {
    "jobId": "2272778",
    "title": "Systems Support Manager (Asset Management)",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "Lead and direct system and database management processes within asset management. Provide direction and support on the use of the systems and databases and all aspects of asset data management to provide accurate and current data quality and systems management. Undertake the management and maintenance of geospatial asset data; provide technical expertise and a specialist analysis service to internal and external customers of geospatial asset information.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272778&p_spid=7573915&refsh=0"
  },
  {
    "jobId": "2269896",
    "title": "Network Technical Head Track",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 97850,
      "max": 110081
    },
    "description": "Join Our Team as Network Technical Head Track! At Network Rail, we're more than just a railway infrastructure operator - we're a passionate team dedicated to crafting safe, reliable, and efficient transportation for people and goods. We take pride in supporting our country's economic prosperity and sustainable future. Now, we're looking for a Network Technical Head on a permanent basis, to lead our track engineering asset in Milton Keynes. If you're ready to make a significant impact and be a part of our inclusive and dynamic organisation, keep reading!",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269896&p_spid=7551776&refsh=0"
  },
  {
    "jobId": "2273562",
    "title": "Supervisor (B&C) - Derby Mercia House",
    "location": {
      "city": "Derby",
      "postcode": "DE21 6EN",
      "lat": 52.922338,
      "lng": -1.451901
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Manage, direct, organise and motivate the teams so that work is undertaken safely, efficiently and to the relevant standards. Undertake and direct inspection, faulting, maintenance and renewal work as allocated.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2024-01-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273562&p_spid=7578062&refsh=0"
  },
  {
    "jobId": "2273871",
    "title": "Technician [Distribution & Plant]",
    "location": {
      "city": "Manchester",
      "postcode": "M12 4HR",
      "lat": 53.461533,
      "lng": -2.199797
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273871&p_spid=7578171&refsh=0"
  },
  {
    "jobId": "2271703",
    "title": "Team Leader (Welding & Grinding) x 2",
    "location": {
      "city": "Hither Green",
      "postcode": "SE12 0UA",
      "lat": 51.448941,
      "lng": 0.005841
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-03",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271703&p_spid=7568840&refsh=0"
  },
  {
    "jobId": "2273582",
    "title": "Senior Finance Business Partner",
    "location": {
      "city": "Derby",
      "postcode": "DE24 8UP",
      "lat": 52.90915,
      "lng": -1.455814
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "About the role (External)",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273582&p_spid=7578082&refsh=0"
  },
  {
    "jobId": "2273813",
    "title": "Human Resources Business Partner",
    "location": {
      "city": "Birmingham",
      "postcode": "B1 2ND",
      "lat": 52.480088,
      "lng": -1.907533
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "Based in our central Birmingham office, you will work with the Capital Delivery leadership team, under the direction of the both the Head of Human Resources and Senior HR Business Partner to deliver the business aligned People Plan/HR strategy and provide coaching and support to members of the supported leadership team. You will provide pro-active, value-add HR support to the business leaders across Capital Delivery on medium term and operational people issues.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273813&p_spid=7579120&refsh=0"
  },
  {
    "jobId": "2273863",
    "title": "Shift Station Supervisor",
    "location": {
      "city": "Manchester",
      "postcode": "M60 3ZD"
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?Lead the station team to deliver excellent customer service on a shift basis so that work is undertaken safely and to relevant standards and a first class customer service experience is delivered.Please be aware this role holds a mandatory requirement for the incumbent to hold valid security vetting clearance. Any offer will be conditional on the successful candidate obtaining clearance prior to a start date being agreed.For further information including residency eligibility, please contact your recruiter for more details.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273863&p_spid=7578163&refsh=0"
  },
  {
    "jobId": "2272864",
    "title": "Seasons Delivery Specialist",
    "location": {
      "city": "Basingstoke",
      "postcode": "RG21 4FS",
      "lat": 51.271493,
      "lng": -1.072379
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "Are you a dynamic and passionate professional ready to lead the route in all aspects of seasons management and weather-related incidents? We are looking for a Seasonal Delivery Specialist to be the driving force behind our seasonal plans, ensuring the safe and effective delivery of services to our customers.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272864&p_spid=7574951&refsh=0"
  },
  {
    "jobId": "2274458",
    "title": "Project Engineer - Signalling",
    "location": {
      "city": "Doncaster",
      "postcode": "DN2 4FD",
      "lat": 53.555174,
      "lng": -1.086498
    },
    "salary": {
      "min": 43588,
      "max": 54484
    },
    "description": "As a Signalling Project Engineer, you will be an integral part of a multidisciplinary engineering team responsible for delivering projects within the CRSA portfolio. Your role will encompass the assurance of design and/or construction activities for assigned projects, ensuring strict adherence to the guidelines outlined in relevant legislation, Group and company standards, as well as Network Rail procedures within the CRSA program.In addition, you will play a vital role in collaborating closely with CREs (Contractors Responsible Engineers), CEMs (Contractors Engineering Managers), Project Managers, and various internal and external stakeholders. This position will require flexibility, including working from other offices when necessary.It's important to note that this role is specific to signalling, and thus, prior experience in signalling, preferably in maintenance, construction, testing, and/or design, is essential. You will be expected to work across multiple projects in the portfolio, so a solid understanding of relevant standards, particularly NR/L2/INI/02009, is crucial.As a Signalling Project Engineer, you will be an integral part of a multidisciplinary engineering team responsible for delivering projects within the CRSA portfolio. Your role will encompass the assurance of design and/or construction activities for assigned projects, ensuring strict adherence to the guidelines outlined in relevant legislation, Group and company standards, as well as Network Rail procedures within the CRSA program.In addition, you will play a vital role in collaborating closely with CREs (Contractors Responsible Engineers), CEMs (Contractors Engineering Managers), Project Managers, and various internal and external stakeholders. This position will require flexibility, including working from other offices when necessary.It's important to note that this role is specific to signalling, and thus, prior experience in signalling, preferably in maintenance, construction, testing, and/or design, is essential. You will be expected to work across multiple projects in the portfolio, so a solid understanding of relevant standards, particularly NR/L2/INI/02009, is crucial.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-14"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274458&p_spid=7583165&refsh=0"
  },
  {
    "jobId": "2273433",
    "title": "Senior Technical Officer [Track] - Gloucester Pway",
    "location": {
      "city": "Gloucester",
      "postcode": "GL1 1AH",
      "lat": 51.861356,
      "lng": -2.224928
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide technical support to the Maintenance Engineering team",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273433&p_spid=7577190&refsh=0"
  },
  {
    "jobId": "2274550",
    "title": "Level Crossing Manager",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": 35582,
      "max": 40029
    },
    "description": "BRIEF DESCRIPTION: There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Route Level Crossing Manager to join our East Coast Safety team. The East Coast Safety Team provides specialist advise andcheck out the full job description support to the East Coast Route on all aspects of health, safety and wellbeing, including public safety at level crossings. This covers all teams within the Route from Kings Cross station to the boarders of Scotland along the East Coast mainline. The level crossings team are responsible for inspecting and undertaking comprehensive risk assessments for the 350 crossings on the Route. The team is led by the Route Level Crossing Manager with Level Crossing Managers and an Assistant Level Crossing Manager making up the full team. The team is based across the route as the role involves visiting each crossing on a regular basis, but comes together to peer review reports and work together to tackle areas of concern. It's not essential to have a background in level crossings, as specialist training and mentorship will be provided and you will be trained to undertake level crossing risk assessments and inspections but could also be supporting the RLCM with the prioritisation of improvements and working with projects to provide level crossing expertise. With relevant experience, you could also be supporting and mentoring other LCM's helping them maintain relevant competencies. Check out the full job description attached. Role and Responsibilities may include but are not limited to: 1. Undertake, and review quantitative and qualitative risk assessments in accordance with relevant level crossings standards determining and implementing appropriate risk mitigation supported by cost benefit analysis. 2. Undertake level crossing inspection, faulting and maintenance, accurately report all work completed/not completed. 3. Review and evaluate planning applications where level crossings are, or may be, affected. Arrange for the drafting of level crossing orders required for modernisation, renewal or change to enable compliance with level crossing Legal Orders. 4. Identify and progress closure or implement other necessary control measures to reduce level crossing risk as low as reasonably practicable. 5. Lead operational input to level crossing renewal / modernisation / closure projects for inclusion in the business plan, taking into account operating requirements and risk mitigation factors. 6. Produce / maintain records as required. 7. Provide support to route safety meetings, including OPSRAM and TCRAG, as required. 8. Carry out work safely and in accordance with the safe systems of work procedures, method statements or other relevant instructions, adhering to company policies and procedures. 9. Manage the process for vehicles, plant, tools, equipment and materials under your control to be fit for use and to be used / stored and disposed of correctly.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274550&p_spid=7582257&refsh=0"
  },
  {
    "jobId": "2273434",
    "title": "Technical Officer [Track] - Gloucester P/way",
    "location": {
      "city": "Gloucester",
      "postcode": "GL1 1AH",
      "lat": 51.861356,
      "lng": -2.224928
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Assist with the provision of technical support to the Maintenance Engineering team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273434&p_spid=7577191&refsh=0"
  },
  {
    "jobId": "2273561",
    "title": "Project Engineer",
    "location": {
      "city": "York",
      "postcode": "YO24 4EH",
      "lat": 53.956654,
      "lng": -1.103019
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Project Engineer [E&P] to join our team to manage design and construction activities for allocated projects. Role and Responsibilities may include but are not limited to: 1. Implement Network Rail systems and procedures to maintain a cost effective, high quality, safe and environmentally responsible approach to design, construction, commissioning and other technical activities on relevant projects, compliant with all relevant legislation. Liaise with regulators and others as appropriate. 2. Engineer Projects to the standards and specification of Network Rail, allocated design and construction contracts include reference to and are compliant with appropriate Railway Group and Network Rail Company standards, formal specifications and procedures. 3. Manage all engineering activities so that they result in schemes that are affordable and meet programme requirements in a safe and environmentally responsible manner for time, cost and quality. 4. Maintain the use of relevant techniques and procedures of quantified and qualitative risk assessment and HAZOP analysis to allocated projects and manage the environmental aspects of allocated projects in accordance with Network Rail's environmental policy. 5. Monitor design and specialist consultants and contractors. 6. Provide project management advice in respect of all construction activities, including testing and commissioning and site supervision. Manage the design and/or construction elements of relevant projects meet the requirements of current legislation, including construction design management (CDM) regulations. 7. Internal and contractor's design/construction/specialists personnel are competent. 8. Undertake reviews of design and/or construction activities. Arrange audits of contractors monitoring safety, environment and quality of design, construction, testing and commissioning and management systems is adequate. 9. Carry out the duties of designated project engineer (DPE) for specific projects. 10. Identify and share best practice across the various project teams.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273561&p_spid=7578061&refsh=0"
  },
  {
    "jobId": "2272879",
    "title": "Section Manager M&E [Control & Systems Maintenance]",
    "location": {
      "city": "Gravesend",
      "postcode": "DA12 3AN",
      "lat": 51.402694,
      "lng": 0.386991
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "The role We are excited to be introducing a Section Manager M&E [Control & Systems Maintenance] into our team. Manage and direct the Infrastructure Maintenance delivery team to deliver inspection, maintenance and renewal of assets to standards. Manage activities within agreed resource levels, budget and unit cost measures to achieve safety, asset performance, cost and quality business targets. This is a permanent position, so come and be part of a truly unique business that brings the UK closer to Europe. We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272879&p_spid=7574966&refsh=0"
  },
  {
    "jobId": "2273400",
    "title": "Operative [Works Delivery Overhead Line Equipment] - Peterborough WHSmith Mews (x8 Roles)",
    "location": {
      "city": "Peterborough",
      "postcode": "PE3 6AL",
      "lat": 52.573113,
      "lng": -0.251019
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273400&p_spid=7577157&refsh=0"
  },
  {
    "jobId": "2272897",
    "title": "Engineer [M&E]",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "Who are we looking for? We are looking for an Engineer [M&E] to cover a Permanent position based In Milton Keynes. As an Engineer, you'll be responsible for taking the lead and working under the guidance of a Principal Engineer, acting as the technical expert or engineering support on a variety of low voltage fixed plant equipment (e.g., signalling power distribution systems, rail heating systems, operational lighting, etc.). The M&E Power Distribution team acts as the technical specialists for Network Rail with regards to this equipment. Liaison with both internal Network Rail departments and outside parties is a key requirement with good communication skills essential. Financial control and reporting in line with departmental procedures will be conducted for all projects. A Degree/HND/HNC in Electrical or Electrical/Mechanical or Electrical/Electronic Engineering is a must, along with experience and detailed knowledge of the working principles of plant and equipment. The ability to write technical reports and specifications as well as design capabilities in your field of expertise is desirable.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-04",
      "end": "2024-01-14"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272897&p_spid=7573934&refsh=0"
  },
  {
    "jobId": "2273961",
    "title": "Section Administrator [Track] - Cricklewood Depot",
    "location": {
      "city": "London",
      "postcode": "NW2 1HL",
      "lat": 51.558826,
      "lng": -0.213066
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273961&p_spid=7578211&refsh=0"
  },
  {
    "jobId": "2274178",
    "title": "Planning Assistant (Access)",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Planning Assistant (Access) to join our team to assist and support in the optimisation and integration of access into the Route engineering access plan. To work cross-functionally, liaising with all work requesters, customers and stakeholders to build and optimise the engineering access plan through worksite integration. This is a 12 month fixed term contract opportunity. Role and Responsibilities may include but are not limited to: 1. Support the Planning Team to deliver all activities associated with planning for possessions, worksites, line blockages, TSR's, On Track Machines and Engineering Trains in accordance with all relevant standards. 2. Process and support Route access requirements and successfully integrate within the engineering access plan. 3. Attendance, and when required co-chairing possession planning meetings including producing, checking, validating publications and updates as necessary. 4. Assist and support with the creation of materials and documentation to aid the operational delivery of the engineering access plan. 5. Engage with Route wide stakeholders and customers and support with the coordination of their access requirements. 6. Assist and support with the identification and implementation of quality and efficiency improvements.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274178&p_spid=7582085&refsh=0"
  },
  {
    "jobId": "2272873",
    "title": "Senior Engineer [M&E]",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "🚀 Join Our Team as a Senior Engineer [M&E] in Milton Keynes! 🚀 Who Are We Looking For? Are you an experienced Senior Engineer [M&E] ready to take on a new challenge? We're on the lookout for a talented individual to join our dynamic team in Milton Keynes. As a key player, you'll provide invaluable technical engineering expertise and support across a designated discipline. We're not just seeking an employee; we're searching for a passionate team member ready to make a significant impact. The successful candidate should demonstrate a good knowledge of electrical power distribution systems and equipment (both HV and LV) currently used on Network Rail infrastructure and be willing to lead a small team of M&E Engineers and Assistant Engineers to achieve the objectives set. Experience of, knowledge of, or interest in, IEC 61850 based equipment or electrical protection schemes & equipment in railways would be advantageous.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-06",
      "end": "2024-01-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272873&p_spid=7574960&refsh=0"
  },
  {
    "jobId": "2274394",
    "title": "Technical Officer",
    "location": {
      "city": "Bournemouth",
      "postcode": "BH8 8HX",
      "lat": 50.727352,
      "lng": -1.864021
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Assist with the provision of technical support to the Maintenance Engineering team",
    "department": "Southern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274394&p_spid=7583151&refsh=0"
  },
  {
    "jobId": "2273849",
    "title": "Operative [Track Maintenance] - Peterborough Spital House",
    "location": {
      "city": "Peterborough",
      "postcode": "PE3 6DD",
      "lat": 52.575407,
      "lng": -0.254145
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273849&p_spid=7578149&refsh=0"
  },
  {
    "jobId": "2273540",
    "title": "Technician [Track Maintenance] - Darlington Park Lane",
    "location": {
      "city": "Darlington",
      "postcode": "DL1 5AE",
      "lat": 54.518932,
      "lng": -1.548654
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273540&p_spid=7576247&refsh=0"
  },
  {
    "jobId": "2273537",
    "title": "Operative [Track Maintenance] - Morpeth Coopies Lane",
    "location": {
      "city": "Morpeth",
      "postcode": "NE61 6JJ",
      "lat": 55.163775,
      "lng": -1.675733
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273537&p_spid=7576244&refsh=0"
  },
  {
    "jobId": "2273913",
    "title": "Senior Arboriculturist",
    "location": {
      "city": "Glasgow",
      "postcode": "G2 5NW",
      "lat": 55.861671,
      "lng": -4.260649
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "We are in search of a dynamic individual to take the reins in providing unparalleled support to Scotland's Railway's internal and external delivery teams. In this role, you will not only lead the provision of Arboricultural expertise, but also offer crucial guidance to seamlessly integrate Network Rail standards, policy and strategies with industry best practice, the law and emerging innovation. Your role will be instrumental in ensuring the delivery of cost effective projects, against a robust specification, showcasing your commitment to professional stewardship of our national railway tree inventory. Join us in driving continuous improvement in tree and lineside management and be a key player in shaping a sustainable future.",
    "department": "Scotland Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273913&p_spid=7579170&refsh=0"
  },
  {
    "jobId": "2270012",
    "title": "Team Leader [Signalling Maintenance]",
    "location": {
      "city": "Westbury",
      "postcode": "BA13 4HZ",
      "lat": 51.268238,
      "lng": -2.19708
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270012&p_spid=7550839&refsh=0"
  },
  {
    "jobId": "2273967",
    "title": "Team Leader [Signalling Maintenance] - Retford Depot",
    "location": {
      "city": "Retford",
      "postcode": "DN22 7SW",
      "lat": 53.315095,
      "lng": -0.950212
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273967&p_spid=7578217&refsh=0"
  },
  {
    "jobId": "2273909",
    "title": "Senior Ecologist",
    "location": {
      "city": "Glasgow",
      "postcode": "G2 5NW",
      "lat": 55.861671,
      "lng": -4.260649
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "We are in search of a dedicated individual to take the reins in providing unparalleled support to Scotland's Railway's internal and external delivery teams. In this role, you will not only lead the provision of Ecological expertise, but also offer crucial guidance to seamlessly integrate Network Rail standards, policies and strategies with environmental best practice, legal requirements and emerging innovation. Your role will be instrumental in ensuring the delivery of cost effective projects, against a robust ecological specification, showcasing your commitment to professional stewardship of our lineside environment and the biodiversity it contains. Join us in driving continuous improvement of our Environmental Management Systems and the Ecology discipline and be a key player in shaping a sustainable future.",
    "department": "Scotland Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273909&p_spid=7579166&refsh=0"
  },
  {
    "jobId": "2273535",
    "title": "Technician [Signalling Maintenance] - Morpeth Coopies Lane",
    "location": {
      "city": "Morpeth",
      "postcode": "NE61 6JJ",
      "lat": 55.163775,
      "lng": -1.675733
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273535&p_spid=7576242&refsh=0"
  },
  {
    "jobId": "2273965",
    "title": "Team Leader [Signalling Maintenance] - Doncaster Mallard House",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273965&p_spid=7578215&refsh=0"
  },
  {
    "jobId": "2272393",
    "title": "Technician [Distribution & Plant] - Doncaster Mallard House X2 Roles available",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-15",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272393&p_spid=7571096&refsh=0"
  },
  {
    "jobId": "2272473",
    "title": "Team Leader",
    "location": {
      "city": "London",
      "postcode": "W2 6JX",
      "lat": 51.517922,
      "lng": -0.182223
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272473&p_spid=7572032&refsh=0"
  },
  {
    "jobId": "2273536",
    "title": "Operative [Signalling Maintenance] - Morpeth Coopies Lane",
    "location": {
      "city": "Morpeth",
      "postcode": "NE61 6JJ",
      "lat": 55.163775,
      "lng": -1.675733
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273536&p_spid=7576243&refsh=0"
  },
  {
    "jobId": "2271097",
    "title": "Technician",
    "location": {
      "city": "Bristol",
      "postcode": "BS2 0QW",
      "lat": 51.451281,
      "lng": -2.573875
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271097&p_spid=7561005&refsh=0"
  },
  {
    "jobId": "2273925",
    "title": "Programme Manager - IP",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 71163,
      "max": 80059
    },
    "description": "As a Programme Manager, you will be part of the wider W2BC Project team delivering works for the Transpennine Route Upgrade between Huddersfield and Stalybridge. You'll have a unique role which will manage the development and delivery of a civils programme of work to agreed scope, time, and cost. Day-to-day, you'll operate effectively working within and managing the civil engineering spoke of the programme so knowledge of other functional disciplines, in particular a civils background would be advantageous. You will lead the project through ES4, delivery to project close out by safely managing construction to design and value engineering.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273925&p_spid=7579182&refsh=0"
  },
  {
    "jobId": "2274341",
    "title": "Technician [Signalling Maintenance] - Doncaster Mallard House",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contractWe have multiple opportunities available.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2023-12-27"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274341&p_spid=7582148&refsh=0"
  },
  {
    "jobId": "2274373",
    "title": "Technician",
    "location": {
      "city": "Swindon",
      "postcode": "SN2 1EQ"
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274373&p_spid=7583130&refsh=0"
  },
  {
    "jobId": "2270959",
    "title": "Technician [Distribution & Plant]",
    "location": {
      "city": "Swindon",
      "postcode": "SN2 1EQ"
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270959&p_spid=7561867&refsh=0"
  },
  {
    "jobId": "2273851",
    "title": "Technician [Signalling Maintenance] - Peterborough Spital House",
    "location": {
      "city": "Peterborough",
      "postcode": "PE3 6DD",
      "lat": 52.575407,
      "lng": -0.254145
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2023-12-19"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273851&p_spid=7578151&refsh=0"
  },
  {
    "jobId": "2274385",
    "title": "Operative [Off Track] - Morpeth Coopies Lane",
    "location": {
      "city": "Morpeth",
      "postcode": "NE61 6JJ",
      "lat": 55.163775,
      "lng": -1.675733
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-13",
      "end": "2023-12-27"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274385&p_spid=7583142&refsh=0"
  },
  {
    "jobId": "2272888",
    "title": "Roster Clerk (Maintenance) - Fleckney",
    "location": {
      "city": "Leicester",
      "postcode": "LE2 0AA",
      "lat": 52.636052,
      "lng": -1.117817
    },
    "salary": {
      "min": 19000,
      "max": 42435
    },
    "description": "To maintain effective and efficient rosters for employees compliant with the relevant company standards in line with current National rostering principles, competency requirements and agreed Terms and Conditions.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-08",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272888&p_spid=7573925&refsh=0"
  },
  {
    "jobId": "2273134",
    "title": "Project Engineer (CDE) [Structures/Geotech]",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": 43588,
      "max": 49036
    },
    "description": "North Portfolio offers a unique opportunity to be involved in of all aspects of Rail project delivery on the Eastern Region comprising of the East Coast Mainline, North & East, East Midlands and Anglia routes. Whether delivering renewals with our route colleagues, minor enhancements with our sponsorship colleagues, or 3rd party funded interventions, we deliver projects across a range of disciplines including Signalling, Civil Engineering, Power & Distribution and Telecoms. Delivering projects across all project lifecycle stages, Portfolio North gives a unique development opportunity no matter your current level of experience. The Portfolio North team is made up 130 dedicated professionals delivering a portfolio of projects worth c£1.0bn. Within this the Building & Civils team has a turnover of c£450m over CP7. In Portfolio North we understand the value of developing our people, and our track record for development speaks for itself with almost 50% of our people having been promoted internally. Whatever level you join our team at, there will always be the opportunity to grow and develop in Portfolio North. As well as trusting and developing our people, in Portfolio North our values include supporting the wellbeing of our people, creating an inclusive and respectful environment whilst encouraging creativity, engaging openly and honestly with ourselves and our partners, all whilst driving a positive and safe culture at all times. At the very soul of Portfolio North is enjoying what we do, celebrating our successes, and continual learning. We are looking for a Project Engineer to provide client-side engineering leadership to projects from early development (PACE Phase 1) to delivery and handback (PACE Phase 3/4) within the North and East and East Coast Routes as part of a small team of other client-side engineers. Working within the client team of Portfolio Managers, Commercial Managers and Construction Assurance Specialists and many engineering and operational specialists, the role is required to provide technical leadership and assurance. Projects are delivered collaboratively with our funders and suppliers and a key part of the role will involve the early definition of the technical requirements and alignment to programme and budget. For this role we are looking for Civils, Structures, Buildings, Geotech experience from any relevant sectors that can be transferable to the railway environment. Typical schemes in the portfolio cover bridges, stations and earthworks and scope ranges from refurbishment to renewal and minor enhancements. The team also support the Signalling and Power teams with the civils aspects of these projects. We are looking for someone who can lead the building/civils aspects and can bring together all the technical specialists within the railway environment to provide high value, minimum cost solutions which meet the essential needs of stakeholders. The role of the railway is changing and the needs of stakeholders, clients and taxpayers is changing. As a client-side engineering leader, you have a unique opportunity to make these changes happen. This may include reducing embedded carbon, improving weather resilience, moving to a digital railway, embracing new technologies, attracting more leisure travellers, providing for aging customers, reducing the timescales needed to deliver railway projects as part of Project SPEED or demonstrating cost efficiency through the Minimum Viable Product initiatives.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-05",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273134&p_spid=7574021&refsh=0"
  },
  {
    "jobId": "2273784",
    "title": "Team Leader [Track Maintenance] - Leicester Depot",
    "location": {
      "city": "Leicester",
      "postcode": "LE2 0AA",
      "lat": 52.636052,
      "lng": -1.117817
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273784&p_spid=7579091&refsh=0"
  },
  {
    "jobId": "2273281",
    "title": "Technician (Distribution and Plant ) x 5 posts",
    "location": {
      "city": "Crawley",
      "postcode": "RH10 1HW",
      "lat": 51.112355,
      "lng": -0.162994
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-30",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273281&p_spid=7577088&refsh=0"
  },
  {
    "jobId": "2265637",
    "title": "Planning Assistant",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": 21580,
      "max": 46340
    },
    "description": "The Planning Assistant (Access) assists and supports in the optimisation and integration of access into the Route engineering access plan. They work cross-functionally, liaising with all work requesters, customers and stakeholders to build and optimise the engineering access plan through worksite integration",
    "department": "Southern Region",
    "dates": {
      "start": "2023-08-21",
      "end": "2023-12-22"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2265637&p_spid=7531759&refsh=0"
  },
  {
    "jobId": "2273964",
    "title": "Operative [Off Track] - Doncaster Mallard House",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'llhelp keep our nation moving every single day. Acritical part of the work we do is the daily upkeep of the rail network. As anoperative you'll work outdoors in a small team, supporting essentialmaintenance to keep the railway running safely and smoothly for passengers andfreight users.Ouroperative community comes from a variety of different backgrounds, and thismight be the first time that you've even considered a career in rail. We'refocused on your transferrable skills and behaviours and if you can demonstratethat, then we will provide you with all the necessary training to have youworking safely and competently out on the network.Andif you make the grade then you can look forward to a rewarding and fulfillingcareer with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273964&p_spid=7578214&refsh=0"
  },
  {
    "jobId": "2273344",
    "title": "Assurance Specialist (Licensing)",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 35582,
      "max": 44477
    },
    "description": "Who are we looking for? We are looking for an Assurance Specialist (Licensing) to fill a Permanent opportunity based in Milton Keynes, but with national travel and some evening/weekend working to provide industry assurance to the Client and technical authorities. Other locations may be considered on a case-by-case basis. Direct improvements of suppliers and Network Rail teams to drive performance including behavioural safety culture on site. Lead audits to determine compliance with CDM Regulations and Company Standards.",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-05",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273344&p_spid=7577151&refsh=0"
  },
  {
    "jobId": "2273797",
    "title": "Technician [Off Track] - Fleckney Maintenance Depot (x2 Roles)",
    "location": {
      "city": "Fleckney",
      "postcode": "LE8 8UR",
      "lat": 52.530711,
      "lng": -1.037634
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273797&p_spid=7579104&refsh=0"
  },
  {
    "jobId": "2271704",
    "title": "Team Leader Track Maintenance",
    "location": {
      "city": "Hither Green",
      "postcode": "SE12 0UA",
      "lat": 51.448941,
      "lng": 0.005841
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271704&p_spid=7568841&refsh=0"
  },
  {
    "jobId": "2274603",
    "title": "Technician [Track Maintenance] - Middlesbrough Compound",
    "location": {
      "city": "Middlesbrough",
      "postcode": "TS1 1JP",
      "lat": 54.578215,
      "lng": -1.230479
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274603&p_spid=7584060&refsh=0"
  },
  {
    "jobId": "2273869",
    "title": "Team Leader [Distribution & Plant]",
    "location": {
      "city": "Manchester",
      "postcode": "M12 4HR",
      "lat": 53.461533,
      "lng": -2.199797
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273869&p_spid=7578169&refsh=0"
  },
  {
    "jobId": "2273846",
    "title": "Technical Clerk",
    "location": {
      "city": "Liverpool",
      "postcode": "L1 1JT",
      "lat": 53.404361,
      "lng": -2.979554
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "What will you be doing?Provide an efficient and effective general administrative, technical and analytical service to the lead manager and their team.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-06",
      "end": "2023-12-20"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273846&p_spid=7579153&refsh=0"
  },
  {
    "jobId": "2268992",
    "title": "Information Manager",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": 46701,
      "max": 52538
    },
    "description": "To establish, implement, manage, and improve the provision of technical expertise for all project information disciplines throughout Network Rail Wales and Western Programmes of work; with the purpose of ensuring that project and programme project information deliverables and activities can deliver effective and efficient procurement, production, delivery and transfer of project information to meet business standards and relevant legislation. To support Wales and Western and wider business in the development of technical and technological solutions and strategies that improves or enhances the methodologies and working practices for managing project information.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-01",
      "end": "2024-01-03"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268992&p_spid=7543000&refsh=0"
  },
  {
    "jobId": "2274486",
    "title": "Service Delivery Supervisor - York - multiple opportunities available",
    "location": {
      "city": "York",
      "postcode": "YO26 4AB",
      "lat": 53.956089,
      "lng": -1.097246
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "The East Coast Route is pioneering new methods to better deliver for our customers. We want to introduce you to an exciting opportunity to be part of the leadership of our pioneering Service Delivery Centre (SDC) in York ROC. The Service Delivery Centre is the hub of digital rollout of new signalling technologies as part of the East Coast Digital Programme. To compliment the use of new signalling tools, new ways of working will benefit from signallers, controllers and other supporting roles working side-by-side to deliver a high-performing railway for all our rail users. We are seeking a new link of Service Delivery Supervisors for the York area of the SDC to provide to join us in a role that is vital to our success. Working closely with Industry stakeholders, you will be the key liaison and decision-maker to ensure the capacity of York Station platforms are maximised for the benefit of all passengers. You'll have a keen customer focus to balance the needs of passengers in Station operations together with protecting performance to deliver on-time services in and out of York. You'll be enthusiastic and keen to grasp new technologies. This role will be supported by new, proactive railway traffic management tools to enable you to deliver results, day in, day out. If required, you'll be trained as a competent signaller and given additional training to be able to support and lead your York signalling team in safely running the daily timetable to time. Role and Responsibilities may include but are not limited to: 1. Provide strong leadership and accountability for York Station operations delivery. 2. Lead all Industry stakeholders at York Station to ensure trains are platformed efficiently to maximise performance and passenger satisfaction. 3. Provide instruction and guidance to signalling team in liaison with the Train Running Controller (TRC) so that trains over the route infrastructure are run safely and efficiently and a safe and punctual train service is provided. 4. Implement pro-active train regulating decisions, communicating with Signallers and Control as necessary, using service information and Traffic Management systems, interpreting incoming information to identify potential disruption and initiate early action to minimise train delays. 5. During disruptive events, utilise Traffic Management systems to evaluate the train plan and develop service recovery plans with Control to mitigate safety risk and maximise performance. 6. Identify possible solutions to timetable irregularities and proactively work with Train Planning and Siemens to improve the robustness of the train plan. 7. Operate and assist on signalling workstations as required and where competent to do so to provide operational support during times of high workload and/or in times of exceptional circumstances. Liaise with Electrical Control Room Operators and Signallers to assist in implementing block(s) to electric traction and emergency switch offs as required and as directed, to maintain a safe environment for workforce, customers and passengers.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-15",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2274486&p_spid=7583193&refsh=0"
  },
  {
    "jobId": "2270235",
    "title": "Training & Competency Specialist",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "About the function…System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for?We are looking for someone with a passion for training and development. You will be responsible for creating and delivering training programmes across Capacity Planning, so we need someone who has exceptional training delivery and facilitation skills.About the function…System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for?We are looking for someone with a passion for training and development. You will be responsible for creating and delivering training programmes across Capacity Planning, so we need someone who has exceptional training delivery and facilitation skills.",
    "department": "System Operator",
    "dates": {
      "start": "2023-12-15",
      "end": "2024-01-07"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270235&p_spid=7557783&refsh=0"
  },
  {
    "jobId": "2272294",
    "title": "Workforce, Health, Safety & Environment Advisor [Mental Health]",
    "location": {
      "city": "Rugby",
      "postcode": "CV21 1EA",
      "lat": 52.381903,
      "lng": -1.261382
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide advice and support to the route teams on all primarily Health and wellbeing issues. Promote a positive cultural and behavioural change in all aspects of workforce health, safety and environmental management.Please note the role can be based in Rugby ROC or Birmingham Baskerville House.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-13",
      "end": "2023-12-27"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272294&p_spid=7571047&refsh=0"
  },
  {
    "jobId": "2273343",
    "title": "Senior Engineer",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": 55596,
      "max": 62546
    },
    "description": "🌟 Join Our Team as a Senior Engineer in Milton Keynes! 🚀 Are you an experienced plant engineer looking for an exciting permanent opportunity? Look no further! We are on the lookout for a dynamic Senior Engineer to bring their expertise to our team in Milton Keynes. The role will specifically be leading on making improvements in the approval process for railborne, non-railborne and fixed plant assets, ensuring the reliability and safety of critical railway equipment by evaluating their design, functionality, and compliance with industry standards and regulatory requirements. 👥 Who Are We Looking For? We are seeking an experienced Senior Engineer who is not only technically proficient, but also passionate about driving positive change within the plant discipline. If you have experience in accident and incident investigations, policy development, and strategic planning, you're exactly who we need!",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-12-14",
      "end": "2024-01-15"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273343&p_spid=7577150&refsh=0"
  },
  {
    "jobId": "2250616",
    "title": "Resourcing Business Partner Support & HR Business Partner Support ? talent pool ? Milton Keynes/Birmingham/Manchester",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Please note this is an active talent pool for both permanent and FTC opportunities. It is regularly being monitored and you will be contacted when a vacancy opens. Your application will be kept for up to 6 months. Salary Starting £25,000 up to £29,000 depending on experience As a Resourcing Business Partner Support, you will provide end to end recruitment service for a specific client group with your knowledge of appropriate recruitment methods and sourcing strategy As a Human Resources Business Partner Support, you will provide proactive, professional HR support to HR Business Partner teams to enable the delivery of value add HR support and the people plan for the supported organisation/s. These roles can be based anywhere within the North West & Central Region – Milton Keynes, Birmingham or Manchester.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-01-30",
      "end": ""
    },
    "status": "Either",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2250616&p_spid=7415370&refsh=0"
  },
  {
    "jobId": "2258319",
    "title": "Medical Co-Ordinator - Derby",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": 27820,
      "max": 30940
    },
    "description": "Occupational Health at Network RailThis is an exciting time to join our team of Occupational Health professionals, as we have just launched our inhouse service model, delivering flexibly, out of our 22 Occupational Health locations nationwide. It's a great time to join us as we begin our journey to shape the new service for our organisation and the rail industry.The health, safety & wellbeing of our colleagues is of the paramount importance to us, delivering a high-quality occupational health service, and proactively managing our people's immediate and long-term health and wellbeing risksWe're looking for people who are customer focussed, highly motivated, and committed to deliver our new In-House Occupational Health for our 46,000 colleagues, for both clinical and operational roles. We're creating a railway ‘Fit for the Future' so we need a workforce ‘Fit for the future' and you can play a key part in creating a sustainable service for the future.We're looking for a Medical Coordinator to join our Occupational Health Centre in Derby. As the first point of contact for colleagues you'll need to provide excellent customer service in a friendly and professional way.Managing the day-to day running of the OH centre you will be meeting and greeting colleagues, organising diaries for clinical appointments, making sure there is the relevant medical equipment and stationery. All this and more to support the effective and efficient delivery of occupational health services for your centre and make sure we are compliant with the relevant operational processes. Please note for this role you will be required to be on-site full time. Monday -Friday, 0830-1630. We are not able to offer hybrid working. So, if you want to be part of a team creating an exceptional Occupational Health Service to our colleagues and the Rail Industry then get in touch!",
    "department": "Technical Authority",
    "dates": {
      "start": "2023-05-30",
      "end": "2023-12-29"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2258319&p_spid=7482583&refsh=0"
  },
  {
    "jobId": "2272028",
    "title": "Section Planner",
    "location": {
      "city": "Stockport",
      "postcode": "SK3 9PN",
      "lat": 53.396083,
      "lng": -2.166901
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Brief Description: In the role of Relief Section Planner, you will be a vital contributor to our organisation's achievements by actively participating in planning activities within the Delivery Unit. Your core duty is to guarantee comprehensive coverage for our depots, especially during periods of Annual Leave and Sickness, and offering assistance to various sections for their planning and access requirements. You will collaborate closely with interdisciplinary teams, leveraging your proficiency in both access and systems planning. While your primary work location will be the Stockport Delivery Unit, travel across the entirety of Manchester's Delivery Unit and Depots will be necessary to meet resource demands.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-12-04",
      "end": "2023-12-18"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272028&p_spid=7570015&refsh=0"
  },
  {
    "jobId": "2273873",
    "title": "Principal Portfolio Manager",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": 97850,
      "max": 110081
    },
    "description": "The Capital Delivery Renewals and Minor Enhancements organisation is forecast to deliver £1.7bn of investment in CP7, through its four region-wide delivery teams. Each team is accountable for a portfolio focused on specific engineering disciplines / asset types. Our core purpose is based around specifying efficient, value for money solutions, progressing optimal procurement strategies, and ensuring a proportionate and effective approach to assurance. We are recruiting two key Principal Portfolio Manager roles, one to lead our Buildings Renewals and Enhancements team, and the other leading our Electrification & Plant portfolio. In addition to this functional accountability, these roles will also lead on senior stakeholder relationships in the Route where they are based, hence Stratford (supporting Anglia) and Derby (supporting East Midlands) are our preferred locations. We are looking for a proven senior leader, delivering railway projects in Network Rail or our supply chain. You'll offer a diverse set of skills and experience, be able to set direction for a large internal team and manage key stakeholder relationships with Network Rail colleagues and with the supply chain.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-12-07",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273873&p_spid=7578173&refsh=0"
  },
  {
    "jobId": "2273246",
    "title": "Senior Arboriculturist - Baglan",
    "location": {
      "city": "Baglan",
      "postcode": "SA12 7AX",
      "lat": 51.61977,
      "lng": -3.82217
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "You will lead the provision of Arboricultural expertise to Works Delivery and / or Maintenance teams and provide support and guidance to integrate the Network Rail Environment Policy and environment management systems to deliver legislative compliant projects and to contribute to continuous improvement in environment management. Byddwch yn arwain y ddarpariaeth o arbenigedd ceunell i dimau cyflawni a / neu gynnal a chadw gwaith ac yn darparu cefnogaeth ac arweiniad i integreiddio systemau polisi a rheolaeth yr amgylchedd rheilffordd y rhwydwaith i ddarparu prosiectau sy'n cydymffurfio â deddfwriaeth ac i gyfrannu at welliant parhaus wrth reoli'r amgylchedd.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2023-12-26"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273246&p_spid=7576103&refsh=0"
  },
  {
    "jobId": "2273675",
    "title": "Workplace Adjustments Manager",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Join our Equity, Diversity and Inclusion team in a brand new and pivotal role where you'll champion an inclusive work environment! As a key player, you'll be dedicated to supporting employees, HR colleagues, and managers in implementing our workplace adjustment policy and procedures. We're on the lookout for someone passionate about driving continuous improvement in the workplace adjustments process and system. Your role will involve managing governance and mitigating risks associated with workplace adjustments, along with supporting stakeholders at all levels of the business implement adjustments that can remove barriers for our colleagues. If you're committed to fostering an environment where everyone can thrive, and you're ready to make a positive impact, we invite you to be a part of our team.",
    "department": "Human Resources",
    "dates": {
      "start": "2023-12-08",
      "end": "2024-01-11"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273675&p_spid=7578125&refsh=0"
  },
  {
    "jobId": "2267023",
    "title": "Senior Technical Officer [Track] - Morpeth Coopies Lane",
    "location": {
      "city": "Morpeth",
      "postcode": "NE61 6JJ",
      "lat": 55.163775,
      "lng": -1.675733
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "Provide technical support to the Maintenance Engineering team.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-09-06",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2267023&p_spid=7534131&refsh=0"
  },
  {
    "jobId": "2273244",
    "title": "Senior Arboriculturist - Cardiff",
    "location": {
      "city": "Cardiff",
      "postcode": "CF11 8HP",
      "lat": 51.477212,
      "lng": -3.202185
    },
    "salary": {
      "min": 46701,
      "max": 52539
    },
    "description": "You will lead the provision of Arboricultural expertise to Works Delivery and / or Maintenance teams and provide support and guidance to integrate the Network Rail Environment Policy and environment management systems to deliver legislative compliant projects and to contribute to continuous improvement in environment management. Byddwch yn arwain y ddarpariaeth o arbenigedd ceunell i dimau cyflawni a / neu gynnal a chadw gwaith ac yn darparu cefnogaeth ac arweiniad i integreiddio systemau polisi a rheolaeth yr amgylchedd rheilffordd y rhwydwaith i ddarparu prosiectau sy'n cydymffurfio â deddfwriaeth ac i gyfrannu at welliant parhaus wrth reoli'r amgylchedd.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-12-12",
      "end": "2023-12-26"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273244&p_spid=7576101&refsh=0"
  },
  {
    "jobId": "2266883",
    "title": "Project Engineer - Buildings & Civils",
    "location": {
      "city": "Manchester",
      "postcode": "M1 2NY",
      "lat": 53.476887,
      "lng": -2.224489
    },
    "salary": {
      "min": null,
      "max": null
    },
    "description": "*This is a Talent Pool for any future positions that may open, so if you are interested in being considered for these roles in the future, please submit your CV* The Building, Civil and Lineside (BCL) team are a regional team (NW&C) of diverse engineering capabilities that provide technical and engineering support services to the Building, Civil and Lineside programmes as well as central operational functions. As a Project Engineer, you will work as part of a multi discipline engineering team to deliver projects across the Building, Civil and Lineside portfolio. The Project Engineer role will involve managing design and/or construction activities for allocated projects. You will ensure compliance to the requirements of the guide to the relevant legislation, group and company standards, and Network Rail procedures on allocated projects within the BCL programme. You will also be responsible for collaborating closely with CREs' and projects managers along with other internal and external stakeholders. This role can be based out of the Manchester/Birmingham office, but the role will involve flexible working from other offices as and when necessary. The applicant will be required to work across a number of projects in the portfolio and should have knowledge of relevant standards, particularly including NR/L2/INI/02009 We have two disciplines streams available. 1. Buildings Portfolio 2. Civils/Lineside",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-09-05",
      "end": "2023-12-31"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2266883&p_spid=7534041&refsh=0"
  }
]