[
  {
    "id": "2272534",
    "title": "Track Maintenance Engineer",
    "location": {
      "city": "Cardiff",
      "postcode": "CF11 8HP",
      "lat": 51.477212,
      "lng": -3.202185
    },
    "salary": {
      "min": "55596",
      "max": "62546"
    },
    "description": "You will lead and direct the Infrastructure Maintenance delivery team in the safe delivery of inspection and maintenance of functional assets to standards and within budget. Byddwch yn arwain ac yn cyfarwyddo'r Tîm Cyflenwi Cynnal a Chadw Seilwaith wrth ddarparu archwiliad a chynnal asedau swyddogaethol yn ddiogel i safonau ac o fewn y gyllideb.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272534&p_spid=7572871&refsh=0"
  },
  {
    "id": "2273019",
    "title": "Section Planner - Whitland SB",
    "location": {
      "city": "Carmarthen",
      "postcode": "SA31 2ES"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273019&p_spid=7575014&refsh=0"
  },
  {
    "id": "2272535",
    "title": "Senior Technical Officer [Track] - Cardiff (Canton)",
    "location": {
      "city": "Cardiff",
      "postcode": "CF11 8HP",
      "lat": 51.477212,
      "lng": -3.202185
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide technical support to the Maintenance Engineering team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272535&p_spid=7572872&refsh=0"
  },
  {
    "id": "2271677",
    "title": "Operative Track Maintenance x 4",
    "location": {
      "city": "London",
      "postcode": "SE1 0NS",
      "lat": 51.504834,
      "lng": -0.101247
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-03",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271677&p_spid=7568814&refsh=0"
  },
  {
    "id": "2252393",
    "title": "Commercial Manager",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": "43588",
      "max": "49037"
    },
    "description": "We have a fantastic opportunity for someone looking to develop their Commercial career path. As a Commercial Manager, you will provide pre and post-contract commercial management for the Maintenance Delivery Units in the Routes. The Maintenance Delivery Units carry out critical maintenance work to keep the railway running, simply put without it, the railway couldn't operate safely. The Maintenance Delivery Units rely on their supply chain to maintain the railway, it is important they are supported and that the supplier contracts they engage with are operated and administered properly to ensure continual service. Its busy, its reactive, its challenging, no two days are the same, but we operate in a hard-working but friendly and approachable culture. For an insight into a typical day as a Commercial Manager, please click the link to read our article: A Day in the Life of a Commercial ManagerWe have two permanent opportunities and one 12-month secondment/FTC opportunity (with the potential to be made permanent). These roles can be based across our North West & Central Region (at our Milton Keynes, Birmingham, or Manchester offices).",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-02-23",
      "end": ""
    },
    "status": "Either",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2252393&p_spid=7426401&refsh=0"
  },
  {
    "id": "2272437",
    "title": "Project Operations Interface Specialist",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "A great opportunity to join the Wessex Operations Team in developing and managing the project interface between the new electrical control room control system and re-controlling the current electrical controls rooms at Raynes Park and Eastleigh to Basingstoke Rail Operations Centre in 2025/26. You'll be working closely with the project teams delivering the project and the local Operations teams and the wider electrical control room operators function.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272437&p_spid=7571996&refsh=0"
  },
  {
    "id": "2272475",
    "title": "Head of Financial Control & Analysis",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "85395",
      "max": "96070"
    },
    "description": "To provide strategic oversight on leading the finance team/s that manage the financial analysis and accounting operations of the relevant business areas, to deliver budgets and financial forecasts, month-end reporting, year-end activities as well as financial and non-financial analysis to support strategic insight and enable sound business decisions to be made. The role leads on financial risk management and collaborates with senior leaders to create risk minimisation plans and contributes to enabling financial systems are fit for purpose.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272475&p_spid=7572034&refsh=0"
  },
  {
    "id": "2271885",
    "title": "Compliance Auditor",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "To undertake audits and deliver the Functional Audit Programme, verify the effectiveness of the audit framework and support the delivery of improvements where identified",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271885&p_spid=7569922&refsh=0"
  },
  {
    "id": "2269355",
    "title": "Asset Protection Engineer",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "We are currently seeking two Asset Protection Engineers to provide the professional engineering and technical interface with outside and third parties and manage the engineering and safety specification for the safe delivery of outside and third party activities so that cost, time and quality objectives are met and delivered within corporate guidelines and engineering risk is identified and mitigated. To deliver competent engineering assurance in compliance with engineering standards and legislation.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269355&p_spid=7545822&refsh=0"
  },
  {
    "id": "2271560",
    "title": "Early Engagement Client Partner",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "About the roleWe have an exciting opportunity for an Early Engagement Client Partner to support our continued growth to build a future skills pipeline of talent into the business. In this hands-on role, your challenge will be to inspire young people, particularly those from under-represented groups to ensure STEM careers is seen as a viable career choice for younger people. You will take ownership in the planning and delivery of our national STEM programmes, from work experience, school education programmes, events, campaigns and digital offerings.A significant part of the role is to engage with a variety of stakeholders internally and externally, who support the delivery of our early career programmes. This is a vital role for Network Rail to support our continued growth and will be instrumental in helping us deliver successful outcomes and to build our diverse pipeline of talent into the business.This role is ideal for someone passionate about early careers development and has experience of delivering outreach initiatives around early careers engagement. You should demonstrate knowledge of safeguarding, working with young people, volunteer recruitment, planning and delivering events and education programmes. We are looking for someone who is organised and possess a creative approach to problem solving and initiating improvements. This is a varied and exciting role and will involve travel to different events and offices and will require overnight stays.",
    "department": "Human Resources",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271560&p_spid=7567792&refsh=0"
  },
  {
    "id": "2268045",
    "title": "Senior Technical Operations Developer (Capacity Planning)",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "About the function… System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? Ideally, we are looking for candidates that have the below;Tech Requirements-C# -SQL-Net Framework/CoreTech Nice To Have-API design and integration -Azure Cloud Platform",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268045&p_spid=7538153&refsh=0"
  },
  {
    "id": "2266838",
    "title": "Project Manager",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Who are we looking for? We are looking for a Project Manager in the Finance Strategy & Development team within Group Finance for a 12-Month Fixed Term Contract (full time) based in Milton Keynes, with the potential to go permanent. The team delivers people and Learning & Development (L&D) related initiatives for the finance community. We are recruiting for the L&D Project Manager and Finance new entrants Project Manager. The new entrant management team is responsible for the development and management of the finance new entrant schemes. As Project manager, you will lead the development and delivery of the finance new entrants programme (graduates, apprentices, YII and summer placements) to agreed scope time, cost and quality requirements. You will have line management responsibilities for learners across multiple programmes. You will also work with other line managers to create and maintain project plans to support apprentice and graduate development. The L&D Project Manager delivers exciting Finance L&D initiatives such as the Annual Finance Conference, Talent development programmes, L&D webinars, mentoring programmes, Diversity & Inclusion initiatives as well as manage the sponsorship process for the finance community. Some of these initiatives span across the rail industry and involve finance colleagues from TOCs/FOCs and other rail organisations. You will be working with key stakeholders across the finance community including functional directors, executive sponsors, and their representatives. Central to these roles is the delivery of people related initiatives on behalf of the finance community (e.g. new entrants programme, diversity and inclusion initiatives; L&D initiatives; planning and delivering a yearly induction and training programme for the new entrants). You will work effectively with the wider finance community to empower colleagues (incl. apprentices and graduates) to help them enhance their personal development journeys and participate in industry wide collaborative initiatives for finance.",
    "department": "Finance",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2266838&p_spid=7536796&refsh=0"
  },
  {
    "id": "2271697",
    "title": "Level Crossing Manager",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "An accomplished Risk Management professional will develop, plan and implement proposals to improve operational safety on level crossings, delivered in accordance with the relevant legislation and Standards. To undertake level crossing inspection, faulting and maintenance as allocated. To build and manage effective relationships with both internal and external stakeholders.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271697&p_spid=7568834&refsh=0"
  },
  {
    "id": "2272657",
    "title": "Route Level Crossing Manager",
    "location": {
      "city": "Bristol",
      "postcode": "BS1 6NL",
      "lat": 51.448536,
      "lng": -2.58708
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "Lead the Route Level Crossing team in the delivery of compliance inspections, operational risk assessments, monitoring of operational interfaces and maintenance of the systems developed to manage and reduce level crossing risk across the Route.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272657&p_spid=7572944&refsh=0"
  },
  {
    "id": "2272915",
    "title": "Section Planner [Signaller] - 12 month FTC/Secondment - London Enterprise House",
    "location": {
      "city": "London",
      "postcode": "W2 6JX",
      "lat": 51.517922,
      "lng": -0.182223
    },
    "salary": {
      "min": "21580",
      "max": "46340"
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272915&p_spid=7573952&refsh=0"
  },
  {
    "id": "2267256",
    "title": "Ecologist",
    "location": {
      "city": "Llandudno",
      "postcode": "LL31 9LU",
      "lat": 53.284327,
      "lng": -3.812763
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "To provide ecological expertise to Works Delivery or Delivery Unit, including support and guidance to enable the environment management system to be integrated into the route teams to deliver legislative compliance.I ddarparu arbenigedd ecolegol i uned darparu neu gyflenwi gwaith, gan gynnwys cefnogaeth ac arweiniad i alluogi'r system rheoli amgylchedd i gael ei hintegreiddio i'r timau llwybr i sicrhau cydymffurfiad deddfwriaethol.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-09-28",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2267256&p_spid=7536964&refsh=0"
  },
  {
    "id": "2272563",
    "title": "Finance Business Partner",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "There is an exciting opportunity to join us in a role that is vital to our success. We are looking for a Finance Business Partner to join our team to work with the supported business leadership team, under the direction of the Financial Controller/Senior Finance Business Partner, to deliver professional finance and accounting advise. Providing proactive, value add finance support to the business leaders across the function/route. Role and Responsibilities may include but are not limited to: 1. Lead and provide financial advice and guidance to senior budget holders in understanding the impact of the period results and forecasts against budges so they can understand their business better. 2. Be the expert in the function on accounting practices and advise on financial results and forecasts for budget holders, including preparing period accruals, transfers and adjustments to validate accounts are reflective, relevant. 3. Manage corporate governance throughout the cost centres they manage, conducting deep dives and reviewing compliance with financial regulations to protect the business from legal or negative consequences. 4. Deliver expert and accurate business review information and reporting, and highlight any significant issues with financial and other business results to enable informed decision making by the business area. 5. Engage and influence senior members of the team to help them understand their financial position and use professional expertise to guide in initiatives to improve business performance 6. Build bottom up, detailed plans to manage and develop the production of business plans and budgets to enable good corporate governance and value add analysis for senior leaders 7. Identify and proactively manage commercial risks, including the financial suitability of new customers or suppliers reducing the potential risk impact on the business area and influencing decision makers. 8. Manage the performance of central accounting functions to deliver for the cost centre area to enable an efficiently and effective accounting service. 9. Collate, investigate and make recommendation for investment appraisals and business case analysis to aid business decisions. 10. Model and analyse cost base and identify and drive opportunities and efficiencies to achieve area targets. **Please note that this is a 12 month secondment opportunity**",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-03"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272563&p_spid=7572900&refsh=0"
  },
  {
    "id": "2273307",
    "title": "Cost Planning Assistant - Cardiff with other locations within the region considered",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To assist in the preparation of estimates and cost plans including preparing and inputting benchmarking information. Provide commercial management support to the cost planning and estimating team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273307&p_spid=7577114&refsh=0"
  },
  {
    "id": "2260050",
    "title": "Business Solutions Manager - 2 roles",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "44690",
      "max": "50276"
    },
    "description": "Are you a motivated, self-starter who is keen to collaborate and help the business improve? We are now looking for 2 Business Solutions Managers with experience and ambition in a combination of the following: Business management, coaching, facilitation, change management, improvement planning, project management, assurance, risk management and/or process management - who are motivated to work with business units to help advise and seek solutions to business problems. About the role… Our team provides improved confidence and understanding in the way we manage our business, through pro-active business support, consistent business insights and improved capabilities in governance, assurance, risk, improvement and change management.",
    "department": "Finance",
    "dates": {
      "start": "2023-10-10",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2260050&p_spid=7499567&refsh=0"
  },
  {
    "id": "2247479",
    "title": "Examiner Inspector (ERE) - Homebased",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Network Rail's East Midlands route is seeking an Examiner Inspector (STE4) to perform all Visual work, maximising efficiency and effectiveness, maintaining compliance to company processes at all times. There may be a requirement to undertake a variety of different examination types, although the main workstream is Visual Examinations. BSE (Bridge Strike Examiner) competency will be required to undertake on-call duties, if not held already, full training and mentorship will be provided.Please note this role is home based but will undertake examinations on the Eastern Region in some the following areas, Lincolnshire, Nottinghamshire, Derbyshire, Staffordshire, Leicestershire, Northamptonshire, Bedfordshire, Hertfordshire, Buckinghamshire & London. There may be opportunity to conduct examinations in the Anglia Region, but the role is for the specified locations. We are looking for the candidate to be based in the Lincolnshire area, most preferably in Sleaford, Lincoln, Grantham, Newark-on-Trent or Boston.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-05-14",
      "end": "2023-12-10"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2247479&p_spid=7387426&refsh=0"
  },
  {
    "id": "2272641",
    "title": "Operative - BASINGSTOKE - RAIL TESTING",
    "location": {
      "city": "Eastleigh",
      "postcode": "SO50 6AA",
      "lat": 50.971318,
      "lng": -1.346911
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for an Operative, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272641&p_spid=7572928&refsh=0"
  },
  {
    "id": "2271135",
    "title": "Technical Officer [Track] - Peterborough Spital House",
    "location": {
      "city": "Peterborough",
      "postcode": "PE3 6DD",
      "lat": 52.575407,
      "lng": -0.254145
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Assist with the provision of technical support to the Maintenance Engineering team.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271135&p_spid=7562764&refsh=0"
  },
  {
    "id": "2273237",
    "title": "Senior Technical Officer [Track] - Finsbury Park",
    "location": {
      "city": "London",
      "postcode": "N4 3EA",
      "lat": 51.566732,
      "lng": -0.107471
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide technical support to the Maintenance Engineering teamProvide technical support to the Maintenance Engineering team",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273237&p_spid=7576094&refsh=0"
  },
  {
    "id": "2273462",
    "title": "Head of Human Resources",
    "location": {
      "city": "London",
      "postcode": "SE1 8SW",
      "lat": 51.502706,
      "lng": -0.113277
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "About the role The Head of HR is responsible for shaping and executing our holistic approach to people management, encompassing people operations, employee relations, people engagement, people analytics, and talent attraction. Supported by a team of business partners and drawing on expertise in industrial and employee relations, reward, talent, learning and development from Centres of Expertise, you will need to inspire teams, set clear expectations, and work collaboratively with other stakeholders to drive forward the priorities of both System Operator and the organisation's People Strategy.",
    "department": "Human Resources",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273462&p_spid=7576169&refsh=0"
  },
  {
    "id": "2273099",
    "title": "Modelling & Data Assistant",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "About the function System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day Who are we looking for?We are looking for an individual who is inquisitive about data, and reviewing a diverse range of information sources to make create infrastructure model that are utilised for detailed simulation work. You will be a team player who'll be able to work to tight timescales. It is not essential that you have experience in using simulation toolkits (as training will be provided), but it is essential that you have an aptitude for data, detail and precision.",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273099&p_spid=7575044&refsh=0"
  },
  {
    "id": "2250616",
    "title": "Resourcing Business Partner Support & HR Business Partner Support ? talent pool ? Milton Keynes/Birmingham/Manchester",
    "location": {
      "city": "",
      "postcode": ""
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Please note this is an active talent pool for both permanent and FTC opportunities. It is regularly being monitored and you will be contacted when a vacancy opens. Your application will be kept for up to 6 months. Salary Starting £25,000 up to £29,000 depending on experience As a Resourcing Business Partner Support, you will provide end to end recruitment service for a specific client group with your knowledge of appropriate recruitment methods and sourcing strategy As a Human Resources Business Partner Support, you will provide proactive, professional HR support to HR Business Partner teams to enable the delivery of value add HR support and the people plan for the supported organisation/s. These roles can be based anywhere within the North West & Central Region – Milton Keynes, Birmingham or Manchester.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-01-30",
      "end": ""
    },
    "status": "Either",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2250616&p_spid=7415370&refsh=0"
  },
  {
    "id": "2273159",
    "title": "Senior Programme Manager - IP",
    "location": {
      "city": "Manchester",
      "postcode": "M1 2NY",
      "lat": 53.476887,
      "lng": -2.224489
    },
    "salary": {
      "min": "85395",
      "max": "96070"
    },
    "description": "To develop and deliver a programme of work in a safe and environmentally responsible manner to cost, time and quality in line with Company Standards procedures, PACE, P3M and corporate governance.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273159&p_spid=7575066&refsh=0"
  },
  {
    "id": "2272838",
    "title": "Infrastructure Maintenance Engineer (Llandudno)",
    "location": {
      "city": "Llandudno",
      "postcode": "LL31 9LU",
      "lat": 53.284327,
      "lng": -3.812763
    },
    "salary": {
      "min": "85395",
      "max": "96070"
    },
    "description": "You will lead and direct the Engineering team your two main depots will be Llandudno and Shrewsbury, where you will spend 2 days a week in each of these locations. You will ensure your teams remain compliant in the efficient delivery of inspection, maintenance, and project related works for all Infrastructure assets to meet relevant standards. You will also drive culture transformation for safety and asset performance, creating continual improvement and deliver safety, compliance and performance strategies, following business processes in order to deliver a compliant, well performing asset through a safe large multi-disciplinary team. Please check out the document attached to this vacancy for more information on what it's like to work in the Wales route team in Wales & Western region! Byddwch yn arwain ac yn cyfarwyddo'r tîm peirianneg eich dau brif ddepo fydd Llandudno a Amwythig, lle byddwch chi'n treulio 2 ddiwrnod yr wythnos ym mhob un o'r lleoliadau hyn. Byddwch yn sicrhau bod eich timau'n parhau i gydymffurfio wrth ddarparu gwaith arolygu, cynnal a chadw a chysylltiedig â phrosiect yn effeithlon ar gyfer pob ased seilwaith i fodloni safonau perthnasol. Byddwch hefyd yn gyrru trawsnewid diwylliant ar gyfer diogelwch a pherfformiad asedau, gan greu gwelliant parhaus a sicrhau diogelwch, cydymffurfio a strategaethau perfformiad, yn dilyn prosesau busnes er mwyn sicrhau ased sy'n cydymffurfio, sy'n perfformio'n dda trwy dîm amlddisgyblaethol mawr diogel diogel. Edrychwch ar y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn nhîm Llwybr Cymru yn Rhanbarth Cymru a Gorllewinol!",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272838&p_spid=7574925&refsh=0"
  },
  {
    "id": "2266883",
    "title": "Project Engineer - Buildings & Civils",
    "location": {
      "city": "Manchester",
      "postcode": "M1 2NY",
      "lat": 53.476887,
      "lng": -2.224489
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "*This is a Talent Pool for any future positions that may open, so if you are interested in being considered for these roles in the future, please submit your CV* The Building, Civil and Lineside (BCL) team are a regional team (NW&C) of diverse engineering capabilities that provide technical and engineering support services to the Building, Civil and Lineside programmes as well as central operational functions. As a Project Engineer, you will work as part of a multi discipline engineering team to deliver projects across the Building, Civil and Lineside portfolio. The Project Engineer role will involve managing design and/or construction activities for allocated projects. You will ensure compliance to the requirements of the guide to the relevant legislation, group and company standards, and Network Rail procedures on allocated projects within the BCL programme. You will also be responsible for collaborating closely with CREs' and projects managers along with other internal and external stakeholders. This role can be based out of the Manchester/Birmingham office, but the role will involve flexible working from other offices as and when necessary. The applicant will be required to work across a number of projects in the portfolio and should have knowledge of relevant standards, particularly including NR/L2/INI/02009 We have two disciplines streams available. 1. Buildings Portfolio 2. Civils/Lineside",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-09-05",
      "end": "2023-12-31"
    },
    "status": "Full Time",
    "type": "Future Vacancy",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2266883&p_spid=7534041&refsh=0"
  },
  {
    "id": "2272076",
    "title": "Senior Business Information & Reporting Analyst",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "Who are we looking for? We support 20 of the largest stations in the UK, making sure we deliver outstanding service for hundreds of millions of passengers a year. You'll be joining the Customer Experience and Accessibility Team where we strive to make stations better for all customers in an inclusive way. We're seeking a candidate who has substantial experience in extracting information and reporting from multiple data sources. If you have excellent communication and analytical skills, and a desire to make an impact within a dynamic environment, you're the one we want. You'll have a track record of supporting a customer facing business where contributing to service is part of your DNA. Ideally, we're looking for someone with a background in the transport sector, but will consider relevant and transferable expertise from other sectors.",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272076&p_spid=7571013&refsh=0"
  },
  {
    "id": "2273213",
    "title": "Communications Manager",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "Network Rail's Southern region works with train operators to serve passengers and freight customers from Devon in the west, to Kent in the east, and the huge commuter markets of South London. Our railway links major towns and cities and serves channel routes to Europe, as well as Gatwick and Southampton airports. The region is also responsible for some of the busiest stations in the country including Waterloo, London Bridge, Victoria, as well as Cannon Street, Clapham Junction, Charing Cross and Guildford.We operate the busiest and most congested rail lines in the country and are dedicated to putting passengers first. Key to this is effective communications and showing people that we care, highlighting the work we do to enable safe and unincumbered travel. At the heart of our work is the communities we serve and if you join us, you will support the delivery of this important mission.About the roleWe are looking for a Project Communications Manager to join our team in Wessex route, part of the Southern region at Network Rail. We're investing heavily to renew older parts of our railway, so that passengers can travel without delays. To complete our upgrades, we need to close sections of the railway from time to time, and it's essential we communicate this clearly, concisely and in good time.Our ideal candidate will have a proven track record in delivering campaigns and be able to manage and deliver consistent and effective communications strategies for our key projects. You will be great at building relationships. Internally you will work closely with our project managers to untangle and explain the complex work they're delivering, so that everyone understands the benefits of our projects. Externally you will work across the industry with train operating companies to deliver a clear and consistent message, with advice on alternative travel options. We are looking for someone comfortable dealing with agencies, you will know instinctively what messaging will work as we try to modify the travel plans of our passengers and will enjoy promoting our work via traditional and social media. Securing the support of the communities we serve is critical to enabling us to close the railway and managing the resulting disruption, without tarnishing our reputation. You will need to be able to identify opportunities to win the hearts and minds of influential stakeholders so that our project teams can deliver their work. Based in Blackfriars, London, you will report to the Senior Communications Manager as part of the External Affairs team delivering project communications services to the Communications Directorate.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273213&p_spid=7576070&refsh=0"
  },
  {
    "id": "2269928",
    "title": "Technician [Track Maintenance]",
    "location": {
      "city": "Taunton",
      "postcode": "TA1 1QP",
      "lat": 51.023564,
      "lng": -3.099063
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-13",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269928&p_spid=7550805&refsh=0"
  },
  {
    "id": "2272402",
    "title": "Operative [Track Maintenance] - Doncaster Mallard House",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.A critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272402&p_spid=7571105&refsh=0"
  },
  {
    "id": "2268726",
    "title": "Operative [Track Maintenance]",
    "location": {
      "city": "Bristol",
      "postcode": "BS5 9TX",
      "lat": 51.452607,
      "lng": -2.565645
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268726&p_spid=7543931&refsh=0"
  },
  {
    "id": "2270882",
    "title": "Operative [Signalling Maintenance]",
    "location": {
      "city": "Par",
      "postcode": "PL24 2LT",
      "lat": 50.355998,
      "lng": -4.704362
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270882&p_spid=7560890&refsh=0"
  },
  {
    "id": "2273252",
    "title": "Timetable Simulation Team Leader",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "About the function System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? We are looking for an individual who knows what it takes to develop and promote great performing teams that are great places to work. You will possess excellent communication skills and be able to prioritise and delegate workload to a team of Timetable Simulation Analysts, supporting the teams' Portfolio Managers and Project Managers with the correct analyst, at the right time to deliver our teams strategic aims. In addition, you will understand how best to develop your team members and foster a culture of continuous improvement and personal development. It is not essential that you have experience in using simulation toolkits (as training will be provided), but it is essential that you have an aptitude for solving problems and can work within a small team environment that influences the end-to-end timetable planning process.",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273252&p_spid=7577059&refsh=0"
  },
  {
    "id": "2270883",
    "title": "Technician [Signalling Maintenance]",
    "location": {
      "city": "Plymouth",
      "postcode": "PL4 6AB",
      "lat": 50.377472,
      "lng": -4.1437
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270883&p_spid=7560891&refsh=0"
  },
  {
    "id": "2273239",
    "title": "Technician [Off Track] - Shrewsbury Coleham Depot",
    "location": {
      "city": "Shrewsbury",
      "postcode": "SY3 7LJ",
      "lat": 52.703206,
      "lng": -2.744239
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network.As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. Do you have experience in leading a team in an outdoor or construction environment, and/or experience in construction, drainage, arboriculture, agriculture, drainage or fencing?",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273239&p_spid=7576096&refsh=0"
  },
  {
    "id": "2273417",
    "title": "Project Manager - IP",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "55596",
      "max": "62546"
    },
    "description": "Part of TRU is the exciting introduction of the new train control technology that needs a dedicated project management team to deliver several technical interventions across the TRU route. The role will need an enthusiastic and dynamic leader that has a strong Project Management background along with the ability to converse with stakeholders at all levels.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273417&p_spid=7577174&refsh=0"
  },
  {
    "id": "2273362",
    "title": "Technician",
    "location": {
      "city": "Reading",
      "postcode": "RG1 8FJ",
      "lat": 51.458816,
      "lng": -0.962118
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-15"
    },
    "status": "Part Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273362&p_spid=7576119&refsh=0"
  },
  {
    "id": "2271681",
    "title": "Team Leader [Signalling Maintenance] - Bedford (x4 Roles)",
    "location": {
      "city": "Bedford",
      "postcode": "MK40 1DP",
      "lat": 52.133439,
      "lng": -0.474904
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.x4 Roles available*Please note - S&T experience is essential for these roles*",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-03",
      "end": "2023-12-21"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271681&p_spid=7568818&refsh=0"
  },
  {
    "id": "2272777",
    "title": "Commercial Manager (Cardiff or Bristol)",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": "43588",
      "max": "49037"
    },
    "description": "The Wales & Western Capital Delivery team believe in the ‘One Team' ethos. You will be working in a team that is passionate about delivering safely, efficiently and providing value for money for our passengers, train and freight operators and the taxpayer. We are embarking on an exciting delivery model for Control Period 7. Our portfolio is diverse spanning from Buildings & Civils, Enhancements, Track, Signalling, Power and Communications. The projects delivered can range from major enhancements e.g., HS2 Old Oak Common Station on the Great Western Mainline to medium sized enhancements, third party funded projects, renewals and minor works. All of these are key to keeping our railway safe and running. Our focus is on recruiting and retaining people who are key to the running of our railway. We are committed to supporting learning and development and enabling individuals to bring their whole selves to work. We are passionate about diversity and inclusion and have evidenced that a diverse team has enabled better delivery. The location can be Cardiff or Bristol. Please see document attached to this vacancy for more information on what it's like to work in the Commercial Function of Wales & Western region! Mae Tîm Cyflenwi Cyfalaf Cymru a'r Gorllewin yn credu yn yr ethos ‘un tîm'. Byddwch yn gweithio mewn tîm sy'n angerddol am gyflawni'n ddiogel, yn effeithlon a darparu gwerth am arian i'n teithwyr, gweithredwyr trên a chludo nwyddau a'r trethdalwr. Rydym yn cychwyn ar fodel dosbarthu cyffrous ar gyfer cyfnod rheoli 7. Mae ein portffolio yn rhychwantu amrywiol o adeiladau a sifiliaid, gwelliannau, trac, signalau, pŵer a chyfathrebu. Gall y prosiectau a ddarperir amrywio o welliannau mawr e.e., HS2 Old Oak Common Station on the Great Western Mainline i welliannau maint canolig, prosiectau a ariennir gan drydydd parti, adnewyddiadau a mân weithiau. Mae'r rhain i gyd yn allweddol i gadw ein rheilffordd yn ddiogel ac yn rhedeg. Mae ein ffocws ar recriwtio a chadw pobl sy'n allweddol i redeg ein rheilffordd. Rydym wedi ymrwymo i gefnogi dysgu a datblygu a galluogi unigolion i ddod â'u hunain i weithio. Rydym yn angerddol am amrywiaeth a chynhwysiant ac wedi tystio bod tîm amrywiol wedi galluogi danfon yn well. Gall y lleoliad fod yn Gaerdydd neu Fryste. Gweler y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn swyddogaeth fasnachol Rhanbarth Cymru a Gorllewin!",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272777&p_spid=7573914&refsh=0"
  },
  {
    "id": "2273221",
    "title": "Timetable Analyst (System Operator)",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "About the function System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? We are looking for an individual to provide analytical support and insight to help drive the understanding of, and improvement in timetable performance. You will be inquisitive about data and challenge the status quo, whilst possessing strong analytical skills to interpret data using tools and present them concisely to senior audiences.",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273221&p_spid=7576078&refsh=0"
  },
  {
    "id": "2270686",
    "title": "Operative [Track Maintenance]",
    "location": {
      "city": "Slough",
      "postcode": "SL1 3QE",
      "lat": 51.513011,
      "lng": -0.595767
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270686&p_spid=7560794&refsh=0"
  },
  {
    "id": "2272998",
    "title": "Technician",
    "location": {
      "city": "Gloucester",
      "postcode": "GL1 1AH",
      "lat": 51.861356,
      "lng": -2.224928
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272998&p_spid=7574993&refsh=0"
  },
  {
    "id": "2264096",
    "title": "Team Leader [Signalling Maintenance]",
    "location": {
      "city": "Westbury",
      "postcode": "BA13 4HZ",
      "lat": 51.268238,
      "lng": -2.19708
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-08-16",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2264096&p_spid=7524580&refsh=0"
  },
  {
    "id": "2273222",
    "title": "Lead Timetable Analyst",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "About the function System Operator are passionate about capacity. We craft tomorrow's railway to meet future needs of the rail industry. By understanding what the future requirements of the railway are, we can plan the long-term capability of the network, promoting the efficient use of network capacity. We improve the railway for the millions of people who use it every single day. Who are we looking for? We are looking for an individual to provide analytical leadership and insight to help drive the understanding of, and improvement in timetable performance. The individual will have strong knowledge and analytical awareness to lead and deliver packages of work. You will be inquisitive about data and challenge the status quo, whilst possessing strong analytical skills to interpret data using tools and present them concisely to senior audiences.",
    "department": "System Operator",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273222&p_spid=7576079&refsh=0"
  },
  {
    "id": "2272315",
    "title": "Team Leader",
    "location": {
      "city": "Slough",
      "postcode": "SL1 1XW",
      "lat": 51.510907,
      "lng": -0.590733
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272315&p_spid=7571068&refsh=0"
  },
  {
    "id": "2272192",
    "title": "Project Management Assistant",
    "location": {
      "city": "Manchester",
      "postcode": "M1 2NY",
      "lat": 53.476887,
      "lng": -2.224489
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "We are looking for an enthusiastic, driven applicant who likes a challenge. The role is to support the Senior Management Team in everyday management of the Project, through detailed design and delivery. As part of your role, you will be responsible for maintaining trackers, chasing actions and updating the team with information via the various project meetings. You will monitor and report progress via our Alliance reporting systems and assist with general project queries. This is an opportunity for a talented individual to join the TRU West Alliance. We are upgrading the Infrastructure from Huddersfield to Leeds over the course of the next 5 years on the biggest railway project in the North. You need to have the ability to work in a fast-paced environment and under pressure. The ideal candidate will have great communication skills, written and verbal, be able to act with their own initiative to solve problems and provide a consistent level of support to the Senior Team. You will be working directly for the TRU West Delivery Director in this exciting role.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272192&p_spid=7571029&refsh=0"
  },
  {
    "id": "2268737",
    "title": "Technician [Track Maintenance]",
    "location": {
      "city": "Didcot",
      "postcode": "OX11 7HJ",
      "lat": 51.619119,
      "lng": -1.256837
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2268737&p_spid=7543942&refsh=0"
  },
  {
    "id": "2272901",
    "title": "Team Leaderx3 [Signalling Maintenance] - London Enterprise House",
    "location": {
      "city": "London",
      "postcode": "W2 6JX",
      "lat": 51.517922,
      "lng": -0.182223
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Brief Description You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272901&p_spid=7573938&refsh=0"
  },
  {
    "id": "2263882",
    "title": "Technician [Signalling Maintenance]",
    "location": {
      "city": "Slough",
      "postcode": "SL1 1XW",
      "lat": 51.510907,
      "lng": -0.590733
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-07-31",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2263882&p_spid=7522747&refsh=0"
  },
  {
    "id": "2271896",
    "title": "Head of Communications [Wales] - 12 Months Fixed Term",
    "location": {
      "city": "Cardiff",
      "postcode": "CF10 5ZA"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "This is an exciting opportunity to provide strategic leadership for the development and delivery of a communications strategy for the route that is consistent and compliant with Network Rail's overall corporate communications strategy. Please check out the document attached to this vacancy for more information on what it's like to work in the Wales route team in Wales & Western region! Mae hwn yn gyfle cyffrous i ddarparu arweinyddiaeth strategol ar gyfer datblygu a darparu strategaeth gyfathrebu ar gyfer y llwybr sy'n gyson ac yn cydymffurfio â strategaeth gyfathrebu gorfforaethol gyffredinol Network Rail. Edrychwch ar y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn nhîm Llwybr Cymru yn Rhanbarth Cymru a Gorllewinol!",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271896&p_spid=7569933&refsh=0"
  },
  {
    "id": "2272621",
    "title": "Team Leader",
    "location": {
      "city": "Bristol",
      "postcode": "BS5 9TX",
      "lat": 51.452607,
      "lng": -2.565645
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272621&p_spid=7572080&refsh=0"
  },
  {
    "id": "2272624",
    "title": "Team Leader",
    "location": {
      "city": "Gloucester",
      "postcode": "GL1 1AH",
      "lat": 51.861356,
      "lng": -2.224928
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272624&p_spid=7572083&refsh=0"
  },
  {
    "id": "2270965",
    "title": "Operative [Overhead Line Equipment]",
    "location": {
      "city": "Bristol",
      "postcode": "BS2 0QW",
      "lat": 51.451281,
      "lng": -2.573875
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270965&p_spid=7561873&refsh=0"
  },
  {
    "id": "2272869",
    "title": "Operative [Welding & Grinding]",
    "location": {
      "city": "Darlington",
      "postcode": "DL1 5AE",
      "lat": 54.518932,
      "lng": -1.548654
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.A critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272869&p_spid=7574956&refsh=0"
  },
  {
    "id": "2272792",
    "title": "Operative [Signalling Maintenance]",
    "location": {
      "city": "Didcot",
      "postcode": "OX11 7HJ",
      "lat": 51.619119,
      "lng": -1.256837
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272792&p_spid=7574879&refsh=0"
  },
  {
    "id": "2273250",
    "title": "Technician - Doncaster Mallard House X2 Roles available",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273250&p_spid=7577057&refsh=0"
  },
  {
    "id": "2271614",
    "title": "Technician [Track Maintenance] - Baglan MDU",
    "location": {
      "city": "Baglan",
      "postcode": "SA12 7AX",
      "lat": 51.61977,
      "lng": -3.82217
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271614&p_spid=7567846&refsh=0"
  },
  {
    "id": "2270879",
    "title": "Technician [Signalling Maintenance]",
    "location": {
      "city": "Par",
      "postcode": "PL24 2LT",
      "lat": 50.355998,
      "lng": -4.704362
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270879&p_spid=7560887&refsh=0"
  },
  {
    "id": "2272913",
    "title": "Team Leader [Track Maintenance] - Bristol Barton Hill",
    "location": {
      "city": "Bristol",
      "postcode": "BS5 9TX",
      "lat": 51.452607,
      "lng": -2.565645
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272913&p_spid=7573950&refsh=0"
  },
  {
    "id": "2269174",
    "title": "Technician [Track Maintenance]",
    "location": {
      "city": "Knighton",
      "postcode": "LD7 1DT",
      "lat": 52.344501,
      "lng": -3.045014
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269174&p_spid=7543076&refsh=0"
  },
  {
    "id": "2273360",
    "title": "Technician [Track Maintenance] - Wakefield Kirkgate Station",
    "location": {
      "city": "Wakefield",
      "postcode": "WF1 4EL",
      "lat": 53.678652,
      "lng": -1.489373
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273360&p_spid=7576117&refsh=0"
  },
  {
    "id": "2270041",
    "title": "Technician [Track Maintenance]",
    "location": {
      "city": "Bristol",
      "postcode": "BS5 9TX",
      "lat": 51.452607,
      "lng": -2.565645
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. This is a critical part of the work we do is the daily upkeep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270041&p_spid=7550868&refsh=0"
  },
  {
    "id": "2272620",
    "title": "Operative - Doncaster Mallard House Permanent",
    "location": {
      "city": "Doncaster",
      "postcode": "DN1 1QU",
      "lat": 53.526502,
      "lng": -1.136589
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272620&p_spid=7572079&refsh=0"
  },
  {
    "id": "2272581",
    "title": "Operative [Track Maintenance] - Scunthorpe Welding Plant",
    "location": {
      "city": "Scunthorpe",
      "postcode": "DN16 1AX",
      "lat": 53.576795,
      "lng": -0.623836
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272581&p_spid=7572040&refsh=0"
  },
  {
    "id": "2271704",
    "title": "Team Leader Track Maintenance",
    "location": {
      "city": "Hither Green",
      "postcode": "SE12 0UA",
      "lat": 51.448941,
      "lng": 0.005841
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271704&p_spid=7568841&refsh=0"
  },
  {
    "id": "2273352",
    "title": "Team Leader [Track Maintenance] - Hull Depot",
    "location": {
      "city": "Hull",
      "postcode": "HU2 0AB",
      "lat": 53.751678,
      "lng": -0.33805
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273352&p_spid=7576109&refsh=0"
  },
  {
    "id": "2272554",
    "title": "Technician [Off Track] - Wakefield Kirkgate Station",
    "location": {
      "city": "Wakefield",
      "postcode": "WF1 4EL",
      "lat": 53.678652,
      "lng": -1.489373
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272554&p_spid=7572891&refsh=0"
  },
  {
    "id": "2271507",
    "title": "Culture & HR Programme Manager (Change)",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "71163",
      "max": "80059"
    },
    "description": "An exciting opportunity with Southern Region to lead our Cultural Change Programme, Southern Region. Within the Southern Regions plan, we have three clear principles to help us face current challenges within the region and to help us become Better Together Southern. ​​​​​​​They describe how we want to work together and create a culture that people want to be part of as we move forward, together. They describe how we can look at our attitudes and behaviours at work and make changes in our approach where necessary. In short, they help us think about what it means to be a Southern Region employee. Collectively, they shine the spotlight on three key ways of working that can help us think about how we do our jobs and what we're willing to change – in our everyday activities, what we do, how we do it, the way we interact with others and the decisions we make. Your role will be to take the lead with this exciting change programme what has a number of workstreams from on-going programmes, to accelerated target areas and new progressive workstreams across the region, great progress has been made so far with this programme, the next steps will be to take this emersion and rollout across Southern Region.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271507&p_spid=7566789&refsh=0"
  },
  {
    "id": "2272567",
    "title": "Technician [Overhead Line Equipment] - Leeds Holbeck",
    "location": {
      "city": "Leeds",
      "postcode": "LS11 9QG",
      "lat": 53.787498,
      "lng": -1.557755
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272567&p_spid=7572904&refsh=0"
  },
  {
    "id": "2272580",
    "title": "Operative [Track Maintenance] - Grimsby Railway Terr",
    "location": {
      "city": "Grimsby",
      "postcode": "DN32 0RR"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272580&p_spid=7572039&refsh=0"
  },
  {
    "id": "2269818",
    "title": "Signal Sighting Engineer",
    "location": {
      "city": "Birmingham",
      "postcode": "B1 2ND",
      "lat": 52.480088,
      "lng": -1.907533
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "What will you be doing? Manage SPAD (signal passed at danger) mitigation and associated signal sighting activities across the allocated geography.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Either",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269818&p_spid=7547026&refsh=0"
  },
  {
    "id": "2272582",
    "title": "Operative [Track Maintenance] - Barnetby Depot",
    "location": {
      "city": "Barnetby",
      "postcode": "DN38 6DQ",
      "lat": 53.574717,
      "lng": -0.412549
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in thisrole if you opt to take the GTRM IMC25 contract",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272582&p_spid=7572041&refsh=0"
  },
  {
    "id": "2272426",
    "title": "Senior Project Engineer (CDE) [Structures/Geotech]",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "55596",
      "max": "62546"
    },
    "description": "North Portfolio offers a unique opportunity to be involved in of all aspects of Rail project delivery on the Eastern Region comprising of the East Coast Mainline, North & East, East Midlands and Anglia routes. Whether delivering renewals with our route colleagues, minor enhancements with our sponsorship colleagues, or 3rd party funded interventions, we deliver projects across a range of disciplines including Signalling, Civil Engineering, Power & Distribution and Telecoms. Delivering projects across all project lifecycle stages, Portfolio North gives a unique development opportunity no matter your current level of experience.The Portfolio North team is made up 130 dedicated professionals delivering a portfolio of projects worth c£1.0bn. Within this the Building & Civils team has a turnover of c£450m over CP7.In Portfolio North we understand the value of developing our people, and our track record for development speaks for itself with almost 50% of our people having been promoted internally. Whatever level you join our team at, there will always be the opportunity to grow and develop in Portfolio North.As well as trusting and developing our people, in Portfolio North our values include supporting the wellbeing of our people, creating an inclusive and respectful environment whilst encouraging creativity, engaging openly and honestly with ourselves and our partners, all whilst driving a positive and safe culture at all times. At the very soul of Portfolio North is enjoying what we do, celebrating our successes, and continual learning.We are looking for a Senior Project Engineer to provide client-side engineering leadership to projects from early development (PACE Phase 1) to delivery and handback (PACE Phase 3/4) within the North and East and East Coast Routes as part of a small team of other client-side engineers. Working within the client team of Portfolio Managers, Commercial Managers and Construction Assurance Specialists and many engineering and operational specialists, the role is required to provide technical leadership and assurance. The role will manage a team of Buildings/Civils Engineers to deliver the Project Engineering roles across a portfolio of works as well as individually deliver the Project Engineer role for specific projects. Projects are delivered collaboratively with our funders and suppliers and a key part of the role will involve the early definition of the technical requirements and alignment to programme and budget.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-03"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272426&p_spid=7571129&refsh=0"
  },
  {
    "id": "2273064",
    "title": "Operative - Signalling Maintenance",
    "location": {
      "city": "Southampton",
      "postcode": "SO15 4GW",
      "lat": 50.920956,
      "lng": -1.439831
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273064&p_spid=7574001&refsh=0"
  },
  {
    "id": "2272606",
    "title": "Team Leader (Welding & Grinding) x 2",
    "location": {
      "city": "Wimbledon",
      "postcode": "SW19 7JY",
      "lat": 51.423121,
      "lng": -0.204287
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.We are currently recruiting 2 x Team Leaders for this location",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272606&p_spid=7572065&refsh=0"
  },
  {
    "id": "2272653",
    "title": "Programme Manager (Change)",
    "location": {
      "city": "Derby",
      "postcode": "DE23 8JQ",
      "lat": 52.911618,
      "lng": -1.464705
    },
    "salary": {
      "min": "71163",
      "max": "80059"
    },
    "description": "To manage the development and delivery of a programme of change projects to agreed scope, time, cost and quality requirements, working with Function Directors, Executive Sponsors and their representatives.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272653&p_spid=7572940&refsh=0"
  },
  {
    "id": "2272654",
    "title": "Programme Manager (Change)",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": "71163",
      "max": "80059"
    },
    "description": "To manage the development and delivery of a programme of change projects to agreed scope, time, cost and quality requirements, working with Function Directors, Executive Sponsors and their representatives.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272654&p_spid=7572941&refsh=0"
  },
  {
    "id": "2272652",
    "title": "Programme Manager (Change)",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "71163",
      "max": "80059"
    },
    "description": "To manage the development and delivery of a programme of change projects to agreed scope, time, cost and quality requirements, working with Function Directors, Executive Sponsors and their representatives.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272652&p_spid=7572939&refsh=0"
  },
  {
    "id": "2273416",
    "title": "Operative - BASINGSTOKE - RAIL TESTING",
    "location": {
      "city": "South Norwood",
      "postcode": "SE25 5AG",
      "lat": 51.397356,
      "lng": -0.075567
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for an Operative, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273416&p_spid=7577173&refsh=0"
  },
  {
    "id": "2273038",
    "title": "Technician (Conductor Rail Equipment) x 5",
    "location": {
      "city": "South Norwood",
      "postcode": "SE25 5AG",
      "lat": 51.397356,
      "lng": -0.075567
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273038&p_spid=7573975&refsh=0"
  },
  {
    "id": "2264279",
    "title": "Installer",
    "location": {
      "city": "York",
      "postcode": "YO24 4EH",
      "lat": 53.956654,
      "lng": -1.103019
    },
    "salary": {
      "min": "33274",
      "max": "38090"
    },
    "description": "What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards. What will you be doing? As an Installer you will form part of a team carrying out Signalling Installation works on sites throughout the network. You will be Installing Signalling Equipment to specific technical standards whilst also ensuring all completed work meets our high-quality standards. We will also be looking to you as an Installer to carry out works set by the Supervisor and Team Leader in an efficient and safe manner, you will also be required to be organised and be able to motivate members of the team. You will record results confirming the outcome of safety checks and ensure that they are in line with standards set by Network Rail. Responsible for ensuring that: • Safe systems of work are in place and are monitored regularly. • All PPE and individual equipment and transport is put together and packed for the required for the tasks set • Plant and equipment are calibrated and are operated safely and without risk to health or the environment. • Ensuring any legal obligations are followed. • Completing all works in line with Network Rail standards.",
    "department": "Route Services",
    "dates": {
      "start": "2023-11-10",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2264279&p_spid=7524713&refsh=0"
  },
  {
    "id": "2273076",
    "title": "Senior Finance Business Partner",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "55596",
      "max": "62546"
    },
    "description": "To work as an integral member of supported business senior leadership team, to proactively identify, plan and meet the finance needs of the business in order to improve business performance, in coordination with other members of the wider finance team as required. To positively challenge Senior Leaders, budgets and business activities to enable the best business outcomes are delivered.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273076&p_spid=7574013&refsh=0"
  },
  {
    "id": "2272870",
    "title": "Assistant Engineer (Structures)",
    "location": {
      "city": "Manchester",
      "postcode": "M1 2NY",
      "lat": 53.476887,
      "lng": -2.224489
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Carry out work as directed contributing to the management of structures engineering assets to deliver Region and Route goals, based on condition, value and sustainable delivery. Assist in managing the inspection, examination, assessment and monitoring of structures assets. Gain experience in all aspects of managing activities consistent with meeting requirements for appropriate professional qualifications and capability to undertake senior engineering roles within Network Rail.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272870&p_spid=7574957&refsh=0"
  },
  {
    "id": "2272658",
    "title": "Senior Asset Engineer (Support) [Digital]",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "55596",
      "max": "62546"
    },
    "description": "We are seeking a highly motivated Technical Support Engineer to support the Head of Assets (Signalling), Kent Route, in managing and maintaining the European Train Control Systems (ETCS) and related systems. In this role you will be responsible for overseeing the trackside, interlocking and vital data transmission elements of the ETCS system. You will also manage the ongoing Defect Reporting Analysis and Corrective Action System (DRACAS process) and chair multi-discipline and cross-industry liaisons. As a member of the senior signalling team in the route you will support wider engineering assurance activities and reliability improvement initiatives with a focus on digital systems. If you are passionate about the railway signalling industry, the future of computer-based signalling systems, and have the skills and experience required for this position we encourage you to apply. We offer a competitive salary and benefits package, and opportunities for professional development.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272658&p_spid=7572945&refsh=0"
  },
  {
    "id": "2272094",
    "title": "Team Leader - Rail Testing",
    "location": {
      "city": "South Norwood",
      "postcode": "SE25 5AG",
      "lat": 51.397356,
      "lng": -0.075567
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-09",
      "end": "2032-11-23"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272094&p_spid=7570031&refsh=0"
  },
  {
    "id": "2273380",
    "title": "Technician - (Off Track) x 2 Roles",
    "location": {
      "city": "Brighton",
      "postcode": "BN1 3TU",
      "lat": 50.832672,
      "lng": -0.14443
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader.You'll help keep our nation moving every single day.A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding. Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273380&p_spid=7576137&refsh=0"
  },
  {
    "id": "2273385",
    "title": "Section Planner",
    "location": {
      "city": "Brighton",
      "postcode": "BN1 3TU",
      "lat": 50.832672,
      "lng": -0.14443
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273385&p_spid=7576142&refsh=0"
  },
  {
    "id": "2272601",
    "title": "Technician [Distribution & Plant]",
    "location": {
      "city": "Carlisle",
      "postcode": "CA2 4AA",
      "lat": 54.885303,
      "lng": -2.923777
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily up keep of the rail network. As a technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.Please Note: There may be a requirement to work on call in this role if you opt to take the GTRM IMC25 contract",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272601&p_spid=7572060&refsh=0"
  },
  {
    "id": "2272639",
    "title": "Operative - BASINGSTOKE - RAIL TESTING x 2 Roles",
    "location": {
      "city": "Yeovil",
      "postcode": "BA22 9UU",
      "lat": 50.924858,
      "lng": -2.612117
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for an Operative, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272639&p_spid=7572926&refsh=0"
  },
  {
    "id": "2265458",
    "title": "Operative [Track Maintenance] - 2 positions available",
    "location": {
      "city": "Barrow In Furness",
      "postcode": "LA14 5QZ",
      "lat": 54.118766,
      "lng": -3.226006
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "What will you be doing?You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.Andif you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-08-30",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2265458&p_spid=7531692&refsh=0"
  },
  {
    "id": "2272480",
    "title": "Performance & Assurance Engineer",
    "location": {
      "city": "London",
      "postcode": "SW11 2UH",
      "lat": 51.462967,
      "lng": -0.174589
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Manage the assurance and compliance processes within the delivery unit. Monitor and report on asset performance, reliability, productivity, efficiency and compliance. Make recommendations that will improve business performance.This is an opportunity for 12 months",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272480&p_spid=7571133&refsh=0"
  },
  {
    "id": "2272634",
    "title": "Planning Assistant (Infrastructure Maintenance) - Doncaster 10 Pound Walk",
    "location": {
      "city": "Doncaster",
      "postcode": "DN4 5HX",
      "lat": 53.512842,
      "lng": -1.130551
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide support and assistance in all aspects of Delivery Unit Planning activities.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272634&p_spid=7572921&refsh=0"
  },
  {
    "id": "2271883",
    "title": "Access Co-ordinator",
    "location": {
      "city": "London",
      "postcode": "SW11 2UH",
      "lat": 51.462967,
      "lng": -0.174589
    },
    "salary": {
      "min": "21580",
      "max": "46340"
    },
    "description": "Arrange track access to support efficient delivery of maintenance and third party works in accordance with planning timescales. Produce and maintain the Delivery Unit Possession Plan.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271883&p_spid=7569920&refsh=0"
  },
  {
    "id": "2265411",
    "title": "Operative [Track Maintenance] - 2 positions available",
    "location": {
      "city": "Whitehaven",
      "postcode": "CA28 6AX",
      "lat": 54.552522,
      "lng": -3.586496
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "What will you be doing?You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.Andif you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-08-30",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2265411&p_spid=7527819&refsh=0"
  },
  {
    "id": "2272879",
    "title": "Section Manager M&E [Control & Systems Maintenance]",
    "location": {
      "city": "Gravesend",
      "postcode": "DA12 3AN",
      "lat": 51.402694,
      "lng": 0.386991
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "The role We are excited to be introducing a Section Manager M&E [Control & Systems Maintenance] into our team. Manage and direct the Infrastructure Maintenance delivery team to deliver inspection, maintenance and renewal of assets to standards. Manage activities within agreed resource levels, budget and unit cost measures to achieve safety, asset performance, cost and quality business targets. This is a permanent position, so come and be part of a truly unique business that brings the UK closer to Europe. We're dedicated to building a diverse and inclusive organisation that reflects the passengers we serve. To achieve this, we're committed to becoming an open, diverse, and inclusive workplace, leveraging the skills and expertise of our talented workforce. Together, we strive to create a safe and accessible railway for everyone. Discover more about the importance of Diversity and Inclusion at Network Rail by clicking here. Investing in our people is key to enhancing the safety, reliability, and efficiency of our railway system. If you're passionate about making a meaningful impact, then this opportunity is for you! About our people and the recruitment process - We're an inclusive employer of choice and we welcome applications from everyone! We encourage our colleagues to work flexibly, as we know traditional working patterns don't always fit. If you want to consider working flexibly, just let us know and we'll do our best to help and invest in your career with us, whilst you have a healthy work life balance. We're also a Disability Confident Leader employer and we'll try our best to adapt the process and offer a reasonable alternative to help support people with disabilities access, apply and interview for roles.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272879&p_spid=7574966&refsh=0"
  },
  {
    "id": "2272906",
    "title": "Infrastructure Maintenance Engineer",
    "location": {
      "city": "Romford",
      "postcode": "RM7 0ER",
      "lat": 51.569107,
      "lng": 0.161561
    },
    "salary": {
      "min": "85395",
      "max": "96070"
    },
    "description": "Romford Delivery Unit is seeking an Infrastructure Maintenance Engineer. They will lead and direct the Engineering team in the efficient delivery of inspection, maintenance, and project related works for all Infrastructure assets to meet relevant standards. The successful candidate will drive culture transformation for safety and asset performance creating continual improvement and deliver safety, compliance and performance strategies, following business processes in order to deliver a compliant, well performing asset through a safe large multi-disciplinary team.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272906&p_spid=7573943&refsh=0"
  },
  {
    "id": "2272911",
    "title": "Section Supervisor [Track] - Gloucester Pway",
    "location": {
      "city": "Gloucester",
      "postcode": "GL1 1AH",
      "lat": 51.861356,
      "lng": -2.224928
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. Your role is a tactical role to assist the Section Manager in the inspection, maintenance and renewal of assets to standards and within agreed resource levels, budget and unit cost measures. You will supervise the delivery of work and undertake specific inspections as required. Assist in the management of staff as directed.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272911&p_spid=7573948&refsh=0"
  },
  {
    "id": "2273056",
    "title": "Section Administrator (Track) - jobshare",
    "location": {
      "city": "Croydon",
      "postcode": "CR0 2BD",
      "lat": 51.380391,
      "lng": -0.092305
    },
    "salary": {
      "min": "24000",
      "max": "27000"
    },
    "description": "Provide an accurate, efficient and effective administrative support to the line manager. Work as directed or using own initiative as the situation demands.We would be interested from hearing from candidates that would be interested in doing a Job share within this role, please upload a covering letter detailing the type of pattern you would be interested in working or whether you would like a permanent post",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273056&p_spid=7573993&refsh=0"
  },
  {
    "id": "2273044",
    "title": "Station Control Assistant",
    "location": {
      "city": "London",
      "postcode": "NW1 2RT",
      "lat": 51.528672,
      "lng": -0.132535
    },
    "salary": {
      "min": "26440",
      "max": "35189"
    },
    "description": "To provide a comprehensive monitoring and control of the stations' systems, providing accurate information to all interested parties as appropriate.Please Note: This role requires the incumbent to hold security vetting, no start date or hire should be progressed until the required vetting clearance has been obtained. For further information, please contact NationalSecurityVetting@Networkrail.co.uk (Delete before advertising)",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273044&p_spid=7573981&refsh=0"
  },
  {
    "id": "2272647",
    "title": "Resourcing Business Partner( 12 month secondment/ 12 month Fixed Term Contract)",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "We have a 12-month Secondment/ FTC opportunity for a Resourcing Business Partner to be part of Network Rail's Southern Region Resourcing Team. You'll form part of our Southern Region Resourcing Team and be the dedicated RBP for our Sussex Route. Based at London Blackfriars, you will provide an exceptional candidate experience, as well as providing specialist resourcing advice and guidance to hiring managers. We are able to offer hybrid working, with the requirement to be in the office 2/3 days a week.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272647&p_spid=7572934&refsh=0"
  },
  {
    "id": "2272761",
    "title": "Project Planner / Analyst",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "Network Rail have an opportunity for the right candidate to become part of our Capital Delivery Eastern team as a Capital Programme Planning Assurance Analyst This is an exciting unique opportunity for a committed, highly motivated & enthusiastic individual to join our Planning Assurance team. As a Planning Assurance Analyst your role will be to support the business to ensure successful delivery of our projects. As an integral part of the business the Planning Assurance team are responsible for assuring project plans across the Major Projects Portfolio (MPP) – including Beaulieu New Station and Cambridge South Infrastructure Enhancement (CSIE). This full time role is based in our Stratford office, with a requirement to work out of this location three days per week minimum.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272761&p_spid=7573898&refsh=0"
  },
  {
    "id": "2272864",
    "title": "Seasons Delivery Specialist",
    "location": {
      "city": "Basingstoke",
      "postcode": "RG21 4FS",
      "lat": 51.271493,
      "lng": -1.072379
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "Are you a dynamic and passionate professional ready to lead the route in all aspects of seasons management and weather-related incidents? We are looking for a Seasonal Delivery Specialist to be the driving force behind our seasonal plans, ensuring the safe and effective delivery of services to our customers.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2024-01-02"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272864&p_spid=7574951&refsh=0"
  },
  {
    "id": "2273067",
    "title": "Asset Protection Scheme Interface Manager",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "To safely and seamlessly integrate externally funded projects into the railway environment, whilst minimising impacts on railway operations and operational infrastructure. Leverage knowledge and understanding of rail related risks and constraints to facilitate solutions that align with the external client objectives whilst meeting all stakeholder requirements. To provide guidance to the external client team to support adherence to relevant Network Rail and rail industry standards and processes.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2024-01-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273067&p_spid=7574004&refsh=0"
  },
  {
    "id": "2273066",
    "title": "Shift Station Manager",
    "location": {
      "city": "London",
      "postcode": "N1C 4QP",
      "lat": 51.53143,
      "lng": -0.126122
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "It's an exciting time to be joining Network Rail High Speed. We are making the biggest fundamental change to our business in its history, as we look to modernise and deliver an even more sustainable and high performing high-speed railway than we already have today!As a Shift Station Manager, you'll be managing the day to day performance of the station team within set resources, budgets and objectives. Providing consistent and excellent customer service is at the heart of what our Shift Station Managers do while also providing an operationally safe and secure station environment for all our stakeholders, such as TOCs, passengers and retailers.We're now recruiting for roles at St Pancras International, Stratford International and Ebbsfleet International. However, occasional travel to our other offices and site locations along the high-speed line and across the network is/may be expected.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273066&p_spid=7574003&refsh=0"
  },
  {
    "id": "2269929",
    "title": "Principal Technical Officer (Electrification & Plant)",
    "location": {
      "city": "Ashford",
      "postcode": "TN24 0PU"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide technical support to the Maintenance Engineering team.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-10-18",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269929&p_spid=7550806&refsh=0"
  },
  {
    "id": "2272839",
    "title": "Train Running Controller",
    "location": {
      "city": "Birmingham",
      "postcode": "B7 4AD",
      "lat": 52.488652,
      "lng": -1.866
    },
    "salary": {
      "min": "60825",
      "max": "60825"
    },
    "description": "Manage train services on the network to meet the agreed train plan both during normal operation and disruptive events. Deliver PPM, Train Operator franchise commitments, Network Rail and other customer targets. Lead and manage the performance of the daily train plan and take early action to minimise customer disruption. Communicate effectively regarding train performance and train regulation, within control, with signallers and relevant Train Operators. Define and implement contingency plan and service recovery arrangements.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272839&p_spid=7574926&refsh=0"
  },
  {
    "id": "2257774",
    "title": "Technician (Cables)",
    "location": {
      "city": "Wimbledon",
      "postcode": "SW19 3QJ",
      "lat": 51.417246,
      "lng": -0.20818
    },
    "salary": {
      "min": "30522",
      "max": "30522"
    },
    "description": "Working in all weathers on the frontline, you'll carry out maintenance to faulting on Telecoms cables, including jointing of copper cables and fibre jointing. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-05-17",
      "end": ""
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2257774&p_spid=7476542&refsh=0"
  },
  {
    "id": "2272585",
    "title": "Section Planner [Track] - Gateshead Raven House",
    "location": {
      "city": "Gateshead",
      "postcode": "NE8 2TD",
      "lat": 54.962649,
      "lng": -1.609413
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Using corporate planning processes, systems and databases, undertake the development of detailed, fully resourced and optimised work plans for approval by Section Managers.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272585&p_spid=7572044&refsh=0"
  },
  {
    "id": "2272802",
    "title": "Team Organiser",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To support a senior executive or a complex team and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272802&p_spid=7574889&refsh=0"
  },
  {
    "id": "2273386",
    "title": "Principal Technical Officer - Exeter Central Station",
    "location": {
      "city": "Exeter",
      "postcode": "EX4 3SB",
      "lat": 50.725969,
      "lng": -3.533302
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide technical support to the Maintenance Engineering team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273386&p_spid=7576143&refsh=0"
  },
  {
    "id": "2272373",
    "title": "Performance Improvement Co-ordinator",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "We are currently seeking a Performance Improvement Co-Ordinator to implement the company performance improvement processes in the route/area to deliver train service improvement across the railway industry.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-03"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272373&p_spid=7571982&refsh=0"
  },
  {
    "id": "2272804",
    "title": "Team Organiser",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To support a senior executive or a complex team and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272804&p_spid=7574891&refsh=0"
  },
  {
    "id": "2272805",
    "title": "Team Organiser",
    "location": {
      "city": "Derby",
      "postcode": "DE23 8JQ",
      "lat": 52.911618,
      "lng": -1.464705
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To support a senior executive or a complex team and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272805&p_spid=7574892&refsh=0"
  },
  {
    "id": "2272648",
    "title": "Resourcing Business Partner Support (12 month secondment/ 12 month Fixed Term Contract)",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "We have a 12-month Secondment/ FTC opportunity for a Resourcing Business Partner Support to be part of Network Rail's Southern Region Resourcing Team. Based at London Blackfriars, as the Resourcing Business Partner Support, you will provide end to end recruitment service for a specific client group with your knowledge of appropriate recruitment methods and sourcing strategy The Resourcing Team manage the internal and external recruitment process from attraction and selection through to on-boarding. They are responsible for recruiting high-quality candidates who are the best people for our business. Our aim is to provide this service in a swift, pro-active and process-led manner. You'll work alongside other Resourcing Business Partner Supports and Resourcing Business Partners and will be part of a great team, who enjoy working collaboratively to support each other. You'll also work closely alongside HR colleagues in the wider HR team. This post is aligned to our Sussex Route. As well as the opportunity to have your own dedicated client group, you'll have the opportunity to be involved in Workstreams such as Diversity and Inclusion and process improvement initiates. If this sounds of interest, we'd love to hear from you.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272648&p_spid=7572935&refsh=0"
  },
  {
    "id": "2273108",
    "title": "Shift Station Manager",
    "location": {
      "city": "London",
      "postcode": "SE1 8SW",
      "lat": 51.502706,
      "lng": -0.113277
    },
    "salary": {
      "min": "34000",
      "max": "38305"
    },
    "description": "The Shift Station Manager manages the day to day performance of the Station team within set resources and budgets, in accordance with the company processes and objectives. They professionally deliver excellent and consistent customer service - providing an operationally safe, secure and quality station environment for all station stakeholders including TOCs, tenants, passengers, station users and retailers. Please Note: This role requires the incumbent to hold National Security Vetting / have passed a Counter Terrorism check. The successful candidate will not be permitted to start in the role until they have this clearance.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273108&p_spid=7575053&refsh=0"
  },
  {
    "id": "2269086",
    "title": "Infrastructure Maintenance Workforce HSE Advisor",
    "location": {
      "city": "Banbury",
      "postcode": "OX16 5AB",
      "lat": 52.059148,
      "lng": -1.326721
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "Provide advice and support to the Infrastructure Maintenance Delivery team on all workforce health, safety and environmental issues. Promote a positive cultural and behavioural change in all aspects of workforce health, safety and environmental management.",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2269086&p_spid=7544842&refsh=0"
  },
  {
    "id": "2273091",
    "title": "Human Resources Business Partner Support",
    "location": {
      "city": "Blackfriars",
      "postcode": "EC4V 3DS",
      "lat": 51.511794,
      "lng": -0.101906
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Provide proactive, professional HR support to HR Business Partner teams to enable the delivery of value add HR support and the people plan for the supported organisation/s.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273091&p_spid=7575036&refsh=0"
  },
  {
    "id": "2272816",
    "title": "Signalling Support Technician - West Ealing Depot",
    "location": {
      "city": "West Ealing",
      "postcode": "W13 0HR",
      "lat": 51.514138,
      "lng": -0.32929
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Assist with the provision of technical support to the Engineering team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272816&p_spid=7574903&refsh=0"
  },
  {
    "id": "2272615",
    "title": "Senior Development Manager",
    "location": {
      "city": "London",
      "postcode": "E20 1EJ",
      "lat": 51.544336,
      "lng": -0.006347
    },
    "salary": {
      "min": "46701",
      "max": "52539"
    },
    "description": "The main purpose of this role is to support the development of the eastern section of East West Rail between Bedford and Cambridge. East West Rail Ltd are a body entirely separate from Network Rail, but the Senior Development Manager will act as Network Rail's project sponsor, working closely with our asset protection team to assist East West Rail with the development of their options while also ensuring that Network Rail's interests are protected. The role will require close working with representatives from East West Rail as well as stakeholders from across Network Rail and the industry to ensure that a broad range of views and experience are brought into the design development. Typical activities could include supporting East West Rail with regard to timetable and performance modelling; conducting design reviews with stakeholders; representing Network Rail at optioneering meetings; gathering requirements and managing key interfaces. The senior development manager will also be required to ensure that the asset protection team is adequately funded via funding agreements with East West Rail that will also require the securing of internal authority from Network Rail's panels. In addition to supporting East West Rail, the senior development manager also has a broader role in leading the development of other projects through their early stages by managing the creation of Strategic Outline Business Cases (SOBCs) that can be submitted to government for funding approval. It is important to note that this role is largely focused on projects in the Anglia and the East Midlands Routes. The creation of SOBCs involves similar activities to those described in supporting East West Rail, with the key differences being that Network Rail would lead the work directly ourselves, and would also therefore own the business cases.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-17",
      "end": "2023-12-01"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272615&p_spid=7572074&refsh=0"
  },
  {
    "id": "2273057",
    "title": "Operative - Works Delivery Signalling x 2",
    "location": {
      "city": "London",
      "postcode": "SW11 1SB",
      "lat": 51.462439,
      "lng": -0.172901
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "An introduction to WessexWe run one of the busiest parts of Britain's railway, with 212 million passenger journeys across our network every year. Waterloo station is the busiest in the country with around 330,000 passengers a day – equal to four full capacity crowds at the Twickenham stadium. ​ Our purpose is to connect people, businesses and communities, to support economic growth for all. I firmly believe it is only when we put passengers and freight at the heart of our operations, will we ensure our customers safely get to where they want to go on time, whilst keeping them informed and minimising service impacts during any potential disruption. We serve the South and the South West of Britain connecting cities and towns from our three managed stations at Waterloo, Guildford and Clapham Junction to places such as Bournemouth and Southampton. Our Infrastructure Maintenance Depots are based across the Wessex Route, from Central London, Woking, Portsmouth, Bournemouth, Salisbury & Yeovil. We are currently recruiting for the following locations: Woking, Guildford & FelthamWant to learn more about what it's like working in our maintenance teams, please click here https://www.networkrail.co.uk/stories/whats-it-like-to-work-in-maintenance-engineering",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273057&p_spid=7573994&refsh=0"
  },
  {
    "id": "2271595",
    "title": "Finance Business Partner",
    "location": {
      "city": "Milton Keynes",
      "postcode": "MK9 1EN",
      "lat": 52.037579,
      "lng": -0.777564
    },
    "salary": {
      "min": "43588",
      "max": "49036"
    },
    "description": "Join Our Team as a Finance Business Partner in Milton Keynes! Are you a finance enthusiast who thrives on making a real impact in the business world? As Finance Business Partner, you will work as a key member of the Network Rail Efficiency (Fishbone Framework) team in Group Finance, under the direction of the Senior Finance Business Partner. Network Rail has a commitment to deliver £4bn efficiency savings in CP6 and £3.7bn in CP7 on Renewals and OPEX, and a target of 15% Efficiency saving on the full Enhancement Portfolio in CP6. Who are we looking for? We're on the hunt for a Finance Business Partner to join our passionate team in Milton Keynes. This position is responsible for managing the OMSR Fishbone Framework process including business partnering with all regions and functions. You will provide pro-active, value-add finance support, analysis, guidance, assurance, and positive challenge to business leaders across the functions and routes.",
    "department": "Finance",
    "dates": {
      "start": "2023-11-20",
      "end": "2023-12-04"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271595&p_spid=7567827&refsh=0"
  },
  {
    "id": "2270896",
    "title": "Operative [MMT] - Darlington Park Lane",
    "location": {
      "city": "Darlington",
      "postcode": "DL1 5AE",
      "lat": 54.518932,
      "lng": -1.548654
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day.Acritical part of the work we do is the daily upkeep of the rail network. As an operative you'll work outdoors in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users.Our operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We'refocused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network.Andif you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270896&p_spid=7560904&refsh=0"
  },
  {
    "id": "2273394",
    "title": "Section Supervisor [Off Track]",
    "location": {
      "city": "Brighton",
      "postcode": "BN1 3TU",
      "lat": 50.832672,
      "lng": -0.14443
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Assist the Section Manager in the inspection, maintenance, and renewal of assets to standards and within agreed resource levels, budget, and unit cost measures. Supervise the delivery of work and undertake specific inspections as required. Assist in the management of staff as directed",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-29",
      "end": "2023-12-13"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273394&p_spid=7576151&refsh=0"
  },
  {
    "id": "2271054",
    "title": "Infrastructure Maintenance Engineer (Hereford)",
    "location": {
      "city": "Hereford",
      "postcode": "HR1 1BB",
      "lat": 52.061798,
      "lng": -2.711285
    },
    "salary": {
      "min": "85395",
      "max": "96070"
    },
    "description": "Brief Description (Internal & External) You will lead and direct the Engineering team, your three main depots will be Hereford, Machynlleth and Llandrindod Wells, where you will spend 1 day a week in each of these locations. You will ensure your teams remain complaint in inspection, maintenance, and project related works for all Infrastructure assets to meet relevant standards. You will also drive culture transformation for safety and asset performance, creating continual improvement and deliver safety, compliance and performance strategies, following business processes in order to deliver a compliant, well performing asset through a safe large multi-disciplinary team. Please check out the document attached to this vacancy for more information on what it's like to work in the Wales route team in Wales & Western region! Byddwch yn arwain ac yn cyfarwyddo'r tîm peirianneg, eich tri phrif ddepo fydd Henffordd, Machynlleth a Llanrindod Wells, lle byddwch chi'n treulio 1 diwrnod yr wythnos ym mhob un o'r lleoliadau hyn. Byddwch yn sicrhau bod eich timau'n parhau i fod yn gwyno o ran archwilio, cynnal a chadw a gwaith sy'n gysylltiedig â phrosiectau i bob ased seilwaith fodloni safonau perthnasol. Byddwch hefyd yn gyrru trawsnewid diwylliant ar gyfer diogelwch a pherfformiad asedau, gan greu gwelliant parhaus a sicrhau diogelwch, cydymffurfio a strategaethau perfformiad, yn dilyn prosesau busnes er mwyn sicrhau ased sy'n cydymffurfio, sy'n perfformio'n dda trwy dîm amlddisgyblaethol mawr diogel diogel.Edrychwch ar y ddogfen sydd ynghlwm wrth y swydd wag hon i gael mwy o wybodaeth am sut beth yw gweithio yn nhîm Llwybr Cymru yn Rhanbarth Cymru a Gorllewinol!",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-21",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271054&p_spid=7560962&refsh=0"
  },
  {
    "id": "2273031",
    "title": "Shift Station Manager",
    "location": {
      "city": "London",
      "postcode": "NW1 2RT",
      "lat": 51.528672,
      "lng": -0.132535
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "Manage the day to day performance of the Station team within set resources and budgets, in accordance with the company processes and objectives. Professionally delivering excellent and consistent customer service, and providing an operationally safe, secure and quality station environment for all station stakeholders including TOCs, tenants, passengers, station users and retailers.Please Note: This role requires the incumbent to hold securityvetting, no start date or hire should be progressed until the required vettingclearance has been obtained. For further information, please contact NationalSecurityVetting@Networkrail.co.uk(Delete before advertising)",
    "department": "North West & Central Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273031&p_spid=7573968&refsh=0"
  },
  {
    "id": "2272108",
    "title": "Senior Technician (SISS)",
    "location": {
      "city": "London",
      "postcode": "SW11 2LG",
      "lat": 51.46487,
      "lng": -0.166293
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "The Station Information, Security Systems Technician role involves working on Network Rail London Major Stations on a range of Telecoms equipment.The role will require you to undertaking faulting and maintenance activities with Customer Information Systems, Clocks, Passenger Help Points and Public Address systems.You will be part of a small telecoms team based at London Victoria Station, rostered to work a combination of days and nights shifts. There is an on call commitment and a large percentage of the work will include working at height.Any experience of working with audio/visual equipment and/or IT networking would be beneficial.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-09",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272108&p_spid=7570045&refsh=0"
  },
  {
    "id": "2272107",
    "title": "Technician [SISS]",
    "location": {
      "city": "London",
      "postcode": "SW11 2LG",
      "lat": 51.46487,
      "lng": -0.166293
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "The Station Information, Security Systems Technician role involves working on Network Rail London Major Stations on a range of Telecoms equipment.The role will require you to undertaking faulting and maintenance activities with Customer Information Systems, Clocks, Passenger Help Points and Public Address systems.You will be part of a small telecoms team based at London Victoria Station, rostered to work a combination of days and nights shifts. There is an on call commitment and a large percentage of the work will include working at height. Any experience of working with audio/visual equipment and/or IT networking would be beneficial.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-09",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272107&p_spid=7570044&refsh=0"
  },
  {
    "id": "2252970",
    "title": "Asset Protection Scheme Interface Manager",
    "location": {
      "city": "Swindon",
      "postcode": "SN1 1BD",
      "lat": 51.56344,
      "lng": -1.786559
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To safely and seamlessly integrate externally funded projects into the railway environment, whilst minimising impacts on railway operations and operational infrastructure. Leverage knowledge and understanding of rail related risks and constraints to facilitate solutions that align with the external client objectives whilst meeting all stakeholder requirements. To provide guidance to the external client team to support adherence to relevant Network Rail and rail industry standards and processes. Ideally have a good understanding of risk assessment in relation to construction methods and a good understanding and appreciation of construction programmes for estimating durations and forecasts in appreciation of customer proposals. Ability to appreciate construction drawings and be a good communicator to facilitate and aid the customer for the delivery of their work proposals.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-03-07",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2252970&p_spid=7433474&refsh=0"
  },
  {
    "id": "2272836",
    "title": "Delay Resolution Co-ordinator - Permanent role - 2 roles available",
    "location": {
      "city": "York",
      "postcode": "YO1 6JT",
      "lat": 53.956981,
      "lng": -1.090262
    },
    "salary": {
      "min": "21580",
      "max": "46340"
    },
    "description": "Manage and monitor customer performance, to check that both Network Rail's interest is protected and customers' issues are addressed.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-22",
      "end": "2023-12-06"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272836&p_spid=7574923&refsh=0"
  },
  {
    "id": "2273152",
    "title": "Shift Station Manager",
    "location": {
      "city": "London",
      "postcode": "SE1 2TF",
      "lat": 51.50462,
      "lng": -0.085867
    },
    "salary": {
      "min": "35582",
      "max": "40029"
    },
    "description": "The Shift Station Manager manages the day to day performance of the Station team within set resources and budgets, in accordance with the company processes and objectives. They professionally deliver excellent and consistent customer service - providing an operationally safe, secure and quality station environment for all station stakeholders including TOCs, tenants, passengers, station users and retailers. Please Note: This role requires the successful candidate to hold National Security Vetting / have passed a Counter Terrorism check. The successful candidate will not be permitted to start in the role until they have this clearance. For further information, please contact NationalSecurityVetting@networkrail.co.uk.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273152&p_spid=7575059&refsh=0"
  },
  {
    "id": "2272450",
    "title": "Operative Track Maintenance",
    "location": {
      "city": "Orpington",
      "postcode": "BR6 8AD",
      "lat": 51.374234,
      "lng": 0.088901
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As an Operative you'll work in a small team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Operative community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-16",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272450&p_spid=7572009&refsh=0"
  },
  {
    "id": "2273243",
    "title": "Train Delay Attributor - York IECC (x3 Roles)",
    "location": {
      "city": "York",
      "postcode": "YO26 4ZD",
      "lat": 53.956107,
      "lng": -1.097255
    },
    "salary": {
      "min": "41883",
      "max": "41883"
    },
    "description": "Your decisions make all the difference...As a train delay attributor, you'll be passionate about providing great customer service, so when trains are delayed passengers, train and freight operating companies are fully informed of the situation in a timely manner. Our attribution team monitors real time train operations and allocates reasons for any delays.And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work.",
    "department": "Eastern Region",
    "dates": {
      "start": "2023-11-28",
      "end": "2023-12-12"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273243&p_spid=7576100&refsh=0"
  },
  {
    "id": "2270493",
    "title": "Team Leader (Signalling Maintenance)",
    "location": {
      "city": "London",
      "postcode": "SE1 0NS",
      "lat": 51.504834,
      "lng": -0.101247
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "From establishing safety arrangements to checking the quality of work, you'll direct and inspire the success of a team involved in everything from inspection and faulting, through to maintenance and renewal.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-10-19",
      "end": "2023-12-05"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2270493&p_spid=7556901&refsh=0"
  },
  {
    "id": "2271102",
    "title": "Section Planner, Administrator [Overhead Line Equipment] 6 month FTC/Secondment -Didcot",
    "location": {
      "city": "Didcot",
      "postcode": "OX11 7HJ",
      "lat": 51.619119,
      "lng": -1.256837
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Undertake the development of detailed, fully resourced and optimised work plans for approval and provide an accurate and effective administrative support to the line manager and his team.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-10-31",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Fixed-Term Employee",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271102&p_spid=7561010&refsh=0"
  },
  {
    "id": "2273144",
    "title": "Technician (Track Maintenance)",
    "location": {
      "city": "Ashford",
      "postcode": "TN24 0PU"
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273144&p_spid=7574031&refsh=0"
  },
  {
    "id": "2271708",
    "title": "Section Supervisor (Track)",
    "location": {
      "city": "Orpington",
      "postcode": "BR6 8AD",
      "lat": 51.374234,
      "lng": 0.088901
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Assist the Section Manager in the inspection, maintenance, and renewal of assets to standards and within agreed resource levels, budget, and unit cost measures. Supervise the delivery of work and undertake specific inspections as required. Assist in the management of staff as directed",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-27",
      "end": "2023-12-11"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2271708&p_spid=7568845&refsh=0"
  },
  {
    "id": "2272751",
    "title": "Team Organiser - Gloucester Pway",
    "location": {
      "city": "Exeter",
      "postcode": "EX4 3SB",
      "lat": 50.725969,
      "lng": -3.533302
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "To support a senior executive or a complex team, and provide an efficient and effective general administrative and secretarial support service. Provide technical input interface with maintaining relevant records.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-11-23",
      "end": "2023-12-07"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2272751&p_spid=7573888&refsh=0"
  },
  {
    "id": "2266137",
    "title": "Section Manager",
    "location": {
      "city": "Slough",
      "postcode": "SL1 1XW",
      "lat": 51.510907,
      "lng": -0.590733
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. You will be accountable for managing a section of the rail network. You'll manage and develop a large maintenance team, and drive safety and efficiency across diverse works.",
    "department": "Wales & Western Region",
    "dates": {
      "start": "2023-08-29",
      "end": "2023-11-30"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2266137&p_spid=7532678&refsh=0"
  },
  {
    "id": "2273143",
    "title": "Technician (Track Maintenance)",
    "location": {
      "city": "Tonbridge",
      "postcode": "TN9 2AF",
      "lat": 51.19027,
      "lng": 0.276856
    },
    "salary": {
      "min": "",
      "max": ""
    },
    "description": "Working in all weathers on the frontline, you'll carry out everything from maintenance to faulting. What's more, you'll develop your management skills by deputising for the Team Leader. You'll help keep our nation moving every single day. A critical part of the work we do is the daily upkeep of the rail network. As a Technician you'll work outdoors in a team, supporting essential maintenance to keep the railway running safely and smoothly for passengers and freight users. Our Technician community comes from a variety of different backgrounds, and this might be the first time that you've even considered a career in rail. We're focused on your transferrable skills and behaviours and if you can demonstrate that, then we will provide you with all the necessary training to have you working safely and competently out on the network. And if you make the grade then you can look forward to a rewarding and fulfilling career with a company that recently joined the top 50 in the Glassdoor's 2021 Best Places to Work. As part of the application process for a Technician, all applicants are required to complete some pre-screening questions. These questions require time and concentration so please prepare for this accordingly, ensuring you read each question carefully before responding.",
    "department": "Southern Region",
    "dates": {
      "start": "2023-11-24",
      "end": "2023-12-08"
    },
    "status": "Full Time",
    "type": "Permanent",
    "applyLink": "https://iebsprodnwrl.opc.oracleoutsourcing.com/OA_HTML/OA.jsp?OAFunc=IRC_VIS_VAC_DISPLAY&p_svid=2273143&p_spid=7574030&refsh=0"
  }
]